[{"Date Added": "01/25/2023", "Job ID": "3453899476", "Url": "https://www.linkedin.com/jobs/view/3453899476/", "Job Title": "Research Engineer", "Company": "Solvay", "Description": "Solvay is a science company whose technologies bring benefits to many aspects of daily life. Our purpose—we bond people, ideas and elements to reinvent progress—is a call to go beyond, to reinvent future forms of progress and create sustainable shared value for all through the power of science. In a world facing an ever-growing population and quest for resources, we aim to be the driving force triggering the next breakthroughs to enable humanity to advance while protecting the planet we all share.\n\nWe bond with customers and partners to address today and tomorrow’s megatrends. As a global leader in Materials, Chemicals and Solutions, Solvay brings advancements in planes, cars, batteries, smart and medical devices, water and air treatment, to solve critical industrial, social and environmental challenges. You can count on our innovative solutions to contribute to safer, cleaner and more sustainable future.\n\nImportant EEO information related to opening in the US\nSolvay is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other legally protected characteristics. Click on the links to read \"The EEO is the Law\" poster and the “EEO is the Law” poster Supplement.\nWe will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. For more information, please click here.\nSolvay is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to humanresources.na-us@solvay.com and let us know the nature of your request and your contact information.\nRole Overview\nWe are looking for:\nA team member for a global, high-achieving, and innovative team who is committed to accelerating Solvay Materials’ growth in the area of specialty thermoplastic compoundsA driven research professional who will develop, monitor, evaluate, and implement advancements in thermoplastic compounding technologyA project leader for the industrialization of new products and compounding processes, including experimental and pilot work all the way to full manufacturing implementation\n\nWe count on you for:\nMaintaining a safe work environment for self and othersPerforming process development and optimization work at both an experimental and pilot scaleLeading the scale-up of new products to ensure successful and sustainable manufacturability and commercializationEvaluating new or improved technologies related to compounding and leading their implementation in manufacturingClosely collaborating with a wide range of stakeholders including product development, product management, supply chain, manufacturing, technical service, and our customers to deliver new products to the marketExecuting critical business support activities including line and raw material qualifications, product quality improvements, or manufacturing efficiency initiatives.Serving as a subject matter expert for the organization in the areas of compounding and the product lines you work with.Develop and document organizational and scientific knowledgeDirect and coach 1 or 2 researchers who will help execute your scientific work\n\nYou can count on us for:\nOpportunities for advancement including both a technical and management ladderA collaborative and dynamic role which will expose you to a wide variety of projects and functions across the organizationOpportunities to quickly and frequently work on programs which have a large impact and influence on the organizationAn R&D team with a culture of intellectual curiosity, technical rigor, practicality, working together, open feedback, and a desire to grow togetherAn organization which values its employees, rewards performance, and prioritizes research & innovation and sustainable development for its continued success\n\nYou will bring:\nEducation and Experience\nPh.D. (preferred) in polymer science/engineering, chemical engineering, chemistry, mechanical engineering, or related fields. BS/MS with 5+ years of relevant work experience will also be considered.Experience directing and executing research projects\n\nTechnical Skills\nExcellent technical foundation in polymer science, especially structure-property relationships and polymer processing.Experience with engineering or specialty thermoplastics and their processing is preferred\n\nDesired behaviors\nVery strong communication (oral and written), organizational, and interpersonal/teamwork skillsDemonstrated leadership and coaching skills and a desire to develop othersAbility to handle multiple projects, balance priorities, and execute with appropriate urgencyHands on mechanical skills/aptitude is desirable\n\nYou will get:\nCompetitive salary: The U.S. annual base salary range reasonably expected to be paid for this new hire is: $90,000. to $130,000. Since actual compensation packages are based on a variety of factors unique to each candidate, we may ultimately pay more or less than the posted base salary range. Total compensation for this role also includes bonus and/or other incentives.Health insuranceLife insurance16 weeks of maternity/paternity and co-parenting leaveFree language courses (24 languages available)Additional local benefits\n\nAdditional Information:\nLocation: Alpharetta (GA, USA)Travelling up to 20%Relocation package\n\n \n\nAdditional Information\nSolvay’s purpose is to bond people, ideas and elements to reinvent progress. We can only fulfill this purpose with a diverse workforce that feels respected and appreciated, and has equal opportunities to work, grow and thrive. Our differences, visible or not, are valued. As Solvay seeks to promote unity and not uniformity, we invite you - regardless of background, age, gender, race, national origin, ethnicity, religion, sexual orientation, ability or identity - to consider a future with us.\n\n\nImportant Important EEO information related to opening in the US \n\nSolvay is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other legally protected characteristics. Click on the links to read \"The EEO is the Law\" poster and the “EEO is the Law” poster Supplement.\n\n We will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. For more information, please click here.\n\n Solvay is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to hrstaffingoffice.na-us@solvay.com or call 800-311-3555 and let us know the nature of your request and your contact information.\n\n", "Years Experience": "5+ years", "Years Context": "....ields. BS/MS with 5+ years of relevant work experience will also be considered.Experience directing and executing research pro....", "Skills": "ios(1)"}, {"Date Added": "01/25/2023", "Job ID": "3453688613", "Url": "https://www.linkedin.com/jobs/view/3453688613/", "Job Title": "Retail Sales Associate", "Company": "CubeSmart", "Description": "Overview\nAt CubeSmart, our culture makes the difference. When we say it’s what’s inside that counts, we are saying “you count”\nResponsibilities\nWhat CubeSmart offers:\nNON-TRADITIONAL HOURS COMPETITIVE HOURLY RATE and BONUS OPPORTUNITIES\nPAID TIME OFF – VACATION, SICK, and HOLIDAYS GENEROUS HEALTH BENEFITS\n401k RETIREMENT PLAN With COMPANY MATCH SHORT TERM DISABILITY\nTUITION REIMBURSEMENT STORAGE DISCOUNTS\nYour role at CubeSmart…\nListen to customers to understand their unique situation Become an expert in self-storage by renting storage spaces and managing the leasing processTake ownership of your store’s retail businessParticipate in operations activities such as keeping the property clean, performing lock checks, and showing units to potential customersUtilize our Point of Sales system (POS) to take payments, manage customer accounts, and maintain inventoryOther duties as assigned\nYou’ll love working here because…\n YOU WILL MAKE A DIFFERENCE – YOU WILL BELONG TO A TEAM – YOU WILL GROW WITH US\nQualifications\nYou’d be great in this role if you have…\nA positive and outgoing personality with a passion for helping peopleExperience in retail or customer service preferredBasic computer skills\nWe also want you to know that...\nYou must have the ability to work Saturdays and SundaysValid driver’s license and insurance with access to reliable transportation used during the workdayWhile performing the duties of this job, you will be frequently required to stand, sit, kneel, crouch, crawl, bend, climb or balance on a ladderOn occasion, you may need to lift and/or move up to 50 pounds\nNote:If you have experience working in any of the following types of jobs, we encourage you to apply: Sales Associate, Storage Manager, Customer Service Representative (CSR), Retail Associate, Cashier, Store Associate, Keyholder, Retail, Retail Storage, Restaurant, Hospitality, and Hotel, Front Desk Agent, Leasing Agent, Rental Agent (i.e. car rental, RV rental, self-storage rental, storage rental, apartment rental, etc.) Property Management, Retail Sales Lead or Team Lead.\nWe are an Equal Opportunity Employer, Minority/Female/Veteran/Individuals with Disabilities/Sexual Orientation/Gender Identity.", "Years Experience": "", "Years Context": "", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3452896554", "Url": "https://www.linkedin.com/jobs/view/3452896554/", "Job Title": "Software Developer 1", "Company": "Dice", "Description": "job summary:\nThis 100% remote role will require a Jr Developer to put his/her skills to the test! This vital role will be responsible for collaborating with other development staff to achieve quality and consistency and participating in architecture, design and code reviews. Heavy java knowledge is a must-have, operating in an agile environment.\nlocation: ATLANTA, Georgia\njob type: Contract\nsalary: $60 - 62 per hour\nwork hours: 8am to 5pm\neducation: Bachelors\nresponsibilities:\nFollows company software development lifecycle to design, code, configure, test, debug, and document system and application programs. Assists in preparing technical design specifications based on functional requirements and analysis documents. Reviews functional requirements, analysis and design documents and provides feedback. Collaborates with other development staff to achieve quality and consistency. Participates in architecture, design and code reviews. . Develops and maintains operational and system level documentation.\nqualifications:\nExperience level: Entry LevelMinimum 3 years of experienceEducation: Bachelors\nskills:\nSQLAgile MethodologyJAVA DEVELOPER\nEqual Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.\nAt Randstad, we welcome people of all abilities and want to ensure that our hiring and interview process meets the needs of all applicants. If you require a reasonable accommodation to make your application or interview experience a great one, please contact HRsupport@randstadusa.com.\nPay offered to a successful candidate will be based on several factors including the candidate's education, work experience, work location, specific job duties, certifications, etc. In addition, Randstad offers a comprehensive benefits package, including health, an incentive and recognition program, and 401K contribution (all benefits are based on eligibility).\nFor certain assignments, Covid-19 vaccination and/or testing may be required by Randstad's client or applicable federal mandate, subject to approved medical or religious accommodations. Carefully review the job posting for details on vaccine/testing requirements or ask your Randstad representative for more information.", "Years Experience": "3 years", "Years Context": "....Entry LevelMinimum 3 years of experienceEducation: Bachelors....", "Skills": "java(1)\nSQL(1)\nJAVA(1)"}, {"Date Added": "01/25/2023", "Job ID": "3450085879", "Url": "https://www.linkedin.com/jobs/view/3450085879/", "Job Title": "Retail Sales Associate", "Company": "Men's Wearhouse", "Description": "We invest in our people and continuously work towards fostering an inspirational, inclusive, and innovative culture, so that every team member has a true sense of belonging. We help people confidently express their true selves so they can be their best. \nWe Have Immediate Openings – Start Right Away! \n Competitive hourly rates Flexible schedules to meet your availability! Tuition reimbursement Generous employee discount on first purchase Ongoing discounts on purchase made at any Tailored Brands store.\nWhat You Bring\n Customer service – or as we call it – culture of customer-obsession by being customer-ready and delivering a world-class experience every day Desire to learn and adapt to new programs Ability to work well and consult with retail sales associates at all levels and contribute to a positive work environment\nOur Retail Sales Associates are responsible for all aspects of the customer experience within multiple businesses (retail, rental, custom, and omni-channel) within a store location including, but not limited to:\n Engage as a member of a high-performing team through trust, commitment, and a focus on results. Build a relationship with your customer from greeting through post-sale contact. Consistently demonstrate the benchmark selling techniques for retail sales, custom clothing sales, and special occasion rentals. Continuously encourage and participate in team selling and positively impact the achievement of the store sales volume and metrics goals. Assist with visually merchandising, set up, and other store-related projects, as well as conducting merchandise stock counts. Handle the cash register, as a cashier, at the point of sale in the store.\nPhysical Requirements\n Ability to stand and walk for the majority of work shift, frequently bend, squat and twist, lift up to 50 lbs., climb a ladder to reach merchandise and or supplies, and see and distinguish between fabric patterns and colors.\nYou may have the opportunity to voluntarily work between multiple store or site locations, and across multiple brands. \nReasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\nOur company celebrates diversity and provides equal employment opportunity to all applicants and employees without regard to race, color, sex, sexual orientation, gender identity or expression, national origin, religion, veteran or military status, age, physical or mental disability, marital status, or any other protected status under the law.\nWork Locations: 03101 Town Center Plaza 425 Ernest W Barrett Pkwy Nw Ste 5000 Kennesaw 30144\nJob: Sales\nOrganization: Men's Wearhouse\nShift: Variable\nZone: South", "Years Experience": "", "Years Context": "", "Skills": "express(2)"}, {"Date Added": "01/25/2023", "Job ID": "3449508551", "Url": "https://www.linkedin.com/jobs/view/3449508551/", "Job Title": "Rehab Team Leader", "Company": "Ageility", "Description": "Rehab Team Leader (PTA)\n$2500 sign on bonus!\nQuarterly Bonus up to $1,200.00complete benefit package- health, dental, vision, 401k with match, PTO, NO Night & No WeekendsBachelor's degree required\nResponsibilities Include But Not Limited To\nPlanning, organizing, directing and evaluating the rehabilitation program, services and personnel. In a manner that supports the goals of the designated facility and Five Star Quality Care Inc.; while meeting federal and state regulations and state specific practice acts for Physical, Occupational and Speech Language Pathology.The Director of Rehabilitation may also be responsible for direct patient care and delivery of therapy services in his/her discipline.\nQualifications\nGraduate of an accredited college or university with an associates or Bachelors degree in Physical Therapy Assistant, or Occupational Therapy Assistant.Proven ability to lead a team of professional and paraprofessional staff members. Demonstrated skills to work in and foster a team environment.Licensed in the state in which the therapist resides or practices, according to state requirements.\nAbout Ageility\n\nFive Star Senior Living and Ageility are operating divisions of AlerisLife, a provider of an evolving portfolio of residential and lifestyle services to older adults who want to live life to the fullest. We are approximately 10,000 team members serving in 29 states as well as our corporate AlerisLife headquarters located outside of Boston. Together, we’re assembling a suite of best-in-class products and services to inspire joyful living in a growing range of settings.\n\nAgeility provides both rehabilitation and fitness services for a true continuum of care and return to optimal health. Our Ageility team specializes in older adults, delivering physical, occupational and speech therapy services and personalized fitness programming in more than 200 clinics nationwide. We serve customers within Five Star communities and other senior living communities and settings. At Ageility, we’re reimagining rehab for older adults who are reimagining aging. We invite you to come join a team where you can make a difference!\n\nEEOC\n\nAgeility, and its parent, subsidiary and affiliated entities, prohibits discrimination against any employee or applicant for employment with regard to race, color, religion, sex, sexual orientation, gender identity or expression, national origin, age, marital status, genetic information, disability or veteran status. In addition to federal requirements, Ageility, and its parent, subsidiary and affiliated entities, complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has communities and/or facilities. This policy applies to all terms and conditions of employment, including, but not limited to, recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\n\nVaccine Requirements\n\nPlease note that AlerisLife and its subsidiaries require COVID-19 vaccination and/or proof of COVID-19 vaccination for all employees as a condition of employment, subject to medical, religious or other accommodations or exemptions required by law. We believe this requirement is vital to keeping everyone at AlerisLife and in our communities safe. Any applicant requiring an accommodation in connection with the hiring process and/or to perform the essential functions of the position for which the applicant has applied should make a request to the recruiter or hiring manager.\n\nN/A", "Years Experience": "", "Years Context": "", "Skills": "express(1)\naws(1)"}, {"Date Added": "01/25/2023", "Job ID": "3448454607", "Url": "https://www.linkedin.com/jobs/view/3448454607/", "Job Title": "Material Handler - Driver II - Temp to Perm", "Company": "Trane Technologies", "Description": "2300518\n\nAt Trane Technologies® we Challenge Possible. Our brands – including Trane® and Thermo King® - create access to cooling and comfort in buildings and homes, transport and protect food and perishables, connect customers to elevated performance with less environmental impact, dramatically reduce energy demands and carbon emissions, and innovate with a better world in mind. We boldly challenge what’s possible for a sustainable world.\n\nJob Summary\n\nThis position works 1st Shift (5:00 am – 1:30 pm) or 2nd Shift (2:00 pm – 10:30 pm), overtime and occasional weekend work. Clamp truck operator experience is required, and you will perform various tasks related to accurate receipt, staging, storage, transfer, and delivery of HVAC equipment.\n\nResponsibilities\nUsing material handling equipment, inbound and outbound shipments, loads and unloads trucks, locates and picks material into/out of warehouse racks and between locations, Log inbound freight (UPS, Federal Express, Airborne, DHL)Work with local and regional freight companies (setup times, hot shots, etc.)Safely operates assigned material handling equipment. Ensures that all equipment in use has been inspected and is in safe operating condition. Reports all accidents and unsafe conditions to supervisor.Stocking and arranging of product to ensure warehouse turns of inventoryDetermines accurate material quantities by cycle countingReceives material into inventory, move material by quantity between designated locations, and locate/pick material to/from warehouse locations as required.Ensures accurate part number, quantity, and other data fields entries that impact electronic records of receipts, inventories, location.Resolves discrepancies with material quantities, part numbers.Locates parts ensuring that pallets are stable, observing pallet heights, material, racking and equipment are not damaged, and material is not left in aisles.Satisfies demands of internal customers to include the timely delivery or removal of designated materials to or from the supported shop. Delivers high priority materials ahead of routine materials previously requested.Assists with the training of warehouse associatesPerforms housekeeping as assigned.Assist in annual warehouse inventory\nQualifications And Requirements\nHigh School Diploma/Equivalent preferredClamp Operator experience requiredProven ability to follow through on commitments and details Ability to follow verbal and written instructions read and write English. Excellent written, verbal and interpersonal communication skills Proven team player Strong customer service skills Minimal computer skills (Microsoft Office, Outlook) Previous Material Handling experience preferred\nPhysical Requirements\nMust be able to lift 50lbs on a continuous basisMust be able to operate forklift and drive backwardsMust be able to bend, twist, stoop, and reach overheadMust be able to be on stand on feet for 8-12 hours at a time\nWe offer competitive compensation and comprehensive benefits and programs that help our employees thrive in both their professional and personal lives. We are proud of our winning culture which is inclusive and respectful at its core. We share passion for serving customers, caring for others, and boldly challenging what’s possible for a sustainable world.\n\nWe are committed to achieving workforce diversity reflective of our communities. We are an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identify, national origin, pregnancy, age, marital status, disability, status as a protected veteran, or any legally protected status.", "Years Experience": "", "Years Context": "", "Skills": "Express(1)"}, {"Date Added": "01/25/2023", "Job ID": "3422035740", "Url": "https://www.linkedin.com/jobs/view/3422035740/", "Job Title": "Sales Associate-LENOX SQUARE II", "Company": "Bath & Body Works", "Description": "Description\n\nWho we are\n\nWith an inclusive retail environment that is fueled by passionate associates, Bath & Body Works is one of the most creative, dynamic and profitable fashion retailers in the industry. We are a $6.4 billion retail brand – and growing – with 10+ years of back-to-back growth and unlimited potential. We are the world’s leading fragrance retail brand for body and home, delivered through fashion, trend and newness with products that are globally inspired.\n\nThe opportunity\n\nAs An Associate, You Will\n\nWe’re hiring for you to join our team as a sales associate in our stores. In this role, you will be the face of Bath & Body Works — understanding our customers’ needs and helping them find the best products for themselves and others. Our associates are dedicated to delivering exceptional and consistent customer experiences that positively impact sales growth in their store, and contribute to a positive, high-energy environment.\n Consistently execute our selling model in a fun, team environment Meet sales goals and expectations during your scheduled shifts Build a highly satisfied and loyal customer base through engagement, uncovering needs, making product recommendations, sales conversion and capturing customer phone numbers/email addresses Support product replenishment activities that keep the store full and abundant Assist with floorset execution, window changes, visual presentation and marketing placement as needed Abide by our values, policies, procedures and safety messages\nWhat You Can Expect From Us\n A merchandise discount of 30% at Bath & Body Works Mental health and well-being services and resources at no cost to you An opportunity to save in the BBW 401(k) after you’ve been with us for a year and worked 1000 hours A fun, rewarding experience where you can be you … because we believe in making the world a brighter, happier place through fragrance, and that diversity, equity and inclusion make us stronger\nQualifications\nDemonstrated sales resultsAvailable for varied weekly shifts including weekend, closing and peak shifts\nWe are an equal opportunity employer. We do not make employment decisions based on an individual’s race, color, religion, gender, gender identity, national origin, citizenship, age, sexual orientation, marital status, pregnancy, genetic information, disability, protected Veteran status or any other legally protected status, and we comply with all laws concerning non-discriminatory employment practices. We are committed to providing reasonable accommodations for associates and job applicants with disabilities. We only hire individuals authorized for employment in the United States.", "Years Experience": "10+ years", "Years Context": "....d growing – with 10+ years of back-to-back growth and unlimited potential. We are the world’s leading fragrance retail brand f....\n....e been with us for a year and worked 1000 hours A fun, rewarding experience where you can be you … because we believe in maki....", "Skills": "aws(1)"}, {"Date Added": "01/25/2023", "Job ID": "3453217733", "Url": "https://www.linkedin.com/jobs/view/3453217733/", "Job Title": "Traveling Field Layout Engineer - Construction", "Company": "JE Dunn Construction", "Description": "Best people + right culture. These are the driving forces behind JE Dunn’s strategy for success. By hiring the best people we can find, giving them interesting and challenging work, and letting them share in the company’s rewards, we’ve found a sustainable way to grow in our industry for the last 90+ years.\nJE Dunn believes in providing the best tools for employees to get the job done right. Lean operation processes. Digital document collaboration. LEED-certified, occupant-focused environments. We make sure our workforce is prepared for the job, and we expect the best. Our diverse teams around the country strive to enrich lives through inspired people and places every day, and we need inspired people like you to join us in our pursuit of building perfection.\n\nThis is a full-time traveling position with our National Healthcare Division - this position will require traveling from job site to job site across the US. You must be available to travel full-time to be considered for this position.**\nRole Summary\n\nThe Field Layout Engineer 2 will complete routine and more complex non-routine construction site layout tasks for a project. This position will be responsible for planning and maintaining layout control; establishing building corners and permanent reference points; and performing site, roadway and utility layouts. All activities will be performed in support of the strategy, vision and values of JE Dunn.\nAutonomy & Decision-Making: Follows directions and refers exceptions to supervisor. Career Path: Senior Field Layout Engineer\nKey Role Responsibilities - Core\n\nFIELD LAYOUT ENGINEER FAMILY - CORE\nPlans, sets up, and maintains layout control for assigned construction project(s) and identifies unacceptable errors.Establishes building corners and permanent reference points to allow back checks of building location.Verify existing elevations shown on drawings used on roadways and utilities.Lays out column center lines and wall locations, and verifies that exterior skin is not encroached by main structure.Plumbs structural steel frame and check column alignments.Sets and maintains benchmarks and control lines on each floor for use in layout, and verify that workers are using proper elevations and control lines.Checks slab for elevation and alignment during concrete pours.Performs as-built surveys to verify correct placement of work and to identify conflicts between items of work (i.e., where concrete slab edge or walls have encroached on the exterior skin), and may help maintain as-built drawings.Assist other project staff in securing certified layout from independent engineering resources to establish monument and baseline control and to verify building corners and roadway entrances.Calculates earth, rock, and concrete quantities accurately.Assist with the coordination of shop drawings with contract drawings, verifies accuracy, and proposes solutions to discrepancies between the drawings.Responsible for care, maintenance, and calibration of engineering equipment.Compile and maintain project record and as-built documents. Ensures storage protocols are followed.\nKey Role Responsibilities - Additional Core\n\nFIELD LAYOUT ENGINEER 2\n\nIn addition, this position will be responsible for the following:\nAssist other project staff with quality, planning, safety, or other project-related activities.Helps to mentor less experienced Layout team members and reports progress to supervisor and other management team members.Communicates clearly and effectively with project team and trade partners to ensure layout of contract document standards are met.Capable of independently completing non-routine construction site layout and controls for a project.\nKnowledge, Skills & Abilities\nAbility to perform work accurately and completely, and in a timely manner.Communication skills, verbal and written – Intermediate.Proficiency in MS Office – Basic.Gain a working knowledge of organizational structure and resources provided.Knowledge of LEAN construction principals.General knowledge of means and methods of construction management.Ability to build relationships and collaborate within a team, both internally and externally.\nEducation\nBachelor’s degree in construction management (Preferred)In lieu of the above requirements, relevant experience will be considered\nExperience\n5+ Years construction layout experience (Required)\nWorking Environment\nValid and unrestricted drivers license required \nJE Dunn Construction is committed to hiring and retaining a diverse workforce. We are proud to be an Equal Opportunity/Affirmative Action Employer and it is our policy to provide equal opportunity to all people without regard to race, color, religion, national origin, ancestry, marital status, veteran status, age, disability, pregnancy, genetic information, citizenship status, sex, sexual orientation, gender identity or any other legally protected category. JE Dunn Construction is a background screening, drug-free workplace.\n\nJE Dunn provides reasonable accommodations to qualified individuals with disabilities. If you would like to request a reasonable accommodation in order to apply for a job, please submit your request to accommodations@jedunn.com\n\nJE Dunn Construction Company does not accept unsolicited resumes from search firms or agencies. Any resume submitted to any employee of JE Dunn Construction without a prior written search agreement will be considered unsolicited and the property of JE Dunn Construction Company. Please, no phone calls or emails.", "Years Experience": "90+ years", "Years Context": "....try for the last 90+ years.....", "Skills": "git(1)"}, {"Date Added": "01/25/2023", "Job ID": "3452432280", "Url": "https://www.linkedin.com/jobs/view/3452432280/", "Job Title": "Roll Off Driver", "Company": "RESICAP", "Description": "At Peachtree Waste, we love talking trash! Our locally-owned waste disposal company serves the needs of the greater Atlanta community, from residential homes to commercial contracts, and we hauled over 45,000 TONS just last year. As we continue to expand our services and markets, we are always looking for the best and brightest to join our awesome team to build the greatest waste management solution in Atlanta and beyond. Peachtree Waste is the waste management division of RESICAP, which has been named a Top Workplace by AJC. Feeling peachy? Join us today and discover the Peachtree Waste difference!\n\nBENEFITS: Paid Holidays, Paid Time Off, 401k Matching, Medical, Vision and Dental Insurance, Wellness Initiatives, Short-Term Disability, Employee Assistance Program, and More\n\nPosition Purpose\n\nCDL License position will be responsible for safely operating a roll-off truck to deliver Peachtree Waste's containers to customers in the greater Atlanta area. This will entail inspecting the vehicle and the container for any defects or potential malfunctions, general maintenance duties, working with dispatch and mobile applications to map routes to customer locations, driving to location, safely loading and unloading containers where customers specify, and delivering container contents to a transfer station or landfill.\n\nJob Responsibilities\n Safely operate a roll-off truck.  Conduct pre and post trip inspections according to DOT guidelines.  Perform basic evaluation and minor repairs.  Inspect all outgoing and returning containers for damage.  Load and unload 20-yard, 30-yard, and 40-yard containers.  Perform other duties as required. \nJob Requirements (Including Education)\n High school diploma.  2-years’ experience driving commercial vehicles; 1-year roll-off experience.  Possess a CDL Class B license for the State of Georgia.  Requires a clean driving record.  Ability to operate a roll-off container truck.  High level of safety awareness driving and operating equipment  Ability to speak and read English  Basic knowledge of smart phones and computers.  Sufficient mechanical ability.  Sign-On Bonus: $2,000.00 sign on bonus for 1st year of employment. Bonus will be paid every three months with $500.00.\nIND1", "Years Experience": "", "Years Context": "....5,000 TONS just last year. As we continue to expand our services and markets, we are always looking for the best and brightes....\n....ign on bonus for 1st year of employment. Bonus will be paid every three months with $500.00.....", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3450552661", "Url": "https://www.linkedin.com/jobs/view/3450552661/", "Job Title": "CT Tech - Day or Night shifts - Tuition Reimbursement and Pension Plan", "Company": "Jobot", "Description": "Full time opportunity with room to grow! Day shifts or night shifts\nThis Jobot Job is hosted by Pat McKeogh\nAre you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.\nSalary $70,000 - $90,000 per year\nA Bit About Us\nWe believe in building a positive culture focused on kindness and results and being a great place to build a lasting career for our nursing team.\nWe believe in providing incredible service to our patients and their families.\nWe believe in treating everyone like we like to be treated!\nInterested in learning more? - Reach out today!\n(949) 996-3309 - Call/text\npat.mckeogh@jobot.com\n\n\nWhy join us?\n\n Top Atlanta Healthcare Organization  Highly competitive base pay Excellent benefits - health, dental, etc. PENSION PLAN Collaborative culture with friendly team  Relocation assistance available Opportunities for growth within the organization  Tuition Reimbursement\nJob Details\nCT Technologist - Day shifts or night shifts available\n 1+ years of experience Registered CT Technologist (ARRT) or (NMTCB)\nInterested in learning more? - Reach out today!\n(949) 996-3309 - Call/text\npat.mckeogh@jobot.com\nInterested in hearing more? Easy Apply now by clicking the \"Apply\" button.\n", "Years Experience": "1+ years", "Years Context": "....70,000 - $90,000 per year....\n.... 1+ years of experience Registered CT Technologist (ARRT) or (NMTCB)....", "Skills": ""}]