[{"Date Added": "05/11/2023", "Job ID": "3566940798", "URL": "https://www.linkedin.com/jobs/view/3566940798/", "Job Title": "Software Engineer - ELSYS - Open Rank", "Company": "Georgia Tech Research Institute", "Description": "Project/Unit Description\n\nThe Applied Embedded Systems (AES) division in the Electronic Systems Laboratory (ELSYS) predominantly focuses on the research, development, testing, and deployment of embedded electronic and electromechanical systems. These systems provide our sponsors with technological solutions in the fields of Electronic Warfare (EW), command and control, communications, avionics, entertainment, physiological monitoring, and other applications.\n\nJob Purpose\n\nThe Software Engineer designs, develops, and tests software. Additionally, the Software Engineer manages software development teams, provides technical leadership, and establishes software development lifecycle practices and processes. The Software Engineer is proficient in programming languages such as Java, C, C++, Ruby, Python, Scala, and Groovy. In this role, the Software Engineer requires extensive knowledge of programming languages, software development, computer operating systems, Continuous Integration/Continuous Delivery (CI/CD), DevOps, Application Programming Interface (API) development, container development, and distributed systems. The Software Engineer also applies engineering principles to software creation, manages production releases of software, performs code reviews, merges feature development branches, and analyzes and triages issues. The necessary skill areas for the Software Engineer include programming and coding, fundamentals of computer science, software design and architecture development, algorithms and data structures, information analysis, software debugging and testing, and working in development teams. The Software Engineer also works with sponsors to curate requirements, define sprint work items, set priorities for work backlogs, and organize development teams.\n\nKey Responsibilities\nDesign, test, and develop computer software in order to meet requirementsDevelop and maintain kernel and user-level software and scriptsContribute to research reports, white papers, and competitive proposals Additional Responsibilities\nDevelop object-oriented software applicationsFollow agile software development processes and practicesInterface and coordinate with team members including other developers, testers, system engineers, etc.Support optimization of software for running on specific targets/platformsSupport translation of system requirements into software requirements and designReview/produce technical documentation, designs, and data Required Minimum Qualifications\nFamiliarity with Python, C#, C++, Java, and other scripting/programming languagesProficiency and knowledge of software version control tools and best practices, i.e. GitProficiency in developing on/for Windows and Linux operating systemsStrong verbal and written communication skills Preferred Qualifications\nActive Top Secret ClearanceActive TS/SCI ClearanceExperience developing REST APIsExperience developing Android appsExperience working with automated testing systemsExperience working with continuous integration and continuous delivery (CI/CD) pipelinesKnowledge of agile software development methodologies Travel Requirements\n\n<10% travel\n\nEducation And Length Of Experience\n\nThis position vacancy is an open-rank announcement. The final job offer will be dependent on candidate qualifications in alignment with Research Faculty Extension Professional ranks as outlined in section 3.2.1 of the Georgia Tech Faculty Handbook\n2 years of related experience with a Bachelor’s degree in Electrical Engineering, Computer Science, Computer Engineering, Mechanical Engineering, Physics, Aerospace Engineering0 years of related experience with a Bachelor's and Masters’ degree with one or both in Electrical Engineering, Computer Science, Computer Engineering, Mechanical Engineering, Physics, Aerospace Engineering U.S. Citizenship Requirements\n\nDue to our research contracts with the U.S. federal government, candidates for this position must be U.S. Citizens.\n\nClearance Type Required\n\nCandidates must be able to obtain and maintain an active security clearance.\n\nBenefits At GTRI\n\nComprehensive information on currently offered GTRI benefits, including Health & Welfare, Retirement Plans, Tuition Reimbursement, Time Off, and Professional Development, can be found through this link:  https://hr.gatech.edu/benefits \n\nDiversity & Inclusion\n\nDiversity & Inclusion (D&I) at Georgia Tech Research Institute aims to enhance the Institute’s mission of solving the world’s most complex technical problems by creating a workforce with a shared appreciation for diversity, raising awareness around inclusiveness, and fostering a sense of belonging and appreciation for all members of our community.\n\nEqual Employment Opportunity\n\nGeorgia Tech Research Institute is an Equal Opportunity Employer of individuals with disabilities and protected veterans and actively seeks diversity among its employees.  Equal Employment Opportunity is the Law .", "Years Experience": "2 years\n0 years", "Years Context": "....2 years of related experience with a Bachelor’s degree in Electrical Engineering, Computer Science, Compute....\n....rospace Engineering0 years of related experience with a Bachelor's and Masters’ degree with one or both in Electrical Engineer....", "Skills": "Java(2)\nPython(2)\nGit(1)\nAndroid(1)", "Remote Allowed": false, "Listed At": "2023-05-09 06:54:21", "Time ago": "2 days, 9:14:23.904832"}, {"Date Added": "05/11/2023", "Job ID": "3600253027", "URL": "https://www.linkedin.com/jobs/view/3600253027/", "Job Title": "Full Stack Developer", "Company": "Dice", "Description": "We are looking for a full-time Sr Full Stack Developer to join our team!! We offer an energetic and collaborative environment where everyone's opinion matters!Huge perks!Benefits from day oneExcellent work life balanceHybrid - 2 days in the office/3 days remote2 locations - Atlanta and AlpharettaWe're looking for someone who likes to be \"hands on\" and can bring their expertise to help grow our team. We're a fairly small company in terms of headcount, so it's a pretty cool time to join the team. We also have an energetic and collaborative environment where everyone's opinion really does matter!Overview:Incident IQ focuses on providing innovative cloud software for public schools across the country. We have a team of talented engineers and are growing fast. We are looking for more team players that thrive on the excitement of a fast-paced startup mentality.Role Description:The C# .NET Developer is responsible for translating business requirements into well-engineered, tested, and deployed application systems that are used by the business as well as supporting these systems while in production. The ideal candidate is a developer passionate about software development and excited to work with a team that is creating software that is making a real difference.Required Experience:5+ years of Microsoft C#.net coding experience5+ years full stack development3-5 years of Microsoft SQL Experience3-5 years’ experience building and working with Web Services5+ years developing using JavaScript/jQuery5+ years of experience with web technologies HTML and CSSExperience with Microsoft Visual Studio 2019+Experience working with Git / GitFlowExperience developing application for Azure App-Service, Azure SqlStrong understanding of software and database architecture conceptsRequired Technology Stack Experience:Azure SQLMongoDBAzure App ServiceMicrosoft C#RESTful WebApiAngular/AngularJSionic 11BootstrapIncident IQ offers a competitive salary based on experience with a benefits package for full time employees that includes medical, dental, vision, life insurance, 401k, and paid time off (PTO).Incident IQ is an Equal Opportunity Employer", "Years Experience": "5+ years\n5+ years\n3-5 years\n3-5 years\n5+ years\n5+ years", "Years Context": "....quired Experience:5+ years of Microsoft C#.net coding experience5+ years full stack development3-5 years of Microsoft SQL Expe....\n....rience3-5 years’ experience building and working with Web Services5+ years developing using JavaScript/jQuery5+ yea....", "Skills": "Full Stack(1)\nfull stack(1)\nSQL(2)\nJavaScript(1)\njQuery(1)\nHTML(1)\nCSS(1)\nGit(2)\nSql(1)\nMongo(1)\nBootstrap(1)", "Remote Allowed": false, "Listed At": "2023-05-07 04:59:57", "Time ago": "4 days, 16:33:27"}]