[{"Date Added": "01/25/2023", "Job ID": "3424196598", "Url": "https://www.linkedin.com/jobs/view/3424196598/", "Job Title": "Part Time Store Associate", "Company": "Bed Bath & Beyond", "Description": "Our mission at Bed Bath & Beyond, Inc is to make it easy for our customers and our associates to ‘feel at home’ across all of our retail brands.\nWhether you’re working at Bed Bath & Beyond, a buybuyBaby or a Harmon store, our Retail Associate positions are responsible for exceeding our customers’ evolving expectations by providing “best in class” customer service and a pleasant and fulfilling shopping experience. Successful candidates will be given the opportunity to offer our customers wide range of quality products and goods. We offer associate discounts, flexible schedules, ongoing training, and the potential for advancement.\nFull-Time and Part-Time Retail Associate positions are available\nRetail Associates positions will be cross trained in the following areas:Sales / Stock Associate:Engage with customers to determine their needs and direct them to the appropriate merchandiseProvide a positive customer experience which includes a strong understanding of product knowledge while offering additional goods and servicePerform a wide variety of tasks in the Receiving Department, including verifying shipments, processing damages, and completing daily stock replenishmentCashier:Ensure an accurate, timely and friendly checkout while assisting our customers to have a positive experienceFulfillment Associate:Receive and stock inventoryFulfill customer orders and oversee curbside pick-upsAssist and satisfy the needs of our in-store and online customers\nPlease note that Retail Associates may perform additional duties as required including, but not limited to, general maintenance such as daily front-end presentation (cleaning exterior and interior windows, doors and surfaces), stocking, cart retrieval and break room/restroom housekeeping. May require the use of ladders to move merchandise or complete other tasks needed to access areas and work safely. May require lifting/moving up to 40 pounds.\nBenefits\nEmployee discount of 25% off total @ Bed Bath & Beyond concepts purchases (Harmon, Bed Bath & Beyond, and Buy Buy Baby)Medical, Dental and Vision Benefits – options for both Full-Time and Part-Time AssociatesPaid time-off for Full-Time AssociatesA fun and engaging work environment that prides itself on employee training and development\nRequirements/Qualifications\nMust be flexible to adjust tasks and priorities when necessary to meet business needsStrong communication and customer service skillsPositive and welcoming attitudeAbility to learn how to use common retail technology, such as scanners, Point of Sale systems, smart phones and tablets\nIf you need reasonable accommodations to complete the on-line application, please contact the People & Culture Department.\nPhone: 1-844-MYHRSC1\nEmail: myHRSC@bedbath.com\nThis email address is only to request reasonable accommodation for the application process due to a medical condition. If you do not need a reasonable accommodation for such reason, please use the apply button below to complete an application and upload your resume.\nAn Equal Opportunity Employer\nIt is the policy of Bed Bath & Beyond Inc. to recruit, hire, train, promote, transfer and compensate our associates and provide all other conditions of employment including Company sponsored events without regard to race, color, creed, religion, national origin, age, sex, gender identity, genetic information, marital status, lawful alien status, sexual orientation, physical or mental disability, citizenship status, veteran status, employment status or any other basis prohibited by applicable law.", "Years Experience": "", "Years Context": "", "Skills": "front-end(1)"}, {"Date Added": "01/25/2023", "Job ID": "3453899471", "Url": "https://www.linkedin.com/jobs/view/3453899471/", "Job Title": "Application Engineer - Semiconductor Fab", "Company": "Solvay", "Description": "Solvay is a science company whose technologies bring benefits to many aspects of daily life. Our purpose—we bond people, ideas and elements to reinvent progress—is a call to go beyond, to reinvent future forms of progress and create sustainable shared value for all through the power of science. In a world facing an ever-growing population and quest for resources, we aim to be the driving force triggering the next breakthroughs to enable humanity to advance while protecting the planet we all share.\n\nWe bond with customers and partners to address today and tomorrow’s megatrends. As a global leader in Materials, Chemicals and Solutions, Solvay brings advancements in planes, cars, batteries, smart and medical devices, water and air treatment, to solve critical industrial, social and environmental challenges. You can count on our innovative solutions to contribute to safer, cleaner and more sustainable future.\n\nImportant EEO information related to opening in the US\nSolvay is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other legally protected characteristics. Click on the links to read \"The EEO is the Law\" poster and the “EEO is the Law” poster Supplement.\nWe will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. For more information, please click here.\nSolvay is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to humanresources.na-us@solvay.com and let us know the nature of your request and your contact information.\nRole Overview\nWe are looking for:\nThe Applications Engineer (Semicon) sits within our Customer Technical Development function within Solvay Specialty Polymers and designed to provide strong technical expertise and value to our customers by leveraging the entire product portfolio, resources, and know-how of the GBU.Solvay Specialty Polymers is looking for creative, curious self-starters and leaders interested in non-routine challenges to join the Technical Development team and support semiconductor applications in North America.You will be responsible for providing technical application development expertise to customers and will interact with the internal organization (commercial teams, application development team, R&D, Manufacturing, etc.) to develop total customer solutions.\n\nWe count on you for:\nYou will work directly with customers in collaboration with the sales and marketing to identify & develop application opportunities where Solvay’s specialty polymers add value and solve customer problems.Elicit a complete set of customer requirements and develop the value proposition of Solvay materials.Work directly with the Global CTD community and our Research and Development teams, to lead the development and implementation of solutions for customer applications. This includes polymer material recommendation and validation, design support for metal to plastic conversion, prototyping support, tooling design recommendations, testing, and processing assistance. Provide technical training and literature for both internal and external use about designing with polymers, polymer selection, polymer processing, simulation and prototyping.Champion sustainability solutions.Collaboratively interact and share expertise with the global CTD team, and create technical marketing literature.\n\nYou can count on us for:\nLong-lasting excellent customer relations, self-dependent working, and a variety of tasks in one of the world’s leading chemical companies.Excellent training & development possibilities.You will acquire dynamic market knowledge and competitive landscape understanding.\n\nYou will bring:\nEducation & Experience \nBachelor degree in Mechanical Engineering, Chemical Engineering, Material Science, or equivalent applicable technical degree5+ years of experience in a technical position working with polymers: knowledge of polymer physics, material selection, and processingExperience in semiconductor applications/customers/tiersMechanical aptitude, experience in part and tooling design and failure analysis \n\nSkills\nHands-on experience working with polymers in a manufacturing environment (extrusion, injection molding, compression molding)Ability to execute projects with short life cyclesDemonstrated ability to work independently and effectively to build deep relationships with both external customers and within a global Solvay teamStrong communication skills & customer-focus\n\nDesired behaviors \nStrong analytical and problem-solving skills, technically-orientedExcellent communication skillsAbility to apply technical knowledge in a customer-facing and commercial environmentExcellent project management skillsData analysis, quantitative, qualitative\n\nYou will get:\nCompetitive salary - The U.S. base salary range reasonably expected to be paid for this position is $90,000 to $130,000. Since actual compensation packages are based on a variety of factors unique to each candidate we may ultimately pay more or less than the posted base salary range. Total compensation for this role also includes bonus and/or other incentives. Health insuranceLife insurance16 weeks of maternity/paternity and co-parenting leaveTraining platform for all employeesFree language courses (24 languages available)Solvay Shares Plan Free well-being sessions (physical and psychological)\n\nAdditional information:\nLocation(s): Alpharetta (Georgia, US)Willing and able to travel 50-60% of the time and have a flexible working schedule\n\n \n\nAdditional Information\nSolvay’s purpose is to bond people, ideas and elements to reinvent progress. We can only fulfill this purpose with a diverse workforce that feels respected and appreciated, and has equal opportunities to work, grow and thrive. Our differences, visible or not, are valued. As Solvay seeks to promote unity and not uniformity, we invite you - regardless of background, age, gender, race, national origin, ethnicity, religion, sexual orientation, ability or identity - to consider a future with us.\n\n\nImportant Important EEO information related to opening in the US \n\nSolvay is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other legally protected characteristics. Click on the links to read \"The EEO is the Law\" poster and the “EEO is the Law” poster Supplement.\n\n We will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. For more information, please click here.\n\n Solvay is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to hrstaffingoffice.na-us@solvay.com or call 800-311-3555 and let us know the nature of your request and your contact information.\n\n", "Years Experience": "5+ years", "Years Context": "....e technical degree5+ years of experience in a technical position working with polymers: knowledge of polymer physics, material....", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3140254376", "Url": "https://www.linkedin.com/jobs/view/3140254376/", "Job Title": "Server", "Company": "Invited", "Description": "Job Description\n\n At   ClubCorp   , work feels like play, as you build relationships with your team and meet Members from all different backgrounds. Every time you step foot in your Club, you can create magic moments and enrich lives. So, join us and be a part of a fun, fast-paced, high-impact group of talented people. We are passionate about bringing people together and about bringing out the very best in life. \n\nJob Summary\n\nA server is responsible for providing food and beverage service to Members and Guests while consistently displaying a positive attitude and knowledge about the food and beverage menu. Work closely and coordinate with other team members to ensure Member/Guest satisfaction and retention.This position reports directly to the FB Director, Service Director, and Banquet Manager with indirect reporting to the Private Events Director, Captain, and General Manager.\n\n DAY-TO-DAY \n Responsible for food and beverage service to Members and guests, adhering to the ClubCorp standards of service.  Comprehensive knowledge of the a la carte menu is mandatory, including daily features and specials that may not be available directly on the menu.As well as possess clear knowledge of all various liquors, beer and wines available at the Club.  Know Member names and greet them promptly while providing a warm welcome making them feel at home.  Ensure daily assignments and side work is complete in respective areas to meet Club standards.  Because of the fluctuating demands of the company’s operation, it may be necessary that each Employee Partner perform a multitude of different functions therefore, as an essential part of your position, you will be expected to help others when the occasion arises, just as other Employee Partners are expected to help you.Accordingly, you may be expected to perform other tasks as needed or as directed. \nAbout You\n A high school diploma preferred.  Previous Food and Beverage experience preferred.  Food Handler and Alcohol Server Certifications as required by State and City.  You have completed FB Service Training.  Excellent communication skills and articulate speech.  Ability to communicate and follow instructions.  You are comfortable working in both indoor and occasional outdoor environments. \n Have more questions?  Check out our ClubCorp Jobs website to get more details about ClubLife, the Employee Experience, Company Benefits, and Our Culture.\n\nBe a part of our Social Network: ClubCorp LinkedIn or ClubCorp Instagram .\n\n ClubCorp is an Equal Employment Opportunity Employer / ClubCorp participates in E-Verify  . This job post is intended to describe the general requirements for the position. It is not a complete statement of duties, responsibilities, or requirements. Other duties not listed here may be assigned as necessary to ensure the proper operation of the Club.", "Years Experience": "", "Years Context": "", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3424931535", "Url": "https://www.linkedin.com/jobs/view/3424931535/", "Job Title": "Senior Front-End Designer Developer-Supervising Associate-Various Locations (Digital Portfolio Req.)", "Company": "EY", "Description": "At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all.\nSenior Front-End Designer Developer, Supervising Associate -Various Locations ( Atlanta, Alpharetta, Austin, Charlotte, Cleveland, Detroit, Houston, Minneapolis, Phoenix, Pittsburgh, St. Louis ) \nAs a member of our US Creative Services team, you’ll be joining a high performing in-house creative agency with a digital-first focus and a culture that is agile and inspires you to be your best self every day. On our highly collaborative team, you can combine your energy, vision, creative ideas and passion for continuous learning in a flexible, virtual, diverse work environment. You’ll be working across multiple industries developing innovative solutions that help drive our clients’ business in a world that never stands still.\nThe opportunity\nAs a senior front-end designer developer, you’ll be an innovative and strategic thinker responsible for user interface design, front-end and back-end development of websites and other interactive solutions, and maintenance and modification of existing sites. You’ll be responsible for the UI creation process including wireframing, mockups, and build-out of UI design into fully functional web pages and web applications. You’ll oversee multiple complex projects and virtual teams, from concept through production and delivery.\nYou’ll be part of an expansive and talented team working independently and collaboratively. You’ll be empowered to learn and grow together with other creative minds. Your contributions and ideas will be valued and heard, and you’ll have opportunities to innovate and take part in efforts that advance our creative team.\nYour Key Responsibilities\nYou can expect to draw on your creative thinking skills to provide consultation, ideation, innovative solutions and strategy to meet clients’ business objectives. You’ll work from project briefs to create and test applications to verify that they’re working effectively and meeting client expectations. You’ll develop and present basic wireframes or more complex UI prototypes and build-out user interfaces using CSS, HTML and JavaScript. You’ll build-out back-end logic, connecting to databases and services and test and debug for all browsers, platforms, and devices as required by clients’ objectives. You’ll produce utilities to reduce repetitive tasks and share knowledge with the team.\nSkills And Attributes For Success\nStrong leadership skills with the ability to model by exampleAbility to proactively foster exceptional client relationships to build trust and collaboration that leads to the co-development of new opportunitiesSound business acumen to fully comprehend stakeholders’ strategic vision and influence the development of the creative brief, which drives the storyAbility to develop training initiatives to improve overall team knowledge of web design and its processesAbility to create strategies to lead and drive innovation with new options made available by upcoming technologiesSuperb communication skills, active listening and diplomacy when working with internal team members and business partners\nTo qualify for the role, you must have\nBachelor's degree in web design/interactive media, graphic/digital design or related discipline or equivalent experienceEducation or proficiency in computer technology including HTML, CSS, JavaScript and C# programming language for page-level coding within ASP.NETEight-plus years of related interactive web design and development experienceCreative, digital portfolio demonstrating outstanding conceptual thinking and design skillsAdvanced knowledge and hands-on experience creating web sites using markup languages (HTML), style sheet languages (CSS, SASS), and front-end development languages (JavaScript)Proficiency in JavaScript frameworks (React, Angular, Vue); knowledge of server-side JavaScript development using node.js would be a plusExperience with a variety of content management systemsProficiency in SharePoint Framework (SPFx), building web parts and support client-side SharePoint development, integration with SharePoint data and PowerApps, Power BI and FlowProficiency in Adobe Creative Suite, Adobe XD or InVision, Microsoft Office 365 applications, Mac and Windows platformsExperience working in a fast paced, matrixed agency or in-house team environment developing a range of creative initiatives\nIdeally, you’ll also have\nExperience successfully mentoring and coaching creatives in web design principles and technical skills including critiquing projects and providing constructive feedback in a virtual environmentAbility to skillfully liaison between groups of people to bring positive solutions that meet business objectivesAdvanced problem-solving skills to identify, resolve and overcome challenges\nWhat We Look For\nEngaging communicators with executive presence and the ability to influence clients and colleagues to bring their creative vision to life. We welcome creative minds who thrive on continuous learning and have a passion for innovation.\nWhat We Offer\nWe offer a comprehensive compensation and benefits package where you’ll be rewarded based on your performance and recognized for the value you bring to the business. The salary range for this job in most geographic locations in the US is $83,000 to $150,700. The salary range for New York City Metro Area, Washington State and California (excluding Sacramento) is $99,600 to $171,200. Individual salaries within those ranges are determined through a wide variety of factors including but not limited to education, experience, knowledge, skills and geography. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances. You’ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.\nContinuous learning: You’ll develop the mindset and skills to navigate whatever comes next.Success as defined by you: We’ll provide the tools and flexibility, so you can make a meaningful impact, your way.Transformative leadership: We’ll give you the insights, coaching and confidence to be the leader the world needs.Diverse and inclusive culture: You’ll be embraced for who you are and empowered to use your voice to help others find theirs.\nIf you can demonstrate that you meet the criteria above, please contact us as soon as possible.\nThe Exceptional EY Experience. It’s Yours To Build.\nEY | Building a better working world\nEY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.\nEnabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.\nWorking across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.\nEY is an equal opportunity, affirmative action employer providing equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, national origin, protected veteran status, disability status, or any other legally protected basis, including arrest and conviction records, in accordance with applicable law.\nEY is committed to providing reasonable accommodation to individuals with disabilities. If you are a qualified individual with a disability and either need assistance applying online or need to request an accommodation during the interview process, please call 1-800-EY-HELP3, type Option 2 (HR-related inquiries) and then type Option 1 (HR Shared Services Center), which will route you to EY’s Talent Shared Services Team or email SSC Customer Support at ssc.customersupport@ey.com.", "Years Experience": "", "Years Context": "....in ASP.NETEight-plus years of related interactive web design and development experienceCreative, digital portfolio demonstrati....", "Skills": "Front-End(1)\ngit(3)\nfront-end(3)\nCSS(3)\nHTML(3)\nJavaScript(5)\nReact(1)\nnode(1)\nAdobe(2)\nexpress(1)"}, {"Date Added": "01/25/2023", "Job ID": "3452703068", "Url": "https://www.linkedin.com/jobs/view/3452703068/", "Job Title": "Engineer", "Company": "Sonesta Hotels", "Description": "Job Description Summary\nThe Engineer performs general maintenance work to ensure hotel physical plant quality and safety standards are achieved and maintained. The Engineer takes care of the building, equipment and grounds of the hotel. This position will perform maintenance and repairs, and preventative maintenance, to all areas of the hotel.\nJob Description\nWork Environment \nInterior and exterior of building with potential for guest facing contact.Exposure to extreme temperatures inside and outside of the building.\nPhysical Demands\nMust be able to exert in excess of 100 pounds of force occasionally, and/or in excess of 50 pounds of force frequently and/or in excess of 20 pounds constantly to lift, carry, push, pull, or otherwise move objects.Frequent bending, kneeling, climbing, stooping and reaching.Ability to stand during entire shift.\nExpected Hours of Work \nMust be flexible to work variable days of the week to include weekends and holidays.Must be flexible to work variable shifts (days, nights, overnights).Ten to twelve hour shifts sometimes required.\nEducation And Experience\nSpecialized knowledge and skills or certification within a field or discipline such as plumbing, electrician, carpentry, equipment mechanics, HVAC, refrigeration, etc.Trade school and/or college course work in related field preferred.Experience in a hotel or a related field preferred. \nPrinciple duties and responsibilities (Essential Functions) include: \nPerform general maintenance and repairs for assigned area of expertise such as the interior and exterior of buildings, hotel rooms and contents, laundry and kitchen/refrigeration equipment, lighting, heating, air conditioning (HVAC), ventilation, water treatment systems, and swimming pool, etc. Perform preventative maintenance on a regular basis and ensure that assigned equipment is maintained and operational.Adhere to federal, state and local safety regulations, brand standards and other compliance requirements. Report all unsafe conditions or malfunctioning equipment to supervisor. Follow procedures that ensure the security of inventory and assets such as tools, supplies, equipment, furniture, televisions, etc.Replenish supplies and inventory in a timely and efficient manner and minimizes waste. Take required readings on equipment.Replace and program televisions as needed.Replace light switches, receptacles, light bulbs and fixtures.Paint designated areas and perform plumbing repairs (i.e. clogged drains, copper pipe, change washers, change handles, drain fittings, etc).Understand and be able to read blueprints and wiring diagrams.Refurbish furniture and fixtures and repair all types of wall coverings.Repair and program hotel electronic lock system.Deal with reasonable complaints/requests with professionalism and patience.Display professional appearance and demeanor at all times.Attend departmental pre-shift and mandatory meetings.Perform other duties as requested by management.\nQualifications And Skills\nAttentive, friendly, helpful and courteous to all guests, managers and fellow employees.Ability to prioritize and multitask.Excellent organizational skills and attention to detail.Reading and writing abilities are utilized in order to document or record all tasks completed, to order supplies, to receive instructions for the day and/or to read equipment repair manuals.Mathematical skills, including basic math, percentages, quantities, and variances.Professional verbal communication skills.Excellent interpersonal and customer service skills.Prioritization and time management skills.\nGo Beyond @SonestaHotels\nWho We Are\nWe are an organization made up of people, thoughts and ideas – all working towards fulfilling our simple mission: To wow every guest, team member, partner & community we operate in by delivering quality, value & amazing hospitality.\nWe will achieve our mission by being passionate about exceeding expectations - by being persistent, resilient, and constantly seeking new and creative ways to succeed. Doing the Right Thing and Going Beyond are our principles that guide everything we do.\nWe are an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status, or any other characteristic protected by local, state, or federal laws, rules, or regulations.\nThe statements in this job description are intended to represent the key duties and level of work being performed. They are not intended to be ALL responsibilities or qualifications of the job. This job description is subject to change at any time.\nBenefits\nAdditional Job Description\nSonesta recognizes that benefits play a vital role in helping ensure the health and financial security of employees and their families. We offer a variety of benefits to our employees including:\nMedical, Dental and Vision InsuranceHealth Savings Account with Company Match401(k) Retirement Plan with Company MatchPaid Vacation and Sick DaysSonesta Hotel DiscountsEducational AssistancePaid Parental LeaveCompany Paid Life InsuranceCompany Paid Short Term and Long Term Disability InsuranceVarious Employee Perks and Discounts\nUpon submitting your application, please ensure you complete a full application in addition to attaching a resume. Incomplete applications received will not be considered.", "Years Experience": "", "Years Context": "", "Skills": "aws(1)"}, {"Date Added": "01/25/2023", "Job ID": "3245808138", "Url": "https://www.linkedin.com/jobs/view/3245808138/", "Job Title": "Senior Building Envelope Engineer / Architect / Consultant", "Company": "NOVA Engineering and Environmental, LLC", "Description": "NOVA Engineering’s Kennesaw, GA office is looking for a Senior Facilities & Building Envelope Consultant with 10+ years experience in the building enclosure, property condition assessment & roofing industry. Our group is experiencing tremendous growth and we need an additional Senior Consultant to help with technical oversight and management of projects. This person can be an architect, engineer, or senior consultant.\n\nResponsibilities will include:\n\nManagement / technical oversight of building envelope/facilities and roofing projectsMentor staff, help with proposals, and serve as a senior technical reviewerDaily client management and correspondencePlanned growth of the service line throughout GeorgiaDesired Experience / Skills:\n\nEducational background in architecture, engineering, and/or historic preservation preferred.Licensed Engineer or Architect is preferred, but not required.10+ years of industry experience and must be proven client manager capable of becoming a senior reviewer.Competent in identifying and solving constructability, integration, design, troubleshooting, durability, continuity, structural behavior, thermal property evaluation, ADA Compliance, sustainability, and maintenance/ operation of building envelopes/roofing systems.The following certifications are a huge plus: Registered Roof Consultant (RRC), Registered Waterproofing Consultant (RWC), Registered Roof Observer (RRO), Certified Infrared Thermographer (CIT)NOVA is an Equal Opportunity Employer. All qualified candidates are encouraged to apply. NOVA does not discriminate on the basis of race, religion, color, sex, gender identity, sexual orientation, age, disability, national origin, ancestry, marital status, veteran status or any other characteristic protected by law.\n\n\n\n", "Years Experience": "10+ years\n10+ years", "Years Context": ".... Consultant with 10+ years experience in the building enclosure, property condition assessment & roofing industry. Our group i....\n....but not required.10+ years of industry experience and must be proven client manager capable of becoming a senior reviewer.Comp....", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3453003320", "Url": "https://www.linkedin.com/jobs/view/3453003320/", "Job Title": "Sr. Front End Engineer", "Company": "Aha!", "Description": "Aha! is a very different type of high-growth SaaS company. We are self-funded, highly profitable, and 100 percent remote. We provide the world's #1 product development software so teams can build products that customers love. More than 600,000 product builders use our suite of tools which includes Aha! Roadmaps , Aha! Ideas , Aha! Create , and Aha! Develop . And they rely on our training programs via Aha! Academy to become product development experts. We are recognized as one of the best fully remote companies to work for, champion the Bootstrap Movement , and have given over $1M to people in need through Aha! Cares . Learn more at www.aha.io .\nOur team\nAha! engineering is a mid-sized, fully remote team that is highly productive. We are centered around North American time zones so we can collaborate during the workday.\nWe help each other grow: We each bring unique skills to the table and want our teammates to feel valued from the start. Our onboarding program exposes new hires to the codebase and lets them contribute right away. We move quickly: We ship code multiple times a day. We believe in getting valuable features in front of customers and iteratively improving as we learn what works and what does not. We value product over process: We want the team to have the time and focus on solving complex challenges. We minimize the overhead by setting clear goals and avoiding heavyweight processes and excessive meetings.We share knowledge freely: We share our learnings with each other and with the developer community. Our engineering blog demonstrates how we tackle interesting challenges at Aha! We enjoy: We like what we do. And we want you to love your team and your job too. Learn more about The Responsive Method , our company values , and the generous benefits we offer.Our technology\nOur web application is a single-instance, multi-tenant Ruby on Rails monolith supported by Postgres (database), Redis (background jobs), and memcached (Rails caching). We also run a Node.js webserver to support collaborative editing and real-time updates. Our application is hosted on Amazon Web Services and architected with ECS for reproducibility and scalability.\nSome Of The Features We Have Built With React Include\nWe use React for rich client-side experiences on the front end.\n Our fully collaborative text editor : Supports multiple cursors and simultaneous editing by any number of users. We pride ourselves in the underlying technology . Our presentation editor : Allows users to create presentations with slide themes, shapes, text, and embedded Aha! reports that update live so the presentation is always current. Our Gantt chart : Supports scaling and scrolling to change the timeline, drag-and-drop, and quick actions to create records or sort the bars.\nWe embrace new technologies that help us deliver a lovable product, but we also remain cognizant of the maintenance overhead that a new library or platform brings. We solve the problems in front of us, rather than prematurely optimizing to address issues that may never materialize.\nWe do most of our planning and collaboration in Aha! Roadmaps and built Aha! Develop so that software engineers and their teams could take advantage of those same rich features. We use Slack and Zoom for video calls. (Email? Rarely.)\nYour Experience\nAll of our engineers work across the full stack. As a Senior Front End Engineer, you will spend the majority of your time working with React or HTML/CSS. You will also write significant back end code in Ruby on Rails to support the front end features you are building.\nYou Also Have The Below Experience And Skills\nWe believe that being a kind person who elevates the rest of the team is just as valuable as writing great code. You have strong problem-solving skills and experience working on important functionality for a cloud-based product. You are humble, eager to learn, and always willing to help others learn as well. You want teammates who enjoy solving problems regardless of the technologies and techniques involved. You have worked at meaningful scale before and want to do so again.\n2+ years of experience working in ReactProducing scalable, data-intensive React pagesExperience building features (ideally at a high-growth SaaS company)Active collaborator with product teamsYour work at Aha!\nAs a Senior Front End Engineer, Your Work Will Include\nWe work on a broad range of features across the full stack.\nImplementing new features for our users, touching each layer of the MVC as neededBuilding deeply interactive reporting interfaces using ReactWorking proactively with product and UX to refine and iterate on specifications as the feature takes shapeOptimizing browser performance on screens and components that render large quantities of data to ensure Aha! is snappy and satisfying to useInterfacing directly with users to quickly squash bugs as part of our regular customer support rotation Documenting components in our style guide to help drive consistency\nIf this role sounds appealing, we would love to hear from you. (A real human reviews every application.)\nGrow with us\nEveryone deserves to reach their fullest potential. We know that when we do work that matters with people we care about in a high-growth environment, we feel engaged and alive. And our goal is to help you do just that. We offer all the benefits you would expect and more, including profit sharing. The specific benefits listed below are reflective of what we offer U.S.-based hires. We also do our best to extend identical benefits to international teammates.\nThe base salary range for this role in the US is between $110,000 and $190,000Cash-based compensation also includes profit sharing and we contribute a percentage of your total pay each month towards your retirementMedical, dental, and vision plans — for many teammates, we cover 100 percent of the premiumsUp to 200 hours of paid time off a year to spend however you want30 to 90 days of paid parental leave and five to 10 days of paid care and bereavement leaveUp to $1,000 annually for third-party education, along with paid time off to immerse yourself in learningVolunteer opportunities throughout the year\nBase salary and total compensation are dependent upon many factors, such as: skills, experience, and relevant past roles", "Years Experience": "2+ years", "Years Context": "....2+ years of experience working in ReactProducing scalable, data-intensive React pagesExperience building fea....\n....s of paid time off a year to spend however you want30 to 90 days of paid parental leave and five to 10 days of paid care and ....\n....ities throughout the year....", "Skills": "Bootstrap(1)\nPostgres(1)\nNode(1)\nAmazon(1)\nReact (4)\nfront end(2)\nfull stack(2)\nFront End(2)\nHTML(1)\nCSS(1)\nReact(2)"}, {"Date Added": "01/25/2023", "Job ID": "3359359867", "Url": "https://www.linkedin.com/jobs/view/3359359867/", "Job Title": "Network Engineer (Meraki/Wireless/Cisco)", "Company": "CyberCoders", "Description": "If you are a Network Engineer CCIE/CCNP with Cisco experience, please read on!\n\nLocated Yakima, WA (100% REMOTE)\n\nWe provide services to hundreds of thousands of patients across Oregon and Washington as a Medical Home With integrated services including medical, dental, pharmacy, orthodontia, primary care nutritional counseling, autism screening, and primary care behavioral health - come join us as a strong Network Engineer and make a difference in the lives of people who need others to stand up for them!\n\nTop Reasons to Work with Us\n Operate under common core values Above average compensation Strong Commitment for work life balance Fully Remote!\nWhat You Will Be Doing\n Design, maintain the enterprise network infrastructure Senior in network infrastructure-related work\nWhat You Need for this Position\n 6+ years professional experience as a Network Engineer BSIT/CS related experience with MPLS and QOS/Shaping experience with Palo Alto Firewall or Cisco NGFW experience with Good Routing (BGP) experience with Wireless (Cisco 9800 VM, 9120AX Aps) experience with Meraki: MX, MS, MR BSIT/CS related (industry experience fine) CCIE/CCNP\nWhat's In It for You\n Full Benefits: Medical, Dental, & Vision Employee Health Insurance: Pays 100% for employee and a portion of dependent premiums HSA, DCFSA, Group Term Life Insurance, AD&D, Term Life, Short Term Disability, LT Disability Profit Sharing 401(a), Tax Sheltered Annuity 403(b) Paid Holidays, PTO, Sick Pay, Bereavement Leave Jury Duty Leave, EAP, Malpractice insurance HUGE room for growth!\nBenefits\n Vacation/PTO Medical Dental Vision 401k Bonus\nSo, if you are a Network Engineer CCIE/CCNP Remote with experience, please apply today!\n\nColorado employees will receive paid sick leave. For additional information about available benefits, please contact Chad Vasquez\n\nEmail Your Resume In Word To\n\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\n\nChad.Vasquez@CyberCoders.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : CV6-1700516 -- in the email subject line for your application to be considered.***\nChad Vasquez - Lead Recruiter - CyberCoders\n\nApplicants must be authorized to work in the U.S.\n\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n\nYour Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\n\n", "Years Experience": "6+ years", "Years Context": ".... 6+ years professional experience as a Network Engineer BSIT/CS related experience with MPLS and QOS/Shaping ....", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3449532794", "Url": "https://www.linkedin.com/jobs/view/3449532794/", "Job Title": "SRE –Site Reliability Engineering Database Architect - Full-time role", "Company": "Photon", "Description": "Greetings everyone,I hope you are staying safe. We are hiring a SRE –Site Reliability Engineering Database Architect - Full-time role to join our Digital Engineering team.\nWho are we?For the past 20 years, we have powered many Digital Experiences for the Fortune 500. Since 1999, we have grown from a few people to more than 4000 team members across the globe that are engaged in various Digital Modernization. For a brief 1 minute video about us, you can check https://youtu.be/uJWBWQZEA6o.\nSRE –Site Reliability Engineering Database Architect - Full-time role Location: - Atlanta, GA\n\nMust have skills· Database performance tuning · Understand how MongoDB and Cosmos DB perform and scale· Experience in High Availability Architecture\nCritical Readiness JOB Description Resource we are looking for should be Super Good. Qualified candidates should have database and architecture background as well as SRE experience.List of important keywords to look for people’s profile:Oracle, MySQL, Postgre, PerconaSRE –Site Reliability EngineeringPerformance engineering, Load Testing, Stress TestingScalability, availability, resiliency, Performance tuning, Troubleshootingtools: Datadog, AWR, Oracle enterprise manager, MySQL enterprise monitorLog Analytics: Splunk, ELFHigh Availability, active-active, active-passive, failover, high throughput, mission critical application(internal note: Data Model, data analytics, data warehouse (OLAP) wouldn’t fit", "Years Experience": "20 years", "Years Context": "....e we?For the past 20 years, we have powered many Digital Experiences for the Fortune 500. Since 1999, we have grown from a few....", "Skills": "git(3)\nMongo(1)\nMySQL(2)"}, {"Date Added": "01/25/2023", "Job ID": "3453684756", "Url": "https://www.linkedin.com/jobs/view/3453684756/", "Job Title": "Sr Cisco Network Engineer", "Company": "Dice", "Description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, ABF, LLC, is seeking the following. Apply via Dice today!\nRole: Cisco Network Engineer\nLocation: Atlanta, GA – Onsite\nDuration: 6+ months\nMOI: 1 video round and select\nNeed someone who can set up Cisco DNA and CSPC and who has done that.\nCisco DNA set-up and CSPC (Common Service Platform Collector) - provided by Dice", "Years Experience": "", "Years Context": "", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3450967143", "URL": "https://www.linkedin.com/jobs/view/3450967143/", "Job Title": "Water Resources Engineer", "Company": "Jobot", "Description": "Water Resources Engineer - Competitive Salary, Bonus, Benefits, Work/Life Balance!!!\nThis Jobot Job is hosted by Tony Barhoum\nAre you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.\nSalary $90,000 - $125,000 per year\nA Bit About Us\nWe are a multi-disciplinary Engineering consulting firm delivering a full range of Civil and Environmental services including the planning, design, and construction management of water and wastewater-related projects – from clean water treatment, storage, and distribution to wastewater and stormwater collection, treatment, and reuse. We specialize in safe drinking water and controlling water pollution with projects including the largest drinking water UV disinfection installation in the world, upgrade of major wastewater treatment plants to reduce nutrient discharges to sensitive receiving waters and recharging vital drinking water aquifers with highly treated wastewater effluent, renewing a valuable resource.\nFounded in 1951 with over 60 offices across the US, our focus remains making us the home to many of the world’s most knowledgeable and experienced environmental engineers and scientists, each seeking a challenging and rewarding career while making an important contribution to the communities in which we work. We offer rewarding opportunities at our various locations and are always seeking talented individuals to join our growing team. We believe that putting your employees first is not only the right thing to do, but it also gives us the competitive edge to ensure our clients have an excellent experience! Over the years our reputation for providing our people with the very best has caught the eye of some reputable clients who have chosen to use us as their primary firm! Some of these clients include Public & Private institutions, Local Utilities, City/State/Federal Projects, and many more!\nIf you are an experienced Civil Engineer with Water Resources Experience, then please apply!\n\n\nWhy join us?\n\nDo you want to work with some of the nation’s best Clients AND enjoy time at home w/ family? We do too!\n Meaningful Work! Best in Class Firm! Competitive Compensation Package! Complete Benefits Package! Flexible Work Schedules! Accelerated Career Growth! Fun Company Activities! Many More!\nJob Details\nIs your background a fit? Apply if you meet this criterion\n BS/MS in Civil Engineering, or equivalent  EIT or PE License Desired, Not Required 5+ years of Water Resources Engineering & Design experience. Must have municipal water and wastewater facilities planning and design projects. Proficient in AutoCAD Civil 3D Experience planning and designing dam projects.\nDuties\n Leading dam, stormwater, and/or floodplain planning, analysis, and design projects Performing H&H analysis, models, and design calculations Preparing assessment and design reports Contributing to and overseeing development of construction documents and technical specifications Providing construction management support and inspection services Communicating and interacting effectively with clients and internal team members Supporting our dam, stormwater, and green infrastructure business development efforts\nWe can offer you the opportunity to work with State-of-the-Art Clients making a meaningful impact on today's society and the next generation! Help us revolutionize the way firms treat their employees! Join us and enjoy accelerated career growth with exciting life balance at a premium best in class firm!\nInterested in hearing more? Easy Apply now by clicking the \"Apply\" button.", "Years Experience": "5+ years", "Years Context": "....0,000 - $125,000 per year....\n....experience! Over the years our reputation for providing our people with the very best has caught the eye of some reputable cli....\n....red, Not Required 5+ years of Water Resources Engineering & Design experience. Must have municipal water and wastewater facili....", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3138300983", "URL": "https://www.linkedin.com/jobs/view/3138300983/", "Job Title": "Senior Project Engineer", "Company": "Alfred Benesch & Company", "Description": "Simply Put, A Great Place to Work!\nBenesch is a growing, multi-disciplined planning, engineering, and professional services firm. We enhance infrastructure and communities across the country – creating spaces and providing connections in ways that make a difference.\nWe pride ourselves on being nimble enough to remain responsive to client needs, yet large enough to offer exceptional bench strength. As a member of our team, you’ll have an opportunity to draw from those resources when you need them, and likewise, contribute your expertise when you have something to share.\nAt Benesch, we are looking for candidates with varied backgrounds and worldviews. Diverse ideas come from diverse people, and we are committed to offering an inclusive work environment where everyone feels valued and respected.\nBenesch is a great company to work for! Our comprehensive benefits package includes paid over-time, exceptional retirement fund contributions, flexible schedules, wellness incentives, and all-around great people to work with. Take your career to the next level by applying today.\nStatistics show that women and underrepresented groups are less likely to apply for a position if they don’t meet 100% of the qualifications. If this statement resonates with you – don’t be so hard on yourself. Apply for the job!\nSenior Project Engineer - Atlanta, GA \nOur Atlanta office is looking for a Senior Project Engineer to join our Civil - Roadway group! This is a position with minimum supervision and guidance. This person should be capable of leading the technical aspects of a task and successfully monitoring budget and schedule.\nThe Impact You Will Have:Perform complex and highly advanced analysis and design, assuming responsibility for the analysis.Check and sign off on design calculations and plan elements while ensuring completeness.Perform QA tasks on projects as assigned.Oversee layout and/or review drawings for a project.Review and approve project design criteria for the project components and assume responsibility for assigned design calculations and plans.Assemble and write competent draft report sections.Monitor and compare cost estimates to client expectations and identify anomalies and propose corrective action to the Project Manager or client as appropriate.Communicate progress and issues to Project Manager in a timely and ongoing manner.Identify and propose resolution to issues identified.Train/mentor others as necessary to complete required tasks.Continue involvement in professional organizations, seeking leadership roles.Seek out opportunities to publish papers and develop presentations.\nWhat We Are Looking For:Bachelor of Science in Civil Engineering, or higher10+ years of experiencePE is requiredGDOT roadway design experience preferredExperience working with clients such as State Departments of TransportationProficient at using MicroStation and/or InroadsExcellent verbal and written communication skillsAbility to collaborate with others in a team environment relating to a variety of tasks.Highly advanced understanding and knowledge of applicable codes and standards (including commentary).Excellent Technical writing skills.", "Years Experience": "10+ years", "Years Context": "....eering, or higher10+ years of experiencePE is requiredGDOT roadway design experience preferredExperience working with clients ....", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3302227758", "URL": "https://www.linkedin.com/jobs/view/3302227758/", "Job Title": "Senior Civil Engineer - Biogas Engineering (Multiple Locations)", "Company": "Burns & McDonnell", "Description": "Description\nBurns & McDonnell is looking for a Senior Biogas Engineer to add to our Environmental Services Engineering team. Burns & McDonnell is a 100% employee-owned firm providing the opportunity to exercise your entrepreneurial spirit and develop professionally within a growing and industry leading engineering firm.\nThe Successful Candidate Will Be Highly Self-motivated And Have The Following Experience\nAs part of the Environmental Services Practice, this position will support the development and growth of our waste-to-energy market services.\nExecution of biogas feasibility studies, process design development, mass and energy balances, equipment procurement packages, construction design documents, and construction support.Understanding of the waste to energy industry including existing / emerging markets and demonstrated ability to monitor and communicate new market drivers and regulatory changes.Supporting civil and environmental projects which may include earthwork, stormwater, wastewater, remediation, solid waste, and restoration.Developing and maintaining client relationships.Mentorship to staff and project engineers.\nDuties May Include\nBiogas generation estimates.Materials handling design.Gas collection and process design.Anaerobic digestion byproduct management.Biogas cleanup and preparation of designs for end use.Preparation of permit applications (water, air, solid waste).Capital planning and cost estimating.Written reports.Internal and External Oral Presentations.Training/Mentoring staff.Business Development.Other duties, as assigned.\nQualifications\nBachelor's degree in Civil, Environmental or Chemical Engineering or other related engineering program from an accredited university.PE license preferred.Minimum 7 years related experience, 3 years experience in biogas engineering preferred.Available for travel and field work (approximately 15% travel)\nEEO/Minorities/Females/Disabled/Veterans\nJob Civil Engineering\nPrimary Location US-MO-Kansas City\nOther Locations US-OK-Oklahoma City, US-KS-Wichita, US-ME-Portland, US-AZ-Tucson, US-FL-Orlando, US-WA-Seattle, US-MD-Baltimore, US-TX-Austin, US-NE-Omaha, US-GA-Atlanta, US-MA-Newton, US-PA-Philadelphia, US-MN-Duluth, US-AZ-Phoenix, US-TX-Fort Worth, US-CA-Los Angeles, US-TN-Chattanooga, US-CT-Wallingford, US-CA-Brea, US-WI-Madison, US-CA-San Diego, US-WA-Vancouver, US-VA-Norfolk, US-NC-Charlotte, US-MN-Minneapolis/St Paul, US-AR-Springdale, US-VA-Richmond, US-OR-OR FIELD EMP - Portland, US-IL-Downers Grove, US-CA-San Francisco, US-DC-Washington, US-NC-Raleigh, US-FL-Miami, US-TX-Amarillo, US-UT-Salt Lake City, US-MI-Detroit, US-OH-Columbus, US-SC-Greenville, US-MO-Saint Louis, US-NJ-Morristown, US-SC-Aiken, US-TX-Houston, US-VA-Arlington, US-VA-Roanoke, US-KY-Lexington, US-TX-Dallas, US-IL-Chicago, US-SD-Sioux Falls\nSchedule: Full-time\nTravel: Yes, 15 % of the Time\nReq ID: 211161\n#ENS\n", "Years Experience": "7 years\n3 years", "Years Context": ".... preferred.Minimum 7 years related experience, 3 years experience in biogas engineering preferred.Available for travel and fie....", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3453899471", "URL": "https://www.linkedin.com/jobs/view/3453899471/", "Job Title": "Application Engineer - Semiconductor Fab", "Company": "Solvay", "Description": "Solvay is a science company whose technologies bring benefits to many aspects of daily life. Our purpose—we bond people, ideas and elements to reinvent progress—is a call to go beyond, to reinvent future forms of progress and create sustainable shared value for all through the power of science. In a world facing an ever-growing population and quest for resources, we aim to be the driving force triggering the next breakthroughs to enable humanity to advance while protecting the planet we all share.\n\nWe bond with customers and partners to address today and tomorrow’s megatrends. As a global leader in Materials, Chemicals and Solutions, Solvay brings advancements in planes, cars, batteries, smart and medical devices, water and air treatment, to solve critical industrial, social and environmental challenges. You can count on our innovative solutions to contribute to safer, cleaner and more sustainable future.\n\nImportant EEO information related to opening in the US\nSolvay is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other legally protected characteristics. Click on the links to read \"The EEO is the Law\" poster and the “EEO is the Law” poster Supplement.\nWe will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. For more information, please click here.\nSolvay is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to humanresources.na-us@solvay.com and let us know the nature of your request and your contact information.\nRole Overview\nWe are looking for:\nThe Applications Engineer (Semicon) sits within our Customer Technical Development function within Solvay Specialty Polymers and designed to provide strong technical expertise and value to our customers by leveraging the entire product portfolio, resources, and know-how of the GBU.Solvay Specialty Polymers is looking for creative, curious self-starters and leaders interested in non-routine challenges to join the Technical Development team and support semiconductor applications in North America.You will be responsible for providing technical application development expertise to customers and will interact with the internal organization (commercial teams, application development team, R&D, Manufacturing, etc.) to develop total customer solutions.\n\nWe count on you for:\nYou will work directly with customers in collaboration with the sales and marketing to identify & develop application opportunities where Solvay’s specialty polymers add value and solve customer problems.Elicit a complete set of customer requirements and develop the value proposition of Solvay materials.Work directly with the Global CTD community and our Research and Development teams, to lead the development and implementation of solutions for customer applications. This includes polymer material recommendation and validation, design support for metal to plastic conversion, prototyping support, tooling design recommendations, testing, and processing assistance. Provide technical training and literature for both internal and external use about designing with polymers, polymer selection, polymer processing, simulation and prototyping.Champion sustainability solutions.Collaboratively interact and share expertise with the global CTD team, and create technical marketing literature.\n\nYou can count on us for:\nLong-lasting excellent customer relations, self-dependent working, and a variety of tasks in one of the world’s leading chemical companies.Excellent training & development possibilities.You will acquire dynamic market knowledge and competitive landscape understanding.\n\nYou will bring:\nEducation & Experience \nBachelor degree in Mechanical Engineering, Chemical Engineering, Material Science, or equivalent applicable technical degree5+ years of experience in a technical position working with polymers: knowledge of polymer physics, material selection, and processingExperience in semiconductor applications/customers/tiersMechanical aptitude, experience in part and tooling design and failure analysis \n\nSkills\nHands-on experience working with polymers in a manufacturing environment (extrusion, injection molding, compression molding)Ability to execute projects with short life cyclesDemonstrated ability to work independently and effectively to build deep relationships with both external customers and within a global Solvay teamStrong communication skills & customer-focus\n\nDesired behaviors \nStrong analytical and problem-solving skills, technically-orientedExcellent communication skillsAbility to apply technical knowledge in a customer-facing and commercial environmentExcellent project management skillsData analysis, quantitative, qualitative\n\nYou will get:\nCompetitive salary - The U.S. base salary range reasonably expected to be paid for this position is $90,000 to $130,000. Since actual compensation packages are based on a variety of factors unique to each candidate we may ultimately pay more or less than the posted base salary range. Total compensation for this role also includes bonus and/or other incentives. Health insuranceLife insurance16 weeks of maternity/paternity and co-parenting leaveTraining platform for all employeesFree language courses (24 languages available)Solvay Shares Plan Free well-being sessions (physical and psychological)\n\nAdditional information:\nLocation(s): Alpharetta (Georgia, US)Willing and able to travel 50-60% of the time and have a flexible working schedule\n\n \n\nAdditional Information\nSolvay’s purpose is to bond people, ideas and elements to reinvent progress. We can only fulfill this purpose with a diverse workforce that feels respected and appreciated, and has equal opportunities to work, grow and thrive. Our differences, visible or not, are valued. As Solvay seeks to promote unity and not uniformity, we invite you - regardless of background, age, gender, race, national origin, ethnicity, religion, sexual orientation, ability or identity - to consider a future with us.\n\n\nImportant Important EEO information related to opening in the US \n\nSolvay is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other legally protected characteristics. Click on the links to read \"The EEO is the Law\" poster and the “EEO is the Law” poster Supplement.\n\n We will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. For more information, please click here.\n\n Solvay is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to hrstaffingoffice.na-us@solvay.com or call 800-311-3555 and let us know the nature of your request and your contact information.\n\n", "Years Experience": "5+ years", "Years Context": "....e technical degree5+ years of experience in a technical position working with polymers: knowledge of polymer physics, material....", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3452703068", "URL": "https://www.linkedin.com/jobs/view/3452703068/", "Job Title": "Engineer", "Company": "Sonesta Hotels", "Description": "Job Description Summary\nThe Engineer performs general maintenance work to ensure hotel physical plant quality and safety standards are achieved and maintained. The Engineer takes care of the building, equipment and grounds of the hotel. This position will perform maintenance and repairs, and preventative maintenance, to all areas of the hotel.\nJob Description\nWork Environment \nInterior and exterior of building with potential for guest facing contact.Exposure to extreme temperatures inside and outside of the building.\nPhysical Demands\nMust be able to exert in excess of 100 pounds of force occasionally, and/or in excess of 50 pounds of force frequently and/or in excess of 20 pounds constantly to lift, carry, push, pull, or otherwise move objects.Frequent bending, kneeling, climbing, stooping and reaching.Ability to stand during entire shift.\nExpected Hours of Work \nMust be flexible to work variable days of the week to include weekends and holidays.Must be flexible to work variable shifts (days, nights, overnights).Ten to twelve hour shifts sometimes required.\nEducation And Experience\nSpecialized knowledge and skills or certification within a field or discipline such as plumbing, electrician, carpentry, equipment mechanics, HVAC, refrigeration, etc.Trade school and/or college course work in related field preferred.Experience in a hotel or a related field preferred. \nPrinciple duties and responsibilities (Essential Functions) include: \nPerform general maintenance and repairs for assigned area of expertise such as the interior and exterior of buildings, hotel rooms and contents, laundry and kitchen/refrigeration equipment, lighting, heating, air conditioning (HVAC), ventilation, water treatment systems, and swimming pool, etc. Perform preventative maintenance on a regular basis and ensure that assigned equipment is maintained and operational.Adhere to federal, state and local safety regulations, brand standards and other compliance requirements. Report all unsafe conditions or malfunctioning equipment to supervisor. Follow procedures that ensure the security of inventory and assets such as tools, supplies, equipment, furniture, televisions, etc.Replenish supplies and inventory in a timely and efficient manner and minimizes waste. Take required readings on equipment.Replace and program televisions as needed.Replace light switches, receptacles, light bulbs and fixtures.Paint designated areas and perform plumbing repairs (i.e. clogged drains, copper pipe, change washers, change handles, drain fittings, etc).Understand and be able to read blueprints and wiring diagrams.Refurbish furniture and fixtures and repair all types of wall coverings.Repair and program hotel electronic lock system.Deal with reasonable complaints/requests with professionalism and patience.Display professional appearance and demeanor at all times.Attend departmental pre-shift and mandatory meetings.Perform other duties as requested by management.\nQualifications And Skills\nAttentive, friendly, helpful and courteous to all guests, managers and fellow employees.Ability to prioritize and multitask.Excellent organizational skills and attention to detail.Reading and writing abilities are utilized in order to document or record all tasks completed, to order supplies, to receive instructions for the day and/or to read equipment repair manuals.Mathematical skills, including basic math, percentages, quantities, and variances.Professional verbal communication skills.Excellent interpersonal and customer service skills.Prioritization and time management skills.\nGo Beyond @SonestaHotels\nWho We Are\nWe are an organization made up of people, thoughts and ideas – all working towards fulfilling our simple mission: To wow every guest, team member, partner & community we operate in by delivering quality, value & amazing hospitality.\nWe will achieve our mission by being passionate about exceeding expectations - by being persistent, resilient, and constantly seeking new and creative ways to succeed. Doing the Right Thing and Going Beyond are our principles that guide everything we do.\nWe are an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status, or any other characteristic protected by local, state, or federal laws, rules, or regulations.\nThe statements in this job description are intended to represent the key duties and level of work being performed. They are not intended to be ALL responsibilities or qualifications of the job. This job description is subject to change at any time.\nBenefits\nAdditional Job Description\nSonesta recognizes that benefits play a vital role in helping ensure the health and financial security of employees and their families. We offer a variety of benefits to our employees including:\nMedical, Dental and Vision InsuranceHealth Savings Account with Company Match401(k) Retirement Plan with Company MatchPaid Vacation and Sick DaysSonesta Hotel DiscountsEducational AssistancePaid Parental LeaveCompany Paid Life InsuranceCompany Paid Short Term and Long Term Disability InsuranceVarious Employee Perks and Discounts\nUpon submitting your application, please ensure you complete a full application in addition to attaching a resume. Incomplete applications received will not be considered.", "Years Experience": "", "Years Context": "", "Skills": "aws(1)"}, {"Date Added": "01/25/2023", "Job ID": "3449537261", "URL": "https://www.linkedin.com/jobs/view/3449537261/", "Job Title": "Heating And Air Conditioning Engineer", "Company": "AKS Incorporated", "Description": "HVAC EngineerCurrently seeking an established HVAC Engineer for an opportunity in Atlanta & Alpharetta GA but they are open to a hybrid work schedule. Ideal candidates will have a degree in Engineering with a proficiency in AUTOCAD and Revit. Company offers full benefits, 401K plan, overtime pay & a very competitive bonus schedule.HVAC Engineer will work in a fast paced team environment with a group of Mechanical, Electrical & Civil Engineers.Involved in project engineering, management, & marketing support.Work cooperatively and collaboratively with existing team of designers and engineers to follow through with tasks and recommend solutions for project designs.Requirements of the HVAC EngineerHVAC EngineerEIT/PE is a big plusApplicants should have 1 year plus experience working with HVAC DesignProficient in AUTOCAD & Revit knowledge a big plusExperience working on Commercial or Institutional projects is a mustMust possess strong communication skills, team leadership skills, work in fast-paced environment with multiple deadlines and possess comprehensive engineering software'", "Years Experience": "1 year", "Years Context": "....icants should have 1 year plus experience working with HVAC DesignProficient in AUTOCAD & Revit knowledge a big plusExperienc....", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3450712072", "URL": "https://www.linkedin.com/jobs/view/3450712072/", "Job Title": "Diesel Fleet Mechanic Technician II", "Company": "Sysco", "Description": "Company\nUS0002 Sysco Atlanta, LLC\nZip Code\n30337\nMinimum Level Of Education\nHigh School or Equivalent\nMinimum Years Of Experience\n3 Years\nEmployment Type\nFull Time\nTravel Percentage\n0\nAt Sysco your career moves with you! We currently have technician position available across the US! We offer relocation assistance packages to help you make the move to your desired location. We have strong compensation and benefits to go along with our robust training program and tool allowance. Here the opportunities are limitless. Learn more about our available positions across the US at https://careers.sysco.com/\nJob Summary\nTo provide safe, reliable and cost-efficient vehicles by performing quality preventive maintenance inspections and repairs as well as performing expert diagnosis and repair as required to prevent breakdowns on road, reduce vehicle downtime and improve total fleet reliability.\nResponsibilities\nPerform required inspections and preventive maintenance on vehicles and equipment with in planned time tolerances to maximize the safety, reliability, and cost efficiency throughout the life cycle of the fleet.Perform FAI/CVI (Annual) inspections on all fleet vehicles including tractors, trailers, converter dollies, light-duty vehicles, and any other company-owned equipment in accordance with all federal, state and local legal and regulatory agencies. (Includes all state-required inspections and frequencies).Perform quality preventive maintenance inspections per company methods on all fleet vehicles including tractors, trailers, converter dollies, lift-gates, light-duty vehicles, and any other company-owned equipment.Perform quality maintenance repairs as required to maximize safety and reliability on all fleet vehicles including tractors, trailers, converter dollies, lift-gates, light-duty vehicles, and any company-owned equipment.Address all Driver Vehicle Inspection Report write ups timely, and efficiently.Diagnose cause of any malfunction and perform repairs to manufacturer specifications including but not limited to engines, transmissions and clutches, drive-line, differential, steering and suspension, fuel and ignition system, exhaust systems (including regeneration systems), intake systems, electrical systems, brake systems, HVAC systems and lift-gate hydraulic, mechanical and electrical systems.Follow procedures including documenting all work performed on work orders.Learn and develop efficiency in Sysco computer programsProficient in electrical meter testingKnowledge of controls and electric (DC (distribution center) low voltageElectric motor knowledge (DC)Complete electrical repairs and welding projects as needed.\nQualifications\nEducation\nMedium / Heavy Duty truck technical trainingHigh school diploma or GED required\nExperience\n2-year school and 1 year of experience or 3 years of experience in fleet maintenance and repairCurrent and valid driver's license.\nCertifications, Licenses, and Registrations\nAnnual Inspector Certification, Knowledge, Skills, and AbilitiesBrake Inspector Certification, Knowledge, Skills and AbilitiesASE certifications; Automotive or Medium/Heavy Duty Trucks (Preferred, Not Required)609 HVAC Certification\nProfessional Skills\nWorking knowledge of computer-based diagnostic software for OEM's and component manufacturersMust provide own and provide all tools (diagnostic equipment and major tools provided by Sysco) necessary to perform all maintenance repair and diagnosticsExpert knowledge and skill of all vehicle systems and componentsModerate knowledge and skill in diagnosis and repair of electrical systems on all equipmentModerate knowledge and skill in Preventive Maintenance Inspections and repairBasic knowledge and skill in welding and cutting (gas, electric, MIG, TIG)Basic computer skills and knowledgeModerate knowledge of all DOT (FMCSA) regulationsBasic knowledge of OSHA safety regulationsBasic knowledge of environmental regulationsThe employee is Repair work requires excellent hand and finger dexterity used for wrenches, hand tools, and other shop equipment.Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception and the ability to adjust focus.Ability to operate various pieces of equipmentAbility to stand, sit, walk, bend, reachAbility to push/pullAbility to lift /carryAbility to grasp toolsAbility to perform Repetitive motion: wrenches and hand tools\nPhysical Demands\nWhile performing the duties of this job, the employee is regularly required to sit, stand, walk and use hands and fingers to operate a computer keyboard, mouse, and telephone to talk and hear.The employee is frequently required to sit and reach with hands and arms.The employee is frequently required to climb, balance, stoop, kneel, crouch, bend or crawl.The employee is occasionally required to sit and must frequently lift and/or move up to 100 lbs.\nWork Environment\nWhile performing the duties of this job, the associate is occasionally exposed to wet, hot, extreme cold and/or humid conditions; and moving mechanical parts and may be required to work in confined spaces.The associate works non-traditional business hours including evenings, nights, weekends, holidays and on-call.The associate may occasionally be required to travel to other Operating Companies or the corporate office as business needs dictate (i.e. training, business continuation, etc.).The associate is occasionally exposed to high, precarious places and confined spaces.The associate is occasionally exposed to fumes or airborne particles.The noise level in the work environment is usually moderate.Frequently works outdoors.\nBenefits Information\nFor information on Sysco's Benefits, please visit https://SyscoBenefits.com\nCOVID-19 Precaution(s)\n HOW WE PROTECT OUR   ASSOCIATES \nPersonal protective equipment and masks providedTemperature screeningsSocial distancing guidelines in placeSanitizing, disinfecting, and cleaning procedures in place\nOverview\nSysco is the global leader in foodservice distribution. With over 57,000 associates and a fleet of over 13,000 vehicles, Sysco operates approximately 326 distribution facilities worldwide and serves more than 625,000 customer locations.\nWe offer our associates the opportunity to grow personally and professionally, to contribute to the success of a dynamic organization, and to serve others in a manner that exceeds their expectations. We're looking for talented, hard-working individuals to join our team. Come grow with us and let us show you why Sysco is at the heart of food and service.\nAffirmative Action Statement\nApplicants must be currently authorized to work in the United States.\nWe are proud to be an Equal Opportunity and Affirmative Action employer, and consider qualified applicants without regard to race, color, creed, religion, ancestry, national origin, sex, sexual orientation, gender identity, age, disability, veteran status or any other protected factor under federal, state or local law.\nThis opportunity is available through Sysco Corporation, its subsidiaries and affiliates.", "Years Experience": "1 year\n3 years", "Years Context": "....2-year school and 1 year of experience or 3 years of experience in fleet maintenance and repairCurrent and valid driver's li....", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3453695431", "URL": "https://www.linkedin.com/jobs/view/3453695431/", "Job Title": "Senior Engineer, Mechanical", "Company": "EYP", "Description": "Description\n\nResponsible for the production of thorough and concise computer-generated engineering drawings. Prepare layouts of engineering systems, perform energy and load calculations, and producing specifications.\n\nEssential Duties\nCoordinate and prepare schematic design, design development, and construction documentsDesign mechanical systems including heating, cooling, heat rejection, air distribution, ventilation, air conditioning, building automation and controlsIncorporate sustainable design methods in buildings and prepare green rating system documentationAssist in spatial coordination with architecture and other engineering systemsDeliver projects across multiple delivery models, including design/bid/build, design assist, design buildProcess contractor submittals, RFIsPerform on site condition surveysProduce quality workProvide mentoring and direction to junior members of the project team or engineering disciplineUse technology and methodologies to create innovative approaches to building designConsistently strive to improve technical quality of work product by keeping abreast of new technologies, changes in building codes, and advances in the industryWork collaboratively in a cross-discipline environment to produce integrated project documents, and insure integrated design approaches & solutionsAssist in the procurement of high-quality work; including marketing / proposal efforts and project interviewsManage multi-disciplinary teams on projects related to Government, Healthcare, Higher Education and Science & TechnologyMaintain strong client relations as it pertains to project delivery and repeat businessPerform and maintain thorough QA/QC on all phases of projectsParticipates in recruiting efforts across the firm\nReq Number ENG-23-00045\n\nPosition Requirements\nProfessional Degree in Engineering or Architecture Engineering requiredP.E. License required7 – 18 years LEED AP BD+C preferredEvidence of public recognition of expertise preferred (e.g. articles, conference papers, ASHRAE committee membership, or speaking engagements)Familiarity with BIMMaintain technical competence by staying current on appropriate codes and technologies.Proficient in the use of state-of-the-art tools for engineering design and documentation, including Revit.Thorough understanding of the engineering systems within a specific discipline.Thorough understanding of advanced engineering principles and calculationsGeneral understanding of engineering principles and systems within other disciplinesMonitors & manages project budgets to ensure cost effective deliveryExpertise in area of concentration.Effective communication skills (written and oral).Demonstrated thoroughness in design coordination and contract document development in area of concentration.Demonstrated record of consistent quality work.Able to work with little or no supervisionAbility to lead others and foster teamworkBusiness development capabilities, commercial/financial awarenessProject management and supervisor experience preferredDemonstrated knowledge in sustainable building design\nAbout the Organization We're excited to announce that EYP recently joined with Page Southerland Page, Inc., and we are now EYP, a Page company (Page/EYP), a multidisciplinary design firm rooted in architecture, engineering, and design consulting capabilities.\n\nGuided by similar values and culture, Page/EYP has expanded services and geographic reach, working seamlessly across offices and disciplines with 1300-plus talented staff and 16 offices in the U.S. and abroad. Together, we'll be able to offer you more - more talent, ideas, rigor, and energy to innovate and co-create something new.\n\nOur diverse, international portfolio now encompasses academic; aviation; civic, community and culture; corporate and commercial; government; healthcare; housing and hospitality; industrial; life sciences; and science and technology markets. We've expanded our high-performance capabilities to help you continue measuring, reducing, and offsetting carbon emissions. And, we can explore even more opportunities to promote equity and wellness with teams versed in practices like universal design, Design for Freedom, Well, Fitwel, and other strategies contributing to diversity and inclusion.\n\nAs we move forward as Page/EYP, the most important things won't change - our people-first values and unwavering commitment to you remain the same!\n\nEOE Statement We are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status or any other characteristic protected by law.\n\nNOTICE TO THIRD PARTY AGENCIES: Please note that Page does not accept unsolicited resumes from recruiters or employment agencies. In the absence of a signed Recruitment Fee Agreement, Page will not consider or agree to payment of any referral compensation or recruiter fee. In the event a recruiter or agency submits a resume or candidate without a previously signed agreement, Page explicitly reserves the right to pursue and hire those candidate(s) without any financial obligation to the recruiter or agency. Any unsolicited resumes, including those submitted to hiring managers, are deemed to be the property of Page.", "Years Experience": "18 years", "Years Context": "....cense required7 – 18 years LEED AP BD+C preferredEvidence of public recognition of expertise preferred (e.g. articles, confere....", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3453604138", "URL": "https://www.linkedin.com/jobs/view/3453604138/", "Job Title": "Senior Structural Engineer", "Company": "Metromont", "Description": "\nApplication_instructions: \nWould you like to be part of a family who loves to take on exciting challenges? Metromont Corporation has been one of the leaders in the construction industry for nearly a century and is currently accepting resumes for Senior Structural Engineer to be part of our dynamic team! This position opening is to be located at our Hiram, GA location. \nMetromont was founded in 1925 on the principles of faith, honor, and passion, and many years later, those values are still the foundation of who we are and everything we do. A third-generation company with nearly 1,500 associates across six manufacturing facilities in South Carolina, Georgia, Florida, and Virginia, Metromont is a leader and pioneer in the engineering and manufacturing of precast concrete. Most of all, we’re a trusted partner, working side-by-side with our customers from the earliest stages of project design through turnover of the completed structure. In addition to the production of precast concrete, Metromont provides our customers with complementary design and engineering, hauling, erection, and field services to support their full construction needs. Across the eastern seaboard, the southeast, and even as far west as Arizona, our customers rely on us to provide innovative precast solutions and the best quality for their parking structures, data centers, multifamily housing, office buildings, warehouses, schools, and stadiums. And we do, because a trusted partner is who we are – and who we’ve been for nearly a century. \n Position Purpose: This position includes senior-level structural engineers with PE certification who provide leadership, training, industry experience, and technical expertise. The Senior Structural Engineer has the ability to take on technically complicated, complex projects.Resonsibilities:Perform engineering calculations and details for all products and connections.Independently perform lateral analysis and design; troubleshoot and check laterals.Lead project teams.Independently manage engineering design aspects of a project with minimal assistance or guidance.Review contract documents to be familiar with project requirements.Attend project meetings and lead coordination meetings.Write and review complex requests for information (RFI).Resolve design issues independently and assist others with solving engineering design related problems.Serve as point of contact for Metromont engineers and subcontractors for resolution of more complicated technical questions and problems.Check engineering design calculations and details of others including that of external consultants for accuracy, efficiency, and adherence to Metromont standards and Engineering Design Process.Review erection drawings, master shop tickets, and any additional shop tickets to ensure designs and standards are followed.Aware of production through regular plant visits and participation in plant meetings relevant to assigned projects.Become licensed in states where engineering work is performed and, when assigned, reviews and stamps erection drawings, calculations, and repair details.Evaluate design cost as compared to estimate and take appropriate action.Complete repairs without assistance.May be an active participant in external industry organizations such as PCI and ACI.Participate in pre-sale engineering design processes as requested by the sales department.Must adhere to all Metromont and OSHA safety rules and regulations.\nCharacteristics:\n7+ years of relevant engineering experience – internal or externalPrevious precast concrete engineering design knowledge preferredHighly dependable with strong work ethicEager to learnAble to work individually or on a teamStrongly values relationships and interaction with peopleMaintains a balanced perspective about change; adapts when necessary while placing value in consistency of processesPositive outlookComputer skills (experience with engineering design software preferred)Analytical thinker with above average problem-solving skillsAttention to detail and accuracyStrong personal organization skillsAbove average ability to manage multiple prioritiesSelf-motivatedValues teaching and demonstrates a willingness to develop othersDemonstrated ability to managed multiple projects and priorities, maintain project schedules, and work effectively within a project teamAbove average assertiveness; proactively addresses project issuesStrong communication skillsAble to document ongoing information on projects for record keeping purposesAble to adapt to changes in work schedules, tasks, or processesValues and demonstrates safe working behaviors\nHow do we take care of you?\nBenefits:\navailable on your first day of employment\n?MedicalRxDentalVision InsuranceTelehealthHealth Savings Account\navailable 3-6 months\n\nWellness Program to support employee health401K with company matchPaid Vacation7 paid holidaysSafety Shoe voucher - $150Continuing Education Program \n\n \nEducation:BS Civil Engineering required; structural emphasis preferredPE Certification required \n\nMetromont Corporation (Company) is an equal opportunity employer. The Company is committed to the spirit and letter of all federal, state and local laws and regulations pertaining to equal opportunity. To this end, the Company does not discriminate against any individual with regard to race, color, religion, sex, gender identity, sexual orientation, pregnancy (including medical needs due to pregnancy, child birth or other medical conditions), national origin, age, disability, genetic information, veteran status, or other protected status. This Policy extends to all terms, conditions and privileges of employment, as well as the use of all Company facilities.\nThe Company is also committed to making reasonable accommodations based on an individual’s disability, religion, pregnancy, childbirth and related medical conditions (including, but not limited to, lactation), or any other protected status where a reasonable accommodation is required under the law.\nNo form of unlawful discrimination, unlawful harassment, unlawful refusal to reasonably accommodate or unlawful retaliation will be tolerated.\nEqual Opportunity Employer/Protected Veterans/Individuals with Disabilities\nThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)\n", "Years Experience": "7+ years", "Years Context": "....nd passion, and many years later, those values are still the foundation of who we are and everything we do. A third-generation....\n....7+ years of relevant engineering experience – internal or externalPrevious precast concrete engineering desi....", "Skills": "aws(1)"}, {"Date Added": "01/25/2023", "Job ID": "3449532794", "URL": "https://www.linkedin.com/jobs/view/3449532794/", "Job Title": "SRE –Site Reliability Engineering Database Architect - Full-time role", "Company": "Photon", "Description": "Greetings everyone,I hope you are staying safe. We are hiring a SRE –Site Reliability Engineering Database Architect - Full-time role to join our Digital Engineering team.\nWho are we?For the past 20 years, we have powered many Digital Experiences for the Fortune 500. Since 1999, we have grown from a few people to more than 4000 team members across the globe that are engaged in various Digital Modernization. For a brief 1 minute video about us, you can check https://youtu.be/uJWBWQZEA6o.\nSRE –Site Reliability Engineering Database Architect - Full-time role Location: - Atlanta, GA\n\nMust have skills· Database performance tuning · Understand how MongoDB and Cosmos DB perform and scale· Experience in High Availability Architecture\nCritical Readiness JOB Description Resource we are looking for should be Super Good. Qualified candidates should have database and architecture background as well as SRE experience.List of important keywords to look for people’s profile:Oracle, MySQL, Postgre, PerconaSRE –Site Reliability EngineeringPerformance engineering, Load Testing, Stress TestingScalability, availability, resiliency, Performance tuning, Troubleshootingtools: Datadog, AWR, Oracle enterprise manager, MySQL enterprise monitorLog Analytics: Splunk, ELFHigh Availability, active-active, active-passive, failover, high throughput, mission critical application(internal note: Data Model, data analytics, data warehouse (OLAP) wouldn’t fit", "Years Experience": "20 years", "Years Context": "....e we?For the past 20 years, we have powered many Digital Experiences for the Fortune 500. Since 1999, we have grown from a few....", "Skills": "git(3)\nMongo(1)\nMySQL(2)"}, {"Date Added": "01/25/2023", "Job ID": "3424196598", "URL": "https://www.linkedin.com/jobs/view/3424196598/", "Job Title": "Part Time Store Associate", "Company": "Bed Bath & Beyond", "Description": "Our mission at Bed Bath & Beyond, Inc is to make it easy for our customers and our associates to ‘feel at home’ across all of our retail brands.\nWhether you’re working at Bed Bath & Beyond, a buybuyBaby or a Harmon store, our Retail Associate positions are responsible for exceeding our customers’ evolving expectations by providing “best in class” customer service and a pleasant and fulfilling shopping experience. Successful candidates will be given the opportunity to offer our customers wide range of quality products and goods. We offer associate discounts, flexible schedules, ongoing training, and the potential for advancement.\nFull-Time and Part-Time Retail Associate positions are available\nRetail Associates positions will be cross trained in the following areas:Sales / Stock Associate:Engage with customers to determine their needs and direct them to the appropriate merchandiseProvide a positive customer experience which includes a strong understanding of product knowledge while offering additional goods and servicePerform a wide variety of tasks in the Receiving Department, including verifying shipments, processing damages, and completing daily stock replenishmentCashier:Ensure an accurate, timely and friendly checkout while assisting our customers to have a positive experienceFulfillment Associate:Receive and stock inventoryFulfill customer orders and oversee curbside pick-upsAssist and satisfy the needs of our in-store and online customers\nPlease note that Retail Associates may perform additional duties as required including, but not limited to, general maintenance such as daily front-end presentation (cleaning exterior and interior windows, doors and surfaces), stocking, cart retrieval and break room/restroom housekeeping. May require the use of ladders to move merchandise or complete other tasks needed to access areas and work safely. May require lifting/moving up to 40 pounds.\nBenefits\nEmployee discount of 25% off total @ Bed Bath & Beyond concepts purchases (Harmon, Bed Bath & Beyond, and Buy Buy Baby)Medical, Dental and Vision Benefits – options for both Full-Time and Part-Time AssociatesPaid time-off for Full-Time AssociatesA fun and engaging work environment that prides itself on employee training and development\nRequirements/Qualifications\nMust be flexible to adjust tasks and priorities when necessary to meet business needsStrong communication and customer service skillsPositive and welcoming attitudeAbility to learn how to use common retail technology, such as scanners, Point of Sale systems, smart phones and tablets\nIf you need reasonable accommodations to complete the on-line application, please contact the People & Culture Department.\nPhone: 1-844-MYHRSC1\nEmail: myHRSC@bedbath.com\nThis email address is only to request reasonable accommodation for the application process due to a medical condition. If you do not need a reasonable accommodation for such reason, please use the apply button below to complete an application and upload your resume.\nAn Equal Opportunity Employer\nIt is the policy of Bed Bath & Beyond Inc. to recruit, hire, train, promote, transfer and compensate our associates and provide all other conditions of employment including Company sponsored events without regard to race, color, creed, religion, national origin, age, sex, gender identity, genetic information, marital status, lawful alien status, sexual orientation, physical or mental disability, citizenship status, veteran status, employment status or any other basis prohibited by applicable law.", "Years Experience": "", "Years Context": "", "Skills": "front-end(1)"}, {"Date Added": "01/25/2023", "Job ID": "3453899471", "URL": "https://www.linkedin.com/jobs/view/3453899471/", "Job Title": "Application Engineer - Semiconductor Fab", "Company": "Solvay", "Description": "Solvay is a science company whose technologies bring benefits to many aspects of daily life. Our purpose—we bond people, ideas and elements to reinvent progress—is a call to go beyond, to reinvent future forms of progress and create sustainable shared value for all through the power of science. In a world facing an ever-growing population and quest for resources, we aim to be the driving force triggering the next breakthroughs to enable humanity to advance while protecting the planet we all share.\n\nWe bond with customers and partners to address today and tomorrow’s megatrends. As a global leader in Materials, Chemicals and Solutions, Solvay brings advancements in planes, cars, batteries, smart and medical devices, water and air treatment, to solve critical industrial, social and environmental challenges. You can count on our innovative solutions to contribute to safer, cleaner and more sustainable future.\n\nImportant EEO information related to opening in the US\nSolvay is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other legally protected characteristics. Click on the links to read \"The EEO is the Law\" poster and the “EEO is the Law” poster Supplement.\nWe will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. For more information, please click here.\nSolvay is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to humanresources.na-us@solvay.com and let us know the nature of your request and your contact information.\nRole Overview\nWe are looking for:\nThe Applications Engineer (Semicon) sits within our Customer Technical Development function within Solvay Specialty Polymers and designed to provide strong technical expertise and value to our customers by leveraging the entire product portfolio, resources, and know-how of the GBU.Solvay Specialty Polymers is looking for creative, curious self-starters and leaders interested in non-routine challenges to join the Technical Development team and support semiconductor applications in North America.You will be responsible for providing technical application development expertise to customers and will interact with the internal organization (commercial teams, application development team, R&D, Manufacturing, etc.) to develop total customer solutions.\n\nWe count on you for:\nYou will work directly with customers in collaboration with the sales and marketing to identify & develop application opportunities where Solvay’s specialty polymers add value and solve customer problems.Elicit a complete set of customer requirements and develop the value proposition of Solvay materials.Work directly with the Global CTD community and our Research and Development teams, to lead the development and implementation of solutions for customer applications. This includes polymer material recommendation and validation, design support for metal to plastic conversion, prototyping support, tooling design recommendations, testing, and processing assistance. Provide technical training and literature for both internal and external use about designing with polymers, polymer selection, polymer processing, simulation and prototyping.Champion sustainability solutions.Collaboratively interact and share expertise with the global CTD team, and create technical marketing literature.\n\nYou can count on us for:\nLong-lasting excellent customer relations, self-dependent working, and a variety of tasks in one of the world’s leading chemical companies.Excellent training & development possibilities.You will acquire dynamic market knowledge and competitive landscape understanding.\n\nYou will bring:\nEducation & Experience \nBachelor degree in Mechanical Engineering, Chemical Engineering, Material Science, or equivalent applicable technical degree5+ years of experience in a technical position working with polymers: knowledge of polymer physics, material selection, and processingExperience in semiconductor applications/customers/tiersMechanical aptitude, experience in part and tooling design and failure analysis \n\nSkills\nHands-on experience working with polymers in a manufacturing environment (extrusion, injection molding, compression molding)Ability to execute projects with short life cyclesDemonstrated ability to work independently and effectively to build deep relationships with both external customers and within a global Solvay teamStrong communication skills & customer-focus\n\nDesired behaviors \nStrong analytical and problem-solving skills, technically-orientedExcellent communication skillsAbility to apply technical knowledge in a customer-facing and commercial environmentExcellent project management skillsData analysis, quantitative, qualitative\n\nYou will get:\nCompetitive salary - The U.S. base salary range reasonably expected to be paid for this position is $90,000 to $130,000. Since actual compensation packages are based on a variety of factors unique to each candidate we may ultimately pay more or less than the posted base salary range. Total compensation for this role also includes bonus and/or other incentives. Health insuranceLife insurance16 weeks of maternity/paternity and co-parenting leaveTraining platform for all employeesFree language courses (24 languages available)Solvay Shares Plan Free well-being sessions (physical and psychological)\n\nAdditional information:\nLocation(s): Alpharetta (Georgia, US)Willing and able to travel 50-60% of the time and have a flexible working schedule\n\n \n\nAdditional Information\nSolvay’s purpose is to bond people, ideas and elements to reinvent progress. We can only fulfill this purpose with a diverse workforce that feels respected and appreciated, and has equal opportunities to work, grow and thrive. Our differences, visible or not, are valued. As Solvay seeks to promote unity and not uniformity, we invite you - regardless of background, age, gender, race, national origin, ethnicity, religion, sexual orientation, ability or identity - to consider a future with us.\n\n\nImportant Important EEO information related to opening in the US \n\nSolvay is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other legally protected characteristics. Click on the links to read \"The EEO is the Law\" poster and the “EEO is the Law” poster Supplement.\n\n We will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. For more information, please click here.\n\n Solvay is committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to hrstaffingoffice.na-us@solvay.com or call 800-311-3555 and let us know the nature of your request and your contact information.\n\n", "Years Experience": "5+ years", "Years Context": "....e technical degree5+ years of experience in a technical position working with polymers: knowledge of polymer physics, material....", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3450540644", "URL": "https://www.linkedin.com/jobs/view/3450540644/", "Job Title": "Front End Engineer", "Company": "Dropbox", "Description": "Company Description\n Dropbox is a leading global collaboration platform that's transforming the way people work together, from the smallest business to the largest enterprise. With more than 700 million registered users across more than 180 countries, our mission is to design a more enlightened way of working. From our headquarters in San Francisco to eight dedicated Studios and a worldwide team of employees who choose where they work best, our Virtual First approach is leading the way into the future of work.\n Team Description\n ITS delivers business technology strategy and solutions to our Dropbox business partners so they can work confidently, move fast, and scale effortlessly. We aspire to be the connective tissue to the core business of Dropbox as a partner of choice that accelerates and simplifies outcomes. We source, build and implement the right technology solution, and fit it into exactly the right place so that everything meets the high bar that Dropboxers expect.\n \nRole Description\n\nWe are looking for a Front End Engineer with experience working on portal and other marketing technology implementations, with both functional and technical expertise. Functional end will include working with the stakeholders, gathering requirements and understanding the requirements from a functional perspective. Technical end will include understanding configurations, working on project delivery, developing enhancements and supporting the system from a technical perspective.\nResponsibilities\nThe Front End Engineer will be responsible for designing, coding and modifying websites, from both design and functional standpoints according to a stakeholders’ specifications. The right candidate will strive to create visually appealing sites that feature user-friendly design and clear navigation. The role will also be responsible for learning new technology as we acquire/build new applications in marketing landscape related to campaign, analytics, SEO and integrations.\nBuild easy-to-use, high-performance websites working with designers, website marketers and other groupsParticipate in the full development lifecycle, including estimation, design, development, testing, and deploymentReview and respond to operational issues, escalating as necessarySupport the development of other engineers through mentoring, code review, and knowledge sharingParticipate in the design and creation of scalable software solutions for marketing projectsCollaborate with other cross functional teams to drive long term strategic projects and OKRsBe comfortable leading small to medium sized projects from inception to deliveryGoes the extra mile - Candidate should always be looking to not only check the box but making sure the problems are solved by the rootSelf Driven - This doesn’t mean working alone but rather keep yourself unblocked. This can mean talking to more senior engineers when necessary or asking for more definition for productCustomer Focused - Be an advocate for listening to and learning from customers (both internal and external) in order to better solve their problems. \nRequirements\n In order for a candidate to be extended an offer, they must have all of the following . These will be strictly enforced by the Moderator during the debrief. Please rank in order of importance and write in a verifiable manner. \nIn depth knowledge of design principals and best practicesExcellent oral, written, and interpersonal communication skillsAbility to express ideas to both technical and non-technical individualsDemonstrated critical thinking skills, decision-making, and problem solving skillsProven experience in portal technologies like AEM (Adobe Experience Manager), DAM (Digital Asset Management) and CMS (Content Management System) is a mustHands on experience in web technologies, including HTML5, CSS, Vanilla Javascript, SQL, React/AngularWorking experience with Python would be a plusDevelopment experience in digital marketing areas like Campaign, Email Marketing, Analytics and Data and Personalization would be a plusBS (or higher) in Computer Science or related technical field involving coding, or equivalent technical experience\n\n\nTotal Rewards\n\n\nAt Dropbox, we strive to be a great place for all Dropboxers to grow and be recognized for that growth. This job posting reflects broad requirements, and represents two potential levels of role. Through our assessment process, we will identify your level that ties to compensation based on your experience and technical expertise along with the scope of the role. \nFor candidates hired in San Francisco metro, New York City metro, or Seattle metro, the expected salary/On-Target Earnings (OTE) range for the role is currently $138,600 - $163,000 - $187,500 if you are assessed at the IC3 level. If you are instead assessed at the IC4 level, the expected salary/On-Target Earnings (OTE) range for the role is currently $164,600 - $193,600 - $222,600. \nFor candidates hired in the following locations: Austin (TX) metro, Chicago metro, California (outside SF metro), Colorado, Connecticut (outside NYC metro), Delaware, Massachusetts, New Hampshire, New York (outside NYC metro), Oregon, Pennsylvania (outside NYC or DC metro), Washington (outside Seattle metro) and Washington DC metro, the expected salary/On-Target Earnings (OTE) range for the role is currently $124,700 - $146,700 - $168,700 if you are assessed at the IC3 level. If you are instead assessed at the IC4 level, the expected salary/On-Target Earnings (OTE) range for the role is currently $148,100 - $174,200 - $200,300. \nFor candidates hired in all other US locations, the expected salary/On-Target Earnings (OTE) range for this role is currently $110,800 - $130,400 - $150,000 if you are assessed at the IC3 level. If you are instead assessed at the IC4 level, the expected salary/On-Target Earnings (OTE) range for the role is currently $131,700 - $154,900 - $178,100. \nRange(s) is subject to change. Dropbox takes a number of factors into account when determining individual starting pay, including job and level they are hired into, location/metropolitan area, skillset, and peer compensation. Dropbox uses the zip code of an employee’s remote work location to determine which metropolitan pay range we use. \nSalary/OTE is just one component of Dropbox’s total rewards package. All regular employees are also eligible for the corporate bonus program or a sales incentive (target included in OTE) as well as stock in the form of Restricted Stock Units (RSUs).\n\n\n Dropbox is an equal opportunity employer. We are a welcoming place for everyone, and we do our best to make sure all people feel supported and connected at work. A big part of that effort is our support for members and allies of internal groups like Asians at Dropbox, BlackDropboxers, Latinx, Pridebox (LGBTQ), Vets at Dropbox, Women at Dropbox, ATX Diversity (based in Austin, Texas) and the Dropbox Empowerment Network (based in Dublin, Ireland).", "Years Experience": "", "Years Context": "", "Skills": "ios(1)\nFront End(2)\nexpress(1)\nAdobe(1)\ngit(2)\nHTML5(1)\nCSS(1)\nJavascript(1)\nSQL(1)\nReact(1)\nPython(1)"}, {"Date Added": "01/25/2023", "Job ID": "3140254376", "URL": "https://www.linkedin.com/jobs/view/3140254376/", "Job Title": "Server", "Company": "Invited", "Description": "Job Description\n\n At   ClubCorp   , work feels like play, as you build relationships with your team and meet Members from all different backgrounds. Every time you step foot in your Club, you can create magic moments and enrich lives. So, join us and be a part of a fun, fast-paced, high-impact group of talented people. We are passionate about bringing people together and about bringing out the very best in life. \n\nJob Summary\n\nA server is responsible for providing food and beverage service to Members and Guests while consistently displaying a positive attitude and knowledge about the food and beverage menu. Work closely and coordinate with other team members to ensure Member/Guest satisfaction and retention.This position reports directly to the FB Director, Service Director, and Banquet Manager with indirect reporting to the Private Events Director, Captain, and General Manager.\n\n DAY-TO-DAY \n Responsible for food and beverage service to Members and guests, adhering to the ClubCorp standards of service.  Comprehensive knowledge of the a la carte menu is mandatory, including daily features and specials that may not be available directly on the menu.As well as possess clear knowledge of all various liquors, beer and wines available at the Club.  Know Member names and greet them promptly while providing a warm welcome making them feel at home.  Ensure daily assignments and side work is complete in respective areas to meet Club standards.  Because of the fluctuating demands of the company’s operation, it may be necessary that each Employee Partner perform a multitude of different functions therefore, as an essential part of your position, you will be expected to help others when the occasion arises, just as other Employee Partners are expected to help you.Accordingly, you may be expected to perform other tasks as needed or as directed. \nAbout You\n A high school diploma preferred.  Previous Food and Beverage experience preferred.  Food Handler and Alcohol Server Certifications as required by State and City.  You have completed FB Service Training.  Excellent communication skills and articulate speech.  Ability to communicate and follow instructions.  You are comfortable working in both indoor and occasional outdoor environments. \n Have more questions?  Check out our ClubCorp Jobs website to get more details about ClubLife, the Employee Experience, Company Benefits, and Our Culture.\n\nBe a part of our Social Network: ClubCorp LinkedIn or ClubCorp Instagram .\n\n ClubCorp is an Equal Employment Opportunity Employer / ClubCorp participates in E-Verify  . This job post is intended to describe the general requirements for the position. It is not a complete statement of duties, responsibilities, or requirements. Other duties not listed here may be assigned as necessary to ensure the proper operation of the Club.", "Years Experience": "", "Years Context": "", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3424931535", "URL": "https://www.linkedin.com/jobs/view/3424931535/", "Job Title": "Senior Front-End Designer Developer-Supervising Associate-Various Locations (Digital Portfolio Req.)", "Company": "EY", "Description": "At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better, too. Join us and build an exceptional experience for yourself, and a better working world for all.\nSenior Front-End Designer Developer, Supervising Associate -Various Locations ( Atlanta, Alpharetta, Austin, Charlotte, Cleveland, Detroit, Houston, Minneapolis, Phoenix, Pittsburgh, St. Louis ) \nAs a member of our US Creative Services team, you’ll be joining a high performing in-house creative agency with a digital-first focus and a culture that is agile and inspires you to be your best self every day. On our highly collaborative team, you can combine your energy, vision, creative ideas and passion for continuous learning in a flexible, virtual, diverse work environment. You’ll be working across multiple industries developing innovative solutions that help drive our clients’ business in a world that never stands still.\nThe opportunity\nAs a senior front-end designer developer, you’ll be an innovative and strategic thinker responsible for user interface design, front-end and back-end development of websites and other interactive solutions, and maintenance and modification of existing sites. You’ll be responsible for the UI creation process including wireframing, mockups, and build-out of UI design into fully functional web pages and web applications. You’ll oversee multiple complex projects and virtual teams, from concept through production and delivery.\nYou’ll be part of an expansive and talented team working independently and collaboratively. You’ll be empowered to learn and grow together with other creative minds. Your contributions and ideas will be valued and heard, and you’ll have opportunities to innovate and take part in efforts that advance our creative team.\nYour Key Responsibilities\nYou can expect to draw on your creative thinking skills to provide consultation, ideation, innovative solutions and strategy to meet clients’ business objectives. You’ll work from project briefs to create and test applications to verify that they’re working effectively and meeting client expectations. You’ll develop and present basic wireframes or more complex UI prototypes and build-out user interfaces using CSS, HTML and JavaScript. You’ll build-out back-end logic, connecting to databases and services and test and debug for all browsers, platforms, and devices as required by clients’ objectives. You’ll produce utilities to reduce repetitive tasks and share knowledge with the team.\nSkills And Attributes For Success\nStrong leadership skills with the ability to model by exampleAbility to proactively foster exceptional client relationships to build trust and collaboration that leads to the co-development of new opportunitiesSound business acumen to fully comprehend stakeholders’ strategic vision and influence the development of the creative brief, which drives the storyAbility to develop training initiatives to improve overall team knowledge of web design and its processesAbility to create strategies to lead and drive innovation with new options made available by upcoming technologiesSuperb communication skills, active listening and diplomacy when working with internal team members and business partners\nTo qualify for the role, you must have\nBachelor's degree in web design/interactive media, graphic/digital design or related discipline or equivalent experienceEducation or proficiency in computer technology including HTML, CSS, JavaScript and C# programming language for page-level coding within ASP.NETEight-plus years of related interactive web design and development experienceCreative, digital portfolio demonstrating outstanding conceptual thinking and design skillsAdvanced knowledge and hands-on experience creating web sites using markup languages (HTML), style sheet languages (CSS, SASS), and front-end development languages (JavaScript)Proficiency in JavaScript frameworks (React, Angular, Vue); knowledge of server-side JavaScript development using node.js would be a plusExperience with a variety of content management systemsProficiency in SharePoint Framework (SPFx), building web parts and support client-side SharePoint development, integration with SharePoint data and PowerApps, Power BI and FlowProficiency in Adobe Creative Suite, Adobe XD or InVision, Microsoft Office 365 applications, Mac and Windows platformsExperience working in a fast paced, matrixed agency or in-house team environment developing a range of creative initiatives\nIdeally, you’ll also have\nExperience successfully mentoring and coaching creatives in web design principles and technical skills including critiquing projects and providing constructive feedback in a virtual environmentAbility to skillfully liaison between groups of people to bring positive solutions that meet business objectivesAdvanced problem-solving skills to identify, resolve and overcome challenges\nWhat We Look For\nEngaging communicators with executive presence and the ability to influence clients and colleagues to bring their creative vision to life. We welcome creative minds who thrive on continuous learning and have a passion for innovation.\nWhat We Offer\nWe offer a comprehensive compensation and benefits package where you’ll be rewarded based on your performance and recognized for the value you bring to the business. The salary range for this job in most geographic locations in the US is $83,000 to $150,700. The salary range for New York City Metro Area, Washington State and California (excluding Sacramento) is $99,600 to $171,200. Individual salaries within those ranges are determined through a wide variety of factors including but not limited to education, experience, knowledge, skills and geography. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances. You’ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being.\nContinuous learning: You’ll develop the mindset and skills to navigate whatever comes next.Success as defined by you: We’ll provide the tools and flexibility, so you can make a meaningful impact, your way.Transformative leadership: We’ll give you the insights, coaching and confidence to be the leader the world needs.Diverse and inclusive culture: You’ll be embraced for who you are and empowered to use your voice to help others find theirs.\nIf you can demonstrate that you meet the criteria above, please contact us as soon as possible.\nThe Exceptional EY Experience. It’s Yours To Build.\nEY | Building a better working world\nEY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets.\nEnabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate.\nWorking across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today.\nEY is an equal opportunity, affirmative action employer providing equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, national origin, protected veteran status, disability status, or any other legally protected basis, including arrest and conviction records, in accordance with applicable law.\nEY is committed to providing reasonable accommodation to individuals with disabilities. If you are a qualified individual with a disability and either need assistance applying online or need to request an accommodation during the interview process, please call 1-800-EY-HELP3, type Option 2 (HR-related inquiries) and then type Option 1 (HR Shared Services Center), which will route you to EY’s Talent Shared Services Team or email SSC Customer Support at ssc.customersupport@ey.com.", "Years Experience": "", "Years Context": "....in ASP.NETEight-plus years of related interactive web design and development experienceCreative, digital portfolio demonstrati....", "Skills": "Front-End(1)\ngit(3)\nfront-end(3)\nCSS(3)\nHTML(3)\nJavaScript(5)\nReact(1)\nnode(1)\nAdobe(2)\nexpress(1)"}, {"Date Added": "01/25/2023", "Job ID": "3452703068", "URL": "https://www.linkedin.com/jobs/view/3452703068/", "Job Title": "Engineer", "Company": "Sonesta Hotels", "Description": "Job Description Summary\nThe Engineer performs general maintenance work to ensure hotel physical plant quality and safety standards are achieved and maintained. The Engineer takes care of the building, equipment and grounds of the hotel. This position will perform maintenance and repairs, and preventative maintenance, to all areas of the hotel.\nJob Description\nWork Environment \nInterior and exterior of building with potential for guest facing contact.Exposure to extreme temperatures inside and outside of the building.\nPhysical Demands\nMust be able to exert in excess of 100 pounds of force occasionally, and/or in excess of 50 pounds of force frequently and/or in excess of 20 pounds constantly to lift, carry, push, pull, or otherwise move objects.Frequent bending, kneeling, climbing, stooping and reaching.Ability to stand during entire shift.\nExpected Hours of Work \nMust be flexible to work variable days of the week to include weekends and holidays.Must be flexible to work variable shifts (days, nights, overnights).Ten to twelve hour shifts sometimes required.\nEducation And Experience\nSpecialized knowledge and skills or certification within a field or discipline such as plumbing, electrician, carpentry, equipment mechanics, HVAC, refrigeration, etc.Trade school and/or college course work in related field preferred.Experience in a hotel or a related field preferred. \nPrinciple duties and responsibilities (Essential Functions) include: \nPerform general maintenance and repairs for assigned area of expertise such as the interior and exterior of buildings, hotel rooms and contents, laundry and kitchen/refrigeration equipment, lighting, heating, air conditioning (HVAC), ventilation, water treatment systems, and swimming pool, etc. Perform preventative maintenance on a regular basis and ensure that assigned equipment is maintained and operational.Adhere to federal, state and local safety regulations, brand standards and other compliance requirements. Report all unsafe conditions or malfunctioning equipment to supervisor. Follow procedures that ensure the security of inventory and assets such as tools, supplies, equipment, furniture, televisions, etc.Replenish supplies and inventory in a timely and efficient manner and minimizes waste. Take required readings on equipment.Replace and program televisions as needed.Replace light switches, receptacles, light bulbs and fixtures.Paint designated areas and perform plumbing repairs (i.e. clogged drains, copper pipe, change washers, change handles, drain fittings, etc).Understand and be able to read blueprints and wiring diagrams.Refurbish furniture and fixtures and repair all types of wall coverings.Repair and program hotel electronic lock system.Deal with reasonable complaints/requests with professionalism and patience.Display professional appearance and demeanor at all times.Attend departmental pre-shift and mandatory meetings.Perform other duties as requested by management.\nQualifications And Skills\nAttentive, friendly, helpful and courteous to all guests, managers and fellow employees.Ability to prioritize and multitask.Excellent organizational skills and attention to detail.Reading and writing abilities are utilized in order to document or record all tasks completed, to order supplies, to receive instructions for the day and/or to read equipment repair manuals.Mathematical skills, including basic math, percentages, quantities, and variances.Professional verbal communication skills.Excellent interpersonal and customer service skills.Prioritization and time management skills.\nGo Beyond @SonestaHotels\nWho We Are\nWe are an organization made up of people, thoughts and ideas – all working towards fulfilling our simple mission: To wow every guest, team member, partner & community we operate in by delivering quality, value & amazing hospitality.\nWe will achieve our mission by being passionate about exceeding expectations - by being persistent, resilient, and constantly seeking new and creative ways to succeed. Doing the Right Thing and Going Beyond are our principles that guide everything we do.\nWe are an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status, or any other characteristic protected by local, state, or federal laws, rules, or regulations.\nThe statements in this job description are intended to represent the key duties and level of work being performed. They are not intended to be ALL responsibilities or qualifications of the job. This job description is subject to change at any time.\nBenefits\nAdditional Job Description\nSonesta recognizes that benefits play a vital role in helping ensure the health and financial security of employees and their families. We offer a variety of benefits to our employees including:\nMedical, Dental and Vision InsuranceHealth Savings Account with Company Match401(k) Retirement Plan with Company MatchPaid Vacation and Sick DaysSonesta Hotel DiscountsEducational AssistancePaid Parental LeaveCompany Paid Life InsuranceCompany Paid Short Term and Long Term Disability InsuranceVarious Employee Perks and Discounts\nUpon submitting your application, please ensure you complete a full application in addition to attaching a resume. Incomplete applications received will not be considered.", "Years Experience": "", "Years Context": "", "Skills": "aws(1)"}, {"Date Added": "01/25/2023", "Job ID": "3245808138", "URL": "https://www.linkedin.com/jobs/view/3245808138/", "Job Title": "Senior Building Envelope Engineer / Architect / Consultant", "Company": "NOVA Engineering and Environmental, LLC", "Description": "NOVA Engineering’s Kennesaw, GA office is looking for a Senior Facilities & Building Envelope Consultant with 10+ years experience in the building enclosure, property condition assessment & roofing industry. Our group is experiencing tremendous growth and we need an additional Senior Consultant to help with technical oversight and management of projects. This person can be an architect, engineer, or senior consultant.\n\nResponsibilities will include:\n\nManagement / technical oversight of building envelope/facilities and roofing projectsMentor staff, help with proposals, and serve as a senior technical reviewerDaily client management and correspondencePlanned growth of the service line throughout GeorgiaDesired Experience / Skills:\n\nEducational background in architecture, engineering, and/or historic preservation preferred.Licensed Engineer or Architect is preferred, but not required.10+ years of industry experience and must be proven client manager capable of becoming a senior reviewer.Competent in identifying and solving constructability, integration, design, troubleshooting, durability, continuity, structural behavior, thermal property evaluation, ADA Compliance, sustainability, and maintenance/ operation of building envelopes/roofing systems.The following certifications are a huge plus: Registered Roof Consultant (RRC), Registered Waterproofing Consultant (RWC), Registered Roof Observer (RRO), Certified Infrared Thermographer (CIT)NOVA is an Equal Opportunity Employer. All qualified candidates are encouraged to apply. NOVA does not discriminate on the basis of race, religion, color, sex, gender identity, sexual orientation, age, disability, national origin, ancestry, marital status, veteran status or any other characteristic protected by law.\n\n\n\n", "Years Experience": "10+ years\n10+ years", "Years Context": ".... Consultant with 10+ years experience in the building enclosure, property condition assessment & roofing industry. Our group i....\n....but not required.10+ years of industry experience and must be proven client manager capable of becoming a senior reviewer.Comp....", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3359359867", "URL": "https://www.linkedin.com/jobs/view/3359359867/", "Job Title": "Network Engineer (Meraki/Wireless/Cisco)", "Company": "CyberCoders", "Description": "If you are a Network Engineer CCIE/CCNP with Cisco experience, please read on!\n\nLocated Yakima, WA (100% REMOTE)\n\nWe provide services to hundreds of thousands of patients across Oregon and Washington as a Medical Home With integrated services including medical, dental, pharmacy, orthodontia, primary care nutritional counseling, autism screening, and primary care behavioral health - come join us as a strong Network Engineer and make a difference in the lives of people who need others to stand up for them!\n\nTop Reasons to Work with Us\n Operate under common core values Above average compensation Strong Commitment for work life balance Fully Remote!\nWhat You Will Be Doing\n Design, maintain the enterprise network infrastructure Senior in network infrastructure-related work\nWhat You Need for this Position\n 6+ years professional experience as a Network Engineer BSIT/CS related experience with MPLS and QOS/Shaping experience with Palo Alto Firewall or Cisco NGFW experience with Good Routing (BGP) experience with Wireless (Cisco 9800 VM, 9120AX Aps) experience with Meraki: MX, MS, MR BSIT/CS related (industry experience fine) CCIE/CCNP\nWhat's In It for You\n Full Benefits: Medical, Dental, & Vision Employee Health Insurance: Pays 100% for employee and a portion of dependent premiums HSA, DCFSA, Group Term Life Insurance, AD&D, Term Life, Short Term Disability, LT Disability Profit Sharing 401(a), Tax Sheltered Annuity 403(b) Paid Holidays, PTO, Sick Pay, Bereavement Leave Jury Duty Leave, EAP, Malpractice insurance HUGE room for growth!\nBenefits\n Vacation/PTO Medical Dental Vision 401k Bonus\nSo, if you are a Network Engineer CCIE/CCNP Remote with experience, please apply today!\n\nColorado employees will receive paid sick leave. For additional information about available benefits, please contact Chad Vasquez\n\nEmail Your Resume In Word To\n\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\n\nChad.Vasquez@CyberCoders.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : CV6-1700516 -- in the email subject line for your application to be considered.***\nChad Vasquez - Lead Recruiter - CyberCoders\n\nApplicants must be authorized to work in the U.S.\n\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n\nYour Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\n\n", "Years Experience": "6+ years", "Years Context": ".... 6+ years professional experience as a Network Engineer BSIT/CS related experience with MPLS and QOS/Shaping ....", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3449532794", "URL": "https://www.linkedin.com/jobs/view/3449532794/", "Job Title": "SRE –Site Reliability Engineering Database Architect - Full-time role", "Company": "Photon", "Description": "Greetings everyone,I hope you are staying safe. We are hiring a SRE –Site Reliability Engineering Database Architect - Full-time role to join our Digital Engineering team.\nWho are we?For the past 20 years, we have powered many Digital Experiences for the Fortune 500. Since 1999, we have grown from a few people to more than 4000 team members across the globe that are engaged in various Digital Modernization. For a brief 1 minute video about us, you can check https://youtu.be/uJWBWQZEA6o.\nSRE –Site Reliability Engineering Database Architect - Full-time role Location: - Atlanta, GA\n\nMust have skills· Database performance tuning · Understand how MongoDB and Cosmos DB perform and scale· Experience in High Availability Architecture\nCritical Readiness JOB Description Resource we are looking for should be Super Good. Qualified candidates should have database and architecture background as well as SRE experience.List of important keywords to look for people’s profile:Oracle, MySQL, Postgre, PerconaSRE –Site Reliability EngineeringPerformance engineering, Load Testing, Stress TestingScalability, availability, resiliency, Performance tuning, Troubleshootingtools: Datadog, AWR, Oracle enterprise manager, MySQL enterprise monitorLog Analytics: Splunk, ELFHigh Availability, active-active, active-passive, failover, high throughput, mission critical application(internal note: Data Model, data analytics, data warehouse (OLAP) wouldn’t fit", "Years Experience": "20 years", "Years Context": "....e we?For the past 20 years, we have powered many Digital Experiences for the Fortune 500. Since 1999, we have grown from a few....", "Skills": "git(3)\nMongo(1)\nMySQL(2)"}, {"Date Added": "01/25/2023", "Job ID": "3453684756", "URL": "https://www.linkedin.com/jobs/view/3453684756/", "Job Title": "Sr Cisco Network Engineer", "Company": "Dice", "Description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, ABF, LLC, is seeking the following. Apply via Dice today!\nRole: Cisco Network Engineer\nLocation: Atlanta, GA – Onsite\nDuration: 6+ months\nMOI: 1 video round and select\nNeed someone who can set up Cisco DNA and CSPC and who has done that.\nCisco DNA set-up and CSPC (Common Service Platform Collector) - provided by Dice", "Years Experience": "", "Years Context": "", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3452701724", "URL": "https://www.linkedin.com/jobs/view/3452701724/", "Job Title": ".NET Lead Developer", "Company": "Dice", "Description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Photon Infotech, is seeking the following. Apply via Dice today!\nNET Lead Developer\nAtlanta, GA / Dallas, TX\nA total of 9+ years of experience showing career progression from Software Engineer to the Lead level position.\nAt least 6 years of experience as a Tech Lead focusing on building APIs and integration layer.\n5 years or more experience building REST Based API using .NET Web API\nAt least 3 years of experience with the latest .NET Frameworks such as .NET 3.1 and .NET 6.\nExperience in using the design patterns in the system and Solid principles\nDeveloping and deployment of various Azure Functions and App Services\nAt least recent 3 years of experience building applications using Azure Platform\nHands-On experience in building Microservices using Azure Cloud Services such as Azure SQL, Azure Storage, Azure Cosmos, Azure Redis or Azure Event Hub.\nExperience in Azure Service Bus and Event Grids\nExperience with NuGet dependency management for building microservices.\nHands on experience in developing xUnit or NUnit test cases with mocking frameworks such as Moq and AutoFac or NSubstitute, and experience is using Fluent validation\nUnderstanding Azure API Gateway and Azure APIM\nKnowledge on creating the policies on APIM\nExperience is creating resources using ARM templates\nUnderstanding on deploying microservices in the Azure Environments.\nUnderstanding on building highly available applications using Azure Fabrics or AKS\nAt least 2 years of experience with SSO integration with REST Based API with major IAM provider such as ForgeRock, Ping Identity or Okta\nUnderstanding of Auth Token consumption such as OAUTH, SAML, or JWT Token\nExperience is Azure DevOps, such as building the pipeline and releases\n provided by Dice", "Years Experience": "9+ years\n6 years\n5 years\n3 years\n3 years\n2 years", "Years Context": "....A total of 9+ years of experience showing career progression from Software Engineer to the Lead level position.....\n....At least 6 years of experience as a Tech Lead focusing on building APIs and integration layer.....\n....5 years or more experience building REST Based API using .NET Web API....\n....At least 3 years of experience with the latest .NET Frameworks such as .NET 3.1 and .NET 6.....\n....At least recent 3 years of experience building applications using Azure Platform....\n....At least 2 years of experience with SSO integration with REST Based API with major IAM provider such as ForgeRock, P....", "Skills": "SQL(1)"}, {"Date Added": "01/25/2023", "Job ID": "3363428844", "URL": "https://www.linkedin.com/jobs/view/3363428844/", "Job Title": "Mid-Level .Net Developer", "Company": "Perficient", "Description": "Overview\n\nAt Perficient you’ll deliver mission-critical technology and business solutions to Fortune 500 companies and some of the most recognized brands on the planet. You will do it with cutting-edge technologies, thanks to our close partnerships with the world’s largest solution providers. Our network of offices across North America, Latin America, India, and China, will give you the opportunity to spread your wings and work with global teams\n\nPerficient currently has a career opportunity for a Mid Level .Net Developer in our national Commerce Practice This resource will be developing on several leading .NET platforms for our predominantly B2B client base, along with other opportunities to work on various eCommerce initiatives within our practice.\n\nThe candidates’ primary responsibility will be to develop and successfully implement .Net eCommerce and PIM solutions over multiple projects. This includes defining and developing functional requirements, technical design, development, deployment, testing & training. This person should be comfortable working in a challenging and fast-paced environment while working independently as well as part of a team.\n\nOur national Commerce Practice team is comprised of passionate and capable strategists, architects, project managers, business analysts, developers, and infrastructure specialists who specialize in the designing and implementing of industry leading eCommerce solutions. We deliver on the promise of a unified digital transformation and ecommerce experience, through strategic discussion aligned to client business needs. We use an agnostic approach with a deep portfolio of options to address all levels of digital maturity. We are experts on the leading Commerce and Order Management platforms including HCL Commerce, Adobe Commerce (Magento), Optimizely, SAP Commerce, InRiver PIM, Akeneo PIM, and IBM Sterling OMS.\n\nWe are proud to be publicly recognized as a “Top Workplace” year after year as well as have received Vendor Partner awards. This is due, in no small part, to our entrepreneurial attitude and collaborative spirit that sets us apart and keeps our colleagues impassioned, driven, and fulfilled.\n\nMore about us: https://www2.perficient.com/Commerce-Careers/\n\nResponsibilities\n Developing and unit testing of code components per the user story  Estimating project development efforts and unit testing efforts  Participate in the creation of the WBS and backlog per sprint and assist PM in project planning  Contribute to the resolution of all requirements/feedback/scoping/design issues or questions directly with the clients  Engage in the process of developing technical documentation efforts and creation of user stories utilizing JIRA  Participate in code audits and reviews as required  Ensure implementation, deployment, and backup is done following Perficient standards  Able to understand unique business and technical requirements of the engagement and facilitate communications on the most appropriate solution design  Collaborate on the design and development of the appropriate solution with project lead and Architect  Demonstrate respect for and responsiveness to our clients and colleagues  Independently manage assigned tasks  Understand Cloud framework, dev and deployment strategy (as most platforms are now cloud hosted)  Attend stand-up meetings and report technical blockers to the project lead  Attend sprint planning and retrospective meetings  Interact with clients and Global Teams \nQualifications\n Passionate coder with at least 3 years of C# and .NET software application development experience  Experience with utilization of web services/APIs, consuming JSON/XML data (third party integrations)  Experience with other technologies (SQL, .NET Core, React, Angular, Typescript, etc..) a plus  Full life-cycle development experience – Agile/Scrum project approach  Knowledge of version control systems, web development experience  Experience with estimating and project planning preferred  Solid foundation in Computer Science, with strong competencies in data structures, algorithms and software design  Exposure or experience with PIM, MDM, PLM or other related systems are a bonus  Strong written and verbal communication skills  Strong attention to detail  Strong analytical and problem-solving skills  Exhibits personal responsibility  Ability to work collaboratively with other development team members as well as customers  Experience working in a multi-client setting highly preferred \nPerficient full-time employees receive complete and competitive benefits. We offer a collaborative work environment, competitive compensation, generous work/life opportunities and an outstanding benefits package that includes paid time off plus holidays. In addition, all colleagues are eligible for a number of rewards and recognition programs including billable bonus opportunities. Encouraging a healthy work/life balance and providing our colleagues great benefits are just part of what makes Perficient a great place to work.\n\nWho We Are\n\nPerficient is a leading global digital consultancy. We imagine, create, engineer, and run digital transformation solutions that help our clients exceed customers’ expectations, outpace competition, and grow their business. With unparalleled strategy, creative, and technology capabilities, our colleagues bring big thinking and innovative ideas, along with a practical approach to help our clients – the world’s largest enterprises and biggest brands succeed.\n\nWhat We Believe\n\nAt Perficient, we promise to challenge, champion, and celebrate our people. You will experience a unique and collaborative culture that values every voice. Join our team, and you’ll become part of something truly special.\n\nWe believe in developing a workforce that is as diverse and inclusive as the clients we work with. We’re committed to actively listening, learning, and acting to further advance our organization, our communities, and our future leaders… and we’re not done yet.\n\nPerficient, Inc. proudly provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, national origin, age, disability, genetic information, marital status, amnesty, or status as a protected veteran in accordance with applicable federal, state and local laws. Perficient, Inc. complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including, but not limited to, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training. Perficient, Inc. expressly prohibits any form of unlawful employee harassment based on race, color, religion, gender, sexual orientation, national origin, age, genetic information, disability, or covered veterans. Improper interference with the ability of Perficient, Inc. employees to perform their expected job duties is absolutely not tolerated.\n\nDisability Accommodations\n\nPerficient is committed to providing a barrier-free employment process with reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or accommodation due to a disability, please contact us.\n\n Disclaimer:  The above statements are not intended to be a complete statement of job content, rather to act as a guide to the essential functions performed by the employee assigned to this classification. Management retains the discretion to add or change the duties of the position at any time.\n\nSelect work authorization questions to ask when applicants apply\n Are you legally authorized to work in the United States? Will you now, or in the future, require sponsorship for employment visa status (e.g. H-1B visa status)?\n", "Years Experience": "3 years", "Years Context": "....as a “Top Workplace” year after year as well as have received Vendor Partner awards. This is due, in no small part, to our en....\n....oder with at least 3 years of C# and .NET software application development experience  Experience with utilization of web serv....", "Skills": "git(4)\nAdobe(1)\nSQL(1)\nReact(1)\naws(2)\nexpress(1)"}, {"Date Added": "01/25/2023", "Job ID": "3363427467", "URL": "https://www.linkedin.com/jobs/view/3363427467/", "Job Title": "Security Engineer", "Company": "ON24", "Description": "Description\n\nON24 is on a mission to transform the way marketers’ market, powering the live, always-on and personalized experiences that businesses need to create engagement, deliver data, find demand and drive revenue. Through the ON24 Platform, marketers can build data-rich, interactive webinars and content experiences, understand audience behavior and turn that intelligence into action. Informed by more than a billion engagement minutes -- including 12 million polls, 1.3 million surveys, 1.5 million conversations, and conversion of over 17 million resources -- marketers drive more revenue from ON24 experiences than any other digital channel. Headquartered in San Francisco, ON24 has a wide global footprint with offices in key regions, including London, Singapore, and Sydney.\n\nRole Overview\n\nThe Security Engineer will be a critical member of ON24’s information security team where they will contribute to safeguarding customer, employee, and company data in accordance with industry standards for a global enterprise SaaS company.\n\nYou will engineer security solutions, evaluate and implement related technologies, and perform security monitoring and incident response functions.\n\nResponsibilities\nPerform infrastructure and Cloud security design and architecture reviews.Determine security requirements, related procedures, and define security controls.Perform vulnerability assessments and maintain vulnerability management tools/processes.Contribute to hardening standards and configuration guidelines.Evaluate, implement, and maintain new security products/solutions.Monitor, analyze, and respond to security alerts and events.Work to enhance detection, correlation, and automation capabilities.Coordinate, scope, and manage penetration testing efforts.Conduct internal security reviews, threat hunting, and training exercises.Review threat intelligence and produce advisories as applicable to ON24's environment.Research and review new threat vectors, develop detections and preventions.\nSkills & Experience\nBS degree or equivalent experienceAt least 5 years work experience in technical security rolesHands-on experience with security devices such as network firewalls, load balancers, WAFs (e.g. Fortinet, Cisco, F5), and IDS/IPS (e.g. Snort, Suricata, Bro)Expertise with security monitoring, detection and response / SIEMs (e.g. ELK, Vision-One)Deep understanding of threat modeling, risk prioritization, and technical security measuresSystem administration skills (Win/Mac, Linux, Windows Server) and scripting capabilities (BASH, Python, Powershell)Excellent written and verbal communication skillsAbility to work effectively and drive results in a remote teamSecurity certifications, e.g. CISSP, GIAC, CCSK etc.Experience working in a SaaS, hybrid-Cloud environments (Azure and/or GCP)Experience securing cloud, virtualization, and containerization platforms (K8s, VMWare)Familiarity with Monitoring (Check_MK/Nagios, Solarwinds, Prometheus), and/or DevSecOps toolchains (e.g. Ansible, Terraform, Jenkins, GitLab, etc.)Knowledge of web application / software security assurance basics, e.g. OWASP Top 10Passionate about security with strong desire to learn and grow\nPerks & Benefits\nHealth benefits designed to fit the needs of you and your family — including medical, dental, and vision plans Unlimited PTO policy and wellness days to log off and recharge 11 paid company holidays for US-based employees + 1 Floating Holiday + 2 Floating Wellness days Employee Stock Purchase Plan 401K Plan with employer match Reimbursements covering home office expenses, cell phone use, and classes for professional and personal development Fitness and wellness perks including discounted memberships with 24 Hour Fitness \nThe base pay range for this position is $175,000 to $190,000. This range is not a guarantee of actual compensation that may be earned nor a promise of any specific pay for any specific employee, which is always dependent on relevant experience, education, skills, location, and other applicable factors.\n\nEeoc\n\nON24 is proud to be an equal employment opportunities (EEO) workplace to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, ON24 complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.\n\nPursuant to the San Francisco Fair Chance Ordinance, ON24 will consider for employment qualified applicants with arrest and conviction records.\n\nStates\n\n", "Years Experience": "5 years", "Years Context": "....experienceAt least 5 years work experience in technical security rolesHands-on experience with security devices such as networ....", "Skills": "git(1)\nPython(1)\nios(1)\nGit(1)\naws(1)"}, {"Date Added": "01/25/2023", "Job ID": "3419086321", "URL": "https://www.linkedin.com/jobs/view/3419086321/", "Job Title": "Lead Platform Engineer (ServiceNow)", "Company": "ALTA IT Services, LLC", "Description": "Title: Lead Platform Engineer (ServiceNow) \nLocation: ALTA is supporting a direct hire opportunity working remotely with some travel for a client located in the Atlanta, GA area\nSummary\nThe Lead Platform Engineer (ServiceNow) is expected to act as the technical lead in projects with hands-on involvement in software architecture design, development of software applications, and integrations. The Lead Platform Engineer(ServiceNow) role involves deep analytical skills as well as strong communication and team skills.\nWill be responsible for the design, development, implementation, and support of Network and/or Application Infrastructure with expertise in the strategy, design, development, and implementation of large-scale projects in a Global Enterprise environment.\nResponsibilities And Job Duties\nParticipate in all aspects of the infrastructure life cycle for Enterprise Network, including planning, requirements, development, testing, and quality assuranceEmploy exceptional problem-solving skills, with the ability to see and solve issues before they affect business productivityPlan and implement network changes in a high-availability environment.Work with deployment teams and data center operations providing support during new capacity additions and changes on the Enterprise network.Maximizing network performance by troubleshooting network problems and outages, scheduling upgrades, and collaborating with network architects on network optimization.Installing and configuring Infrastructure equipmentCreating firewalls and updating virus protection software and data security systems to keep data and communications protectedTroubleshooting, resolving, and communicating Infrastructure issues to other employees and managementMaintaining current knowledge, understanding of security, and networking best practices to offer the best solutions and protection to company systemsInstalling and maintaining operating environments.Monitoring these operating environments.Updating any software and hardware where necessary.\nRequired Qualifications\n3-5 or more years of related experience, of which should be with hands-on architecting, designing, developing, and implementing Infrastructure solutions; or an equivalent combination of education and experience.Critical thinking and problem-solving skillsTeam playerGood time-management skillsGreat interpersonal and communication skillsExperience administering physical, virtual, and network computing environmentsExperience with manufacturing IT systems/solutions Strong grasp of Microsoft Active Directory and Azure AD administrationScripting knowledge via PowerShellStrong ability to troubleshoot Microsoft Office 365, Exchange Online email deliverability issues, and anti-spam solutions Ability to support and resolve a wide range of daily technical issues; eagerness to investigate and learn new technologiesAbility to work and communicate within a global, culturally diverse, and fast-paced team environmentNetwork Infrastructure related project management and architecture designNetwork performance monitoring and problem troubleshootingEvidence of developing innovative solutionsExcellent verbal and written communication skillsWe are an Equal Opportunity employer.They need to be strong in AD & Exchange. SCOM, AD Migrations, Intune, SQL, Azure, and API/task automation are beneficial.\nFor immediate consideration, please apply directly or contact Dennis Hurley at dhurley@altaits.com", "Years Experience": "", "Years Context": "....3-5 or more years of related experience, of which should be with hands-on architecting, designing, developing, and im....", "Skills": "SQL(1)"}, {"Date Added": "01/25/2023", "Job ID": "3425007480", "URL": "https://www.linkedin.com/jobs/view/3425007480/", "Job Title": "R&D Engineer II - Linear Algebra", "Company": "Ansys", "Description": "Ansys is the global leader in engineering simulation. We empower the world’s most innovative companies to deliver transformational products to their customers. By offering the best and broadest portfolio of engineering simulation software solutions, we help our customers solve the most complex design challenges and engineer products limited only by imagination. Whether you are a software developer, product engineer, sales team member, or part of our corporate team, at Ansys we know that by embracing what makes us each unique, we become collectively better.\n\nSummary\n\nANSYS is searching for a qualified candidate to join their team of Linear Algebraists. This team works to solve linear algebra problems arising in a broad spectrum of application problems involving direct and iterative solution of linear systems for sparse and dense problems and associated eigenvalue problems. The R&D Engineer II contributes to the development of software products and supporting systems. In this role, the R&D Engineer II will collaborate with a team of expert professionals to understand customer requirements and accomplish development objectives. We are specifically searching for a candidate specializing in eigenvalue problems.\n\nResponsibilities\nPerforms moderately complex development activities, including the design, implementation, maintenance, testing and documentation of software modules and sub-systemsUnderstands and employs best practicesPerforms moderately complex bug verification, release testing and beta support for assigned products. Researches problems discovered by QA or product support and develops solutionsUnderstands the marketing requirements for a product, including target environment, performance criteria and competitive issuesWorks under the general supervision of a development manager\nMinimum Qualifications\nBS in Engineering, Computer Science, or related field with 2 years’ experience or MSWorking experience with a variety of linear algebra areas but especially eigenvalue computationsExperience applying linear algebra technology to engineering application problemsDemonstrated skills using existing linear algebra software tools with the ability to enhance those toolsSoftware skills in Fortran and/or C to develop new tools as required especially in a parallel computing environment using MPI and OpenMP\nPreferred Qualifications\nPhD preferredAbility to work in a variety of application areasExperience in a large-scale commercial software development environmentGood communication and interpersonal skillsAbility to learn quickly and to collaborate with others in a geographically distributed team, including application specialists\n ALIGNING YOUR VALUES TO OUR SOLUTIONS \n\nOur ONE Ansys Culture Has At Its Core\n\nAt Ansys, our diverse, collaborative teams give us the strength and insight to solve the world’s most challenging engineering problems.\n Customer Focus  Results and Accountability  Innovation  Transparency and Integrity  Mastery  Inclusiveness  Sense of Urgency  Collaboration and Teamwork \nENGINEERING YOUR CAREER AT ANSYS\n\nAt Ansys, you will find yourself among the sharpest minds and most visionary leaders across the globe. Collectively we strive to change the world with innovative technology and transformational solutions. With a prestigious reputation in servicing well-known, world-class companies, standards at Ansys are high – met by those willing to rise to the occasion and meet those challenges head-on. At Ansys, it’s about the learning, the discovery and the collaboration. It’s about the “what’s next” as much as the “mission accomplished.” And it’s about the melding of disciplined intellect with strategic direction and results that have, can and do impact real people in real ways. All this is forged within a working environment built on respect, autonomy and ethics.\n\nAt Ansys, you will find yourself among those eager to drive the world towards the next best thing with hands planted firmly on the wheel. Our team is passionate about pushing the limits of world-class simulation technology, empowering our customers to turn their design concepts into successful, innovative products faster and at lower cost. As a measure of our success in attaining these goals, Ansys has been recognized as one of the world's most innovative companies by prestigious publications such as Bloomberg Businessweek and FORTUNE magazines.\n\nAnsys is an S&P 500 company and a member of the NASDAQ-100. We are proud to have been recognized for the following awards: Bay Area Best Places to Work, a Pillar World Awards Gold Winner, Fast Company Best Places to Work for Innovators, a Gold Stevie Award for Great Employers, the FORTUNE Future 50, a DCA Silver Winner, an R&D100 Finalist, a 20% by 2020 Women on Boards winner, a 2020 Pittsburgh Tech 50 – finalist, and America’s Most Responsible Companies.\n\nFor more information, please visit us at www.ansys.com\n\n We are committed to creating a culture of inclusion and belonging where everyone thrives as ONE Ansys team. \n\nAnsys is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other protected characteristics.\n\nAnsys does not accept unsolicited referrals for vacancies, and any unsolicited referral will become the property of Ansys. Upon hire, no fee will be owed to the agency, person, or entity.", "Years Experience": "2 years", "Years Context": "....related field with 2 years’ experience or MSWorking experience with a variety of linear algebra areas but especially eigenvalu....", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3448352553", "URL": "https://www.linkedin.com/jobs/view/3448352553/", "Job Title": "Full Stack Java Developer", "Company": "Deloitte", "Description": "Are you an experienced, passionate pioneer in technology - a solutions builder, a roll-up-your-sleeves technologist who wants a daily collaborative environment, think-thank feel and share new ideas with your colleagues - without the extensive demands of travel? If so, consider an opportunity with Deloitte under our Project Delivery Talent Model. Project Delivery Model (PDM) is a talent model that is tailored specifically for long-term, onsite client service delivery. PDM practitioners are local to project locations, minimizing extensive travel, and provides you with a full career path within the firm\n\nWork You'll Do/Responsibilities\n Design and develop highly-performant technical solutions based on requirements.Create technical Jira stories based on business requirements.Participate in agile ceremonies.Learn and follow Edward Jones best practices.Support the full life-cycle of the applications.\nThe Team\n\nOur Core Technology Operations (CTO) team offers differentiated operate services for our clients with solutions to help organizations scale and optimize critical business operations, drive speed to outcome, deliver business transformation, and build resilience in an uncertain future.\n\nOur operate services within CTO include:\nFoundry Services: Operate services providing flexible, recurring resource capacity for client initiatives, projects, tasks, and enhancementManaged Services: Operate services that provide ongoing maintenance, monitoring, and optimization for IT/Engineering applications & products\nQualifications\n\nRequired\nExperience with Open System development skills such as Java, JEE, JSP, Spring, Spring Boot, Spring JPA, REST, JSON, Junit, JavaScript, HTML, and XML are required.Strong experience with API development including experience with RestExperience with API gateways and patternsWorking Knowledge with message streaming infrastructure - KafkaExperience with relational database (MS SQL)Working Knowledge with Micro Service ArchitectureWorking Knowledge with application development on MuleSoft, Azure cloud and KubernetesExperience working in a product team with other developers including tech lead, product owner, scrum master, quality engineers etc.Bachelor's degree in Computer Science, Computer Information Systems, Management Information Systems, or related field preferredBackground in Financial Services preferredUnderstanding of object-oriented analysis, design, and programming.Understanding of the Spring Framework.Understanding of WebLogic.Ability to write code that is multi-threaded.Ability to write code that is asynchronous.Batch programming.Understanding of HTML, CSS, and JavaScriptUnderstanding of the React.js library and a willingness to learn the Next.js framework.Understanding of SQL.Understanding of GitHub.Understanding of performance monitoring: Splunk, Dynatrace, Grafana.Understanding of MuleSoft.A willingness to learn.Limited Sponsorship may be available.Abilitly to travel 10%, on average, based on the work you do and the clients and industries/sectors you serve.", "Years Experience": "", "Years Context": "", "Skills": "Java(1)\nJavaScript(2)\nHTML(2)\nSQL(2)\nCSS(1)\nReact(1)\nGit(1)"}, {"Date Added": "01/25/2023", "Job ID": "3395721306", "URL": "https://www.linkedin.com/jobs/view/3395721306/", "Job Title": "Lead Software Engineer - Full Stack", "Company": "Genesys", "Description": "Lead Software Engineer – Full stack\nWe are looking for a Lead Software Engineer - Full Stack (Java and Angular), to join the development team responsible for the UI and Integration of the Pointillist Customer Experience Analytics platform.\nMajor Responsibilities/Activities:\nDevelop and deploy highly available, fault-tolerant software that will help drive improvements toward the features, reliability, performance, and efficiency of GENESYS Cloud/Pointillist.Work with development partners to shape the architecture, design, and implementation of new and existing systems to enhance their reliability, performance, efficiency, and scalability.Personally take ownership over platform code by making recommendations and driving changes based on your expertise to gain efficiency, scale and standardization. Design and implement major changes and new features using Java, Spring, and Angular. Your code will be seen as the gold standard for how things should be developed. Own the technical roadmap and ensure sprints include the remediation of technical debt and spikes to constantly question how we could improve. Leverage AWS technologies for the delivery of solutionsWork as part of a cross functional Agile development team.Actively review code, mentor junior development staff, and provide peer feedback.Collaborate with engineering teams to identify and resolve pain points as well as evangelize best practices.Troubleshoot production issues and come up with solutions as required.Become a subject matter expert in the Pointillist UI and development practicesStay up to date on current technology trends, perform proof of concepts, and make recommendations for the adoption of new technology. \nMinimum Requirements\nAn expert developing applications using Java, Spring, Hibernate (JPA), AngularAn expert with REST-style web services and frameworks, especially Spring BootExperience developing / managing / working with CI/CD pipelines.Strong understanding of Linux, AWS, and networking concepts.Ability to rapidly learn new software, frameworks, open-source tools, and development languages.Senior level of experience in software development . Proven track record of delivery scalable software solutionsAbility to understand technically complex systems and distill them down to understandable components. Bachelor’s degree in Computer Science or related work experience.\nCompensation And Benefits\nMarket competitive salary with an anticipated base compensation range of 117,000 USD – 243,000 . Actual salaries will vary depending on a candidate’s experience, qualifications, skills, and location.Medical, Dental, and Vision InsuranceTelehealth coverageFlexible work schedules and work-from-home opportunitiesDevelopment and career growth opportunitiesOpen Time Off401(k) matching programAdoption Assistance Infertility treatments\nSee more Genesys benefits information at https://mygenesysbenefits.com/\nReasonable Accommodations: \nGenesys is committed to providing an inclusive barrier-free environment, starting with the hiring process. If you require a reasonable accommodation to complete any part of the application process or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you or someone you know may complete the Reasonable Accommodations Form for assistance. Please use the Candidate field in the dropdown menu to ensure a timely response.\nThis form is designed to assist job seekers who seek reasonable accommodation for the application process. Submissions entered for non-accommodation-related issues, such as following up on an application or submitting a resume, may not receive a response.\nAbout Genesys:\nEvery year, Genesys® orchestrates more than 70 billion remarkable customer experiences for organizations in more than 100 countries. Through the power of our cloud, digital and AI technologies, organizations can realize Experience as a Service℠, our vision for empathetic customer experiences at scale. With Genesys, organizations have the power to deliver proactive, predictive, and hyper personalized experiences to deepen their customer connection across every marketing, sales, and service moment on any channel, while also improving employee productivity and engagement. By transforming back-office technology to a modern revenue velocity engine Genesys enables true intimacy at scale to foster customer trust and loyalty. Visit www.genesys.com\nGenesys is an equal opportunity employer committed to diversity in the workplace. We evaluate qualified applicants without regard to race, color, age, religion, sex, sexual orientation, gender identity or expression, marital status, domestic partner status, national origin, genetics, disability, military and veteran status, and other protected characteristics.\nPlease note that recruiters will never ask for sensitive personal or financial information during the application phase.\n", "Years Experience": "", "Years Context": "....Every year, Genesys® orchestrates more than 70 billion remarkable customer experiences for organizations in mo....", "Skills": "Full stack(1)\nFull Stack(1)\nJava(3)\nAWS(2)\ngit(1)\nexpress(1)"}, {"Date Added": "01/25/2023", "Job ID": "3432266222", "URL": "https://www.linkedin.com/jobs/view/3432266222/", "Job Title": "REMOTE Sr. Ruby on Rails Developer - EST/CST", "Company": "CyberCoders", "Description": "If you are a REMOTE Sr. Ruby on Rails Developer with experience, please read on!\n\nFast growing startup / Top compensation package / Bleeding edge technology!\n\nLocated in the Big Apple, we are an innovative aviation company bringing higher mobility to the everyday consumer in addition to providing cutting-edge life-saving mobility to the healthcare industry. We are growing and are currently looking to add a Talented and Energetic REMOTE Sr. Ruby on Rails Developer to join our team!\n\nTop Reasons to Work with Us\n\nNew York-headquartered startup with tons of Growth\n\nFast paced, high growth, start-up full of talented and mission driven individuals that love what they do.\n\nCompetitive salary and meaningful stock options.\n\nHealth, dental and vision insurance.\n\nOpportunities to continue your professional development.\n\nThe best technology to get your job done.\n\nWhat You Will Be Doing\n\nContribute and impact the entire software development cycle and delivery from ideation to deployment.\n\nDevelop and maintain software across the tech stack including UI, backend, and infrastructure.\n\nImprove and implement features across our app, build and deliver internal tools and workflows that support operations\n\nWhat You Need for this Position\n\nThe Engineering Team at our client is responsible for building our polished customer-facing experiences and the underlying technology platform. We are a small but growing and highly effective team, whereas every team member is vital to the success of the company.\n\nMust Haves\n\n5+ years of Ruby on Rails experience\n\n3+ years of ReactJS experience.\n\nYou've been part of a team that works on large-scale distributed systems and are comfortable working in JavaScript.\n\nNice To Haves\n\nAWS\n\nMongoDB\n\nKafka\n\nExamples Of Problems You'll Be Solving\n\nWork across the stack to deliver new features for Quality and Velocity.\n\nCollaborate with Product and Design to develop engaging and usable UIs for both our products.\n\nImprove the performance of our scaling platform.\n\nMonitor all of the above in a scalable way. We all do ops, so we depend on automation.\n\nContribute to our agile development process by participating in code reviews, stand-ups, sprint planning, and retrospectives.\n\nYou Should\n\nYou love solving big problems.\n\nYou care about working in and fostering a positive and collaborative environment.\n\nYou have a strong sense of product, and empathy for the human who is using it.\n\nYou want to have an impact on the software engineering community.\n\nYou are passionate about building maintainable, efficient, clean code.\n\nYou enjoy being with peers who strive for engineering excellence.\n\nYou like working in a fast paced environment.\n\nYou always want to learn more and constantly improve as an engineer.\n RUBY Ruby On Rails JavaScript ROR Rails SQL AWS Heroku\nWhat's In It for You\n Strong Benefits program (Medical/Dental/Vision/401k) PTO programEquity availableGreat Culture and Lots of room for growth!\nSo, if you are a Sr. Ruby on Rails Developer with experience, please apply today!\n\nColorado employees will receive paid sick leave. For additional information about available benefits, please contact Devan Walls\n\nEmail Your Resume In Word To\n\nLooking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:\n\nDevan.Walls@CyberCoders.com\nPlease do NOT change the email subject line in any way. You must keep the JobID: linkedin : DW8-1721386 -- in the email subject line for your application to be considered.***\nDevan Walls - Associate Manager - CyberCoders\n\nApplicants must be authorized to work in the U.S.\n\nCyberCoders, Inc is proud to be an Equal Opportunity Employer\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.\n\nYour Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.\n\n", "Years Experience": "5+ years\n3+ years", "Years Context": "....5+ years of Ruby on Rails experience....\n....3+ years of ReactJS experience.....", "Skills": "React(1)\nJavaScript(2)\nAWS(2)\nMongo(1)\nSQL(1)"}, {"Date Added": "01/25/2023", "Job ID": "3453005073", "URL": "https://www.linkedin.com/jobs/view/3453005073/", "Job Title": "Sr. Security Engineer (Ruby on Rails experience required)", "Company": "Aha!", "Description": "Senior Security Engineer\nAha! is a very different type of high-growth SaaS company. We are self-funded, highly profitable, and 100 percent remote. We provide the world's #1 product development software so teams can build products that customers love. More than 600,000 product builders use our suite of tools which includes Aha! Roadmaps , Aha! Ideas , Aha! Create , and Aha! Develop . And they rely on our training programs via Aha! Academy to become product development experts. We are recognized as one of the best fully remote companies to work for, champion the Bootstrap Movement , and have given over $1M to people in need through Aha! Cares . Learn more at www.aha.io .\nOur team\nAha! engineering is a mid-sized, fully remote team that is highly productive. We are centered around North American time zones so we can collaborate during the workday.\nWe help each other grow: We each bring unique skills to the table and want our teammates to feel valued from the start. Our onboarding program exposes new hires to the codebase and lets them contribute right away. We move quickly: We ship code multiple times a day. We believe in getting valuable features in front of customers and iteratively improving as we learn what works and what does not. We value product over process: We want the team to have the time and focus on solving complex challenges. We minimize the overhead by setting clear goals and avoiding heavyweight processes and excessive meetings.We share knowledge freely: We share our learnings with each other and with the developer community. Our engineering blog demonstrates how we tackle interesting challenges at Aha! We enjoy: We like what we do. And we want you to love your team and your job too. Learn more about The Responsive Method , our company values , and the generous benefits we offer.Our technology\nOur web application is a single-instance, multi-tenant Ruby on Rails monolith supported by Postgres (database), Redis (background jobs), and memcached (Rails caching). We also run a Node.js webserver to support collaborative editing and real-time updates. Our application is hosted on Amazon Web Services and architected with ECS for reproducibility and scalability.\nSome Of The Features We Have Built With React Include\nWe use React for rich client-side experiences on the front end.\n Our fully collaborative text editor : Supports multiple cursors and simultaneous editing by any number of users. We pride ourselves in the underlying technology . Our presentation editor : Allows users to create presentations with slide themes, shapes, text, and embedded Aha! reports that update live so the presentation is always current. Our Gantt chart : Supports scaling and scrolling to change the timeline, drag-and-drop, and quick actions to create records or sort the bars.\nWe embrace new technologies that help us deliver a lovable product, but we also remain cognizant of the maintenance overhead that a new library or platform brings. We solve the problems in front of us, rather than prematurely optimizing to address issues that may never materialize.\nWe do most of our planning and collaboration in Aha! Roadmaps and built Aha! Develop so that software engineers and their teams could take advantage of those same rich features. We use Slack and Zoom for video calls. (Email? Rarely.)\nYour Experience\nAs a Senior Security Engineer, you will spend the majority of your time working with Ruby on Rails and JavaScript code for security reviews and implementing security features.\nYou Also Have The Below Experience And Skills\nWe believe that being a kind person who elevates the rest of the team is just as valuable as finding vulnerabilities. You have strong problem-solving skills and experience working on application security for a cloud-based product. You like to implement security features and fix bugs when you aren't finding vulnerabilities. You are humble, eager to learn, and always willing to help others. You want teammates who enjoy solving problems regardless of the technologies and techniques involved. You have worked at meaningful scale before and want to do so again.\n4+ years of experience working in Ruby on Rails / SecurityContributor to security code reviews in Ruby on Rails applicationsExperience building features at a high-growth SaaS companyActive collaborator with product teamsYour work at Aha!\nYour Work Will Include\nWe work with engineers and product managers across our full suite of tools to deliver secure applications. We love Ruby on Rails and dig deep into code and business logic.\nSecurity code reviews that go above and beyond what can be found through scanning tools (which we use too!)Implementing security features and security improvements with the customer experience in mindAssessing and mitigating new application exploit patterns and cloud-provider abuse techniquesSharing security findings and new developments internally for ongoing education\nIf this sounds appealing, we would love to hear from you. A real human reviews every application, so please use the form to help us learn more about you.\nGrow with us\nEveryone deserves to reach their fullest potential. We know that when we do work that matters with people we care about in a high-growth environment, we feel engaged and alive. And our goal is to help you do just that. We offer all the benefits you would expect and more, including profit sharing. The specific benefits listed below are reflective of what we offer U.S.-based hires. We also do our best to extend identical benefits to international teammates.\nThe base salary range for this role in the US is between $110,000 and $190,000Cash-based compensation also includes profit sharing and we contribute a percentage of your total pay each month towards your retirementMedical, dental, and vision plans — for many teammates, we cover 100 percent of the premiumsUp to 200 hours of paid time off a year to spend however you want30 to 90 days of paid parental leave and five to 10 days of paid care and bereavement leaveUp to $1,000 annually for third-party education, along with paid time off to immerse yourself in learningVolunteer opportunities throughout the year\nBase salary and total compensation are dependent upon many factors, such as: skills, experience, and relevant past roles", "Years Experience": "4+ years", "Years Context": "....4+ years of experience working in Ruby on Rails / SecurityContributor to security code reviews in Ruby on Ra....\n....s of paid time off a year to spend however you want30 to 90 days of paid parental leave and five to 10 days of paid care and ....\n....ities throughout the year....", "Skills": "Bootstrap(1)\nPostgres(1)\nNode(1)\nAmazon(1)\nReact (2)\nfront end(1)\nJavaScript(1)"}, {"Date Added": "01/25/2023", "Job ID": "3452700833", "URL": "https://www.linkedin.com/jobs/view/3452700833/", "Job Title": "Ruby on Rails Engineer", "Company": "Dice", "Description": "Fully remote Ruby Engineer needed!\nThis Jobot Job is hosted by: David Six\nAre you a fit? Easy Apply now by clicking the \"Apply Now\" button and sending us your resume.\nSalary: $145,000 - $155,000 per year\nA bit about us:\nWe are a custom software development company that helps retailers all over the world grow their business using software. We consider each of our clients to be stakeholders in our company, and treat them as members of our personal community.\nWhy join us?\nWe offer a great remote work culture. On top of this, we are a people first business. We provide excellent benefits, flexible hours and a focus on work/life balance.\nJob Details\nWe are looking for several strong Ruby on Rails Engineers. The ideal candidate will have experience building custom Ruby software using AWS and JavaScript. Additional consideration will be given to those with Vue experience, but not a requirement.\nMust have\n Ruby on Rails Engineering experience Ability to work remotely and collaboratively Relational database experience, preferably SQL Experience working in a cloud environment\nNice to have\n Vue or React experience AWS experience Client facing experience\nWe are beginning interviews immediately. Apply today!\nInterested in hearing more? Easy Apply now by clicking the \"Apply Now\" button. - provided by Dice", "Years Experience": "", "Years Context": "....5,000 - $155,000 per year....", "Skills": "AWS(2)\nJavaScript(1)\nSQL(1)\nReact (1)"}, {"Date Added": "01/25/2023", "Job ID": "3452833899", "URL": "https://www.linkedin.com/jobs/view/3452833899/", "Job Title": "Java Full Stack Developer (Remote then CLT)", "Company": "Matlen Silver", "Description": "Job Title: Java Full Stack Developer \nDuration: 12-18 months \nLocation: Remote then CLT  \nRequired Pay Scale: 50-68/hr. W2 \n \n***Due to client requirements this role is only open to USC or GC, H4 candidates ***\n \nJob Summary:\n \nProject Details:\nThis position requires to do backend development as well along with Angular. REST api, spring batch, autosys, Oracle and spring jpa or hibernate \nOracle is preferable, but any other DB experience with SQL/PLSQL \nWorking in a Credit Risk Program on an Asset (property) valuation application. Will support internal applications and external applications \nMust Haves\n5+ years experience with Full Stack Java5+ years experience with Angular 6 and aboveHibernateSpringREST APIOracle PL/SQL or other SQL databaseDesired Skills\nReact is a plusBanking experienceGood collaborationAsk good questionsGood at problem solvingVery Hands on \nAbout Matlen Silver\n \nExperience Matters. Let your experience be driven by our experience. For more than 40 years, Matlen Silver has delivered solutions for complex talent and technology needs to Fortune 500 companies and industry leaders. Led by hard work, honesty, and a trusted team of experts, we can say that Matlen Silver technology has created a solutions experience and legacy of success that is the difference in the way the world works.\n \nMatlen Silver is an Equal Opportunity Employer and considers all applicants for all positions without regard to race, color, religion, gender, national origin, age, sexual orientation, veteran status, the presence of a non-job-related medical condition or disability, or any other legally protected status.\nIf you are a person with a disability needing assistance with the application or at any point in the hiring process, please contact us at email and/or phone at: info@matlensilver.com // 908-393-8600\n ", "Years Experience": "5+ years\n5+ years\n40 years", "Years Context": "....5+ years experience with Full Stack Java5+ years experience with Angular 6 and aboveHibernateSpringREST APIO....\n....ce. For more than 40 years, Matlen Silver has delivered solutions for complex talent and technology needs to Fortune 500 compa....", "Skills": "Java(2)\nFull Stack(2)\nSQL(4)\nReact (1)"}, {"Date Added": "01/25/2023", "Job ID": "3447073845", "URL": "https://www.linkedin.com/jobs/view/3447073845/", "Job Title": "Full Stack Developer", "Company": "Community Food Navigator", "Description": "The Community Food Navigator seeks a full stack developer to lead the continued development and maintenance of our cross-platform app. You’ll be working on new features, enhancements to existing functionality, and managing our AWS environment. \nExperience building and maintaining highly scalable, flexible, content-driven enterprise applications is strongly preferred. \nThe Full Stack Developer will plan and develop specialized applications software in support of the Community Food Navigator’s mobile application and its future integration with the next version of its website. \nThis person will have the chance to work alongside the developers who have built the app for the last year to support their professional development, knowledge transfer about the approach to the coding and architecture, and transition from external development and maintenance to internal development and maintenance for the first four months of the role. \nThis position is full-time, reporting to the Project Executive Director, and working in partnership with the Managing Director of Community Engagement and a Project Coordinator focused on digital community building. \nThe community of Navigator app users guide the development and use of resources and tools. It is a network-driven resource hub intended to support community-driven food system practitioners who set priorities and steward solutions based on their lived experiences. \nResponsibilities and Tasks ● Collaborates with Navigator community engagement teammates and community members to understand user needs; drafts initial proposal and design of software to meet these needs.● Assesses feasibility of design and project parameters within time and cost constraints.● Analyzes user needs in partnership with Navigator community engagement teammates and designs software for project use. ● Develops code and designs software applications based on user specifications.● Modifies existing software to correct errors or improve performance. ● Monitors and assists with software testing and validation procedures and programming. ● Monitors and assists with software installation; ensures application operates within established specifications. ● Gathers and evaluates user feedback in partnership with product coordinator/community engagement teammates and modifies software for better usability (nice to have) ● Designs databases for specific application areas. ● Determines required system performance standards and hardware configurations based on project specifications, budget, security needs, and other parameters. ● Collaborates with systems analysts, engineers, and programmers to design systems to support required applications. ● Advises team operations lead and MSP provider on software maintenance related to products.● Performs other related duties as assigned. \nTechnology Proficiency App development experience should include proficiency with the following technologies: ● Vue.js ● Quasar ● NexusJs ● Prisma ● GraphQL* ● MySQL *GraphQL is a required tool for success in this role\nDevOps experience should include familiarity with the following technologies: ● Docker ● Drone EC2 ● RDS ● ECR ● ELB ● Cognito ● SES ● Route 53 ● S3 ● IAM ● Cloudwatch ● VPC ● Certificate Manager ", "Years Experience": "", "Years Context": "....the app for the last year to support their professional development, knowledge transfer about the approach to the coding and ....", "Skills": "full stack(1)\nAWS(1)\nFull Stack(1)\ngit(1)\nGraphQL(2)\nMySQL(1)"}, {"Date Added": "01/25/2023", "Job ID": "3425163802", "URL": "https://www.linkedin.com/jobs/view/3425163802/", "Job Title": "Firmware Engineer (Boulder)", "Company": "Bio-Rad Laboratories", "Description": "We are seeking enthusiastic, highly motivated Software Developers to join our Boulder team (either a fully remote role or in Colorado).\nOur fast-paced team is looking to grow to support an exciting new product. We have opportunities throughout the tech stack and are looking for developers with excellent communication skills and a willingness to expand their skillset to help bring this product to life. Our team works closely with electrical and optical engineers, lab scientists, and marketing to create an innovative digital droplet PCR instrument. We are looking to fill roles from firmware to front-end development and prioritize talent and fit over a specific job description.\nThe Digital Biology R&D team is a collaborative group of engineers, chemists, biologists, and software developers who thrive working at the forefront of innovation. With a primary focus on advancing scientific discovery and improving lives, we optimize technologies like Droplet Digital PCR, new chemistries for sensitivity and specificity in cell biology, protein analysis and purification, and software tools, including AI for data analysis. We’re driven by our mission and the meaningful impact we make every day delivering solutions that work for our customers from bench to bedside.\nHow You’ll Make An Impact: \nWork in a collaborative environment to apply well architected solutions.Architect business logic and features to add to our web-based applications from concept to implementation.Work alongside Scientists, R&D and Marketing to develop innovative life science products.Work closely with EE team to develop firmware for custom PCBs.\nWhat You Bring:\nBachelor’s degree in Computer Science or a related field.5+ years’ experience as a Software Developer.Experience with embedded C/C++ development using RTOSs.Experience with interrupt driven programming patterns.Experience developing for ARM processors.Experience developing firmware to interface with discrete ICs. Experience working with Linux operating systems.Experience working with CI/CD pipelines.Software development in regulated environments (medical, aerospace).Agile and scrum practices and policies.\nPosition is located in Boulder, CO.\nVaccination Requirement: Ability and consent to upload proof of completed Covid-19 vaccination into our secure database within 3 days of start date.\nCompensation: The estimated base salary range for this position is $107,600 to $148,000 at the time of posting. Actual compensation will be provided in writing at the time of offer, if applicable, and is based on several factors we believe fairly and accurately impact compensation, including geographic location, experience, knowledge, skills, abilities, and other job permitted factors. This position is eligible for a variable annual bonus, which is dependent upon achievement of your individual objectives and Company performance.\nWho We Are: For 70 years, Bio-Rad has focused on advancing the discovery process and transforming the fields of science and healthcare. As one of the top five life science companies, we are a global leader in developing, manufacturing, and marketing a broad range of high-quality research and clinical diagnostic products. We help people everywhere live longer, healthier lives. Recently voted a Best Place to Work, Bio-Rad offers a unique employee experience with collaborative teams that span the globe. Here, you are supported by leadership to build your career and are empowered to drive change that makes an impact you can see.\nBenefits: We’re proud to offer a variety of options, including competitive medical plans for you and your family, free HSA funds, a new fertility offering with stipend, life and disability, paid parental leave, 401k plus profit sharing, employee stock purchase program, a new upgraded and streamlined mental health platform, extensive learning and development opportunities, education benefits, student debt relief program, pet insurance, wellness challenges and support, paid time off, Employee Resource Groups (ERG’s), and more!\nEEO Statement: Bio-Rad is an Equal Employment Opportunity/Affirmative Action employer, and we welcome candidates of all backgrounds. Veterans, people with disabilities, and people of all races, ethnicities, genders, ages, and orientations are encouraged to apply.\nAgency Non-Solicitation:  Bio-Rad does not accept agency resumes, unless the agency has been authorized by a Bio-Rad Recruiting Representative. Please do not submit resumes unless authorized to do so. Bio-Rad will not pay for any fees related to unsolicited resumes.", "Years Experience": "5+ years\n70 years", "Years Context": "....r a related field.5+ years’ experience as a Software Developer.Experience with embedded C/C++ development using RTOSs.Experien....\n....Who We Are: For 70 years, Bio-Rad has focused on advancing the discovery process and transforming the fields of science and ....", "Skills": "git(3)\nfront-end(1)"}, {"Date Added": "01/25/2023", "Job ID": "3452421733", "URL": "https://www.linkedin.com/jobs/view/3452421733/", "Job Title": "Solution Engineer – XR Unity", "Company": "American Electric Power", "Description": "Job Description\n\nPart of a larger team delivering high quality technology solutions to the business. Design, develop and installs advanced software solutions. Build high-quality, innovative and fully performing software in compliance with internal architecture, development & design standards & best practices. Design, modify, develop, write, implement and troubleshoot software programming applications. Support and/or install software applications. Participate in the testing process through test review and analysis, test witnessing and certification of software. Works within a Waterfall or Agile methodology/framework based team. Collaborates heavily with Project Management, Business Analyst and Infrastructure Job Families.\n\nESSENTIAL JOB FUNCTIONS are listed below:\n\nWorks independently. Responsibilities include one or more of the following for any sized project:\n Develop solutions to resolve customer and prospective customer issues in a logical, creative and structured manner.  Align the client’s goals, needs and objectives to the solutions  Communicate issues and status in a clear, timely manner  Interpret specifications and build advanced solutions to those specifications.  Support the business strategy by acting as an expert of the company's services and products, including usage, architecture, functionality and deployment.  Develop custom presentations and demonstrations.  Generates infrastructure support documentation.  Make proposals and help to write request for proposal (RFP) responses.  Evaluate and propose process improvements.  Maintain the highest level of knowledge about the company's software/hardware products.  May provide training and mentoring, as well as work direction, to others on the team  Minimum 2 years professional experience developing XR (VR/AR/MR) applications  Professional C# programming experience in Visual Studio  Strong OOP background and an understanding of SOLID development principles  Unity 3D game and/or enterprise application development experience  Passion for emerging technologies such as AR,VR,MR,AI, IoT, Machine Learning  Thorough understanding of the software development lifecycle  Experience developing backend-driven applications  Experience with Git SCM  Experience in targeting different platforms from Unity such as AR/VR/MR applications for mobile/tablet (IOS/Android), smart glasses, Headsets  Experience with the Oculus SDK  Up-to-date knowledge of AR technologies  Experience in an Agile/Scrum team  Understanding of, and experience with, creating automated unit tests \n\n\nOther Preferred Requirements & Qualifications (Based on Area of Responsibility): \n\nEducation: BS Engineering, Computer Science, or related technical field.\n\nExperience: \n Some hands-on experience in developing Native Mobile Applications (Android Development Studio and XCode)  Experience with targeting multiple platforms from Unity (e.g., MS HoloLens, UWP, WebGL, Android, iOS)  CI/CD using GitHub Actions  Technical issues related to headset tracking and VR User Interfaces  Experience with OpenVR  Image recognition/Marker based tech  High level understanding of developing solutions for web, integration middleware, database & data warehouse, front-end technology & framework and security  ARKit/ARCore/AR Foundation  Understanding of Multiplayer & Networking  Backend API development experience in IIS & .Net  Typescript development experience  Experience with Node.js  Experience with TDD and Pair Programming   Remote user assistance using XR technologies  Some experience with 3D Modeling software (Blender, Maya, 3ds Max, PiXYZ, etc)  UV Mapping/unwrapping, texturing experience using Substance Suite, Adobe Suite, etc.  Unity 3D UX/UI Design using Adobe Suite, Photoshop, XD, Illustrator, etc.  Some experience with rigging / animation . \n\n\nJob Type\n\nFull-Time\n\nRelocation\n\nNo\n\nAnnual Salary From (Min)\n\n81777.00\n\nAnnual Salary To (Mid)\n\n120088.00\n\nMinimum Requirements\n\nBASIC QUALIFICATIONS\n\nEducation: Bachelor's degree in computer science, engineering, or related technical field is required.\n\nExperience: 7 years relevant work experience is required.\n\nAn equivalent combination of education and related experience may be considered.\n\nPhysical demand level is Sedentary\n\nWork Designation\n\nRemote\n\n", "Years Experience": "2 years\n7 years", "Years Context": ".... the team  Minimum 2 years professional experience developing XR (VR/AR/MR) applications  Professional C# programming experien....\n....Experience: 7 years relevant work experience is required.....", "Skills": "Git(2)\nIOS(1)\nAndroid(3)\niOS(1)\nfront-end(1)\nNode(1)\nAdobe(2)"}, {"Date Added": "01/25/2023", "Job ID": "3424972856", "URL": "https://www.linkedin.com/jobs/view/3424972856/", "Job Title": "Security Engineer (Remote)", "Company": "Broadridge", "Description": "At Broadridge, we've built a culture where the highest goal is to empower others to accomplish more. If you’re passionate about developing your career, while helping others along the way, come join the Broadridge team.\n\nWe are looking to hire a Security Engineer to join our Security Engineering Team in Information Security!\n\nThe Security Engineering Team is a diverse team of individuals, working together globally, protecting Network Infrastructure. In this role you will be focused on design and implementation of new and existing security solutions. You will help mature each solution and maximize our investment. You will also help maintain, support, and troubleshoot all technology areas.\n\nIdeally, the candidate would have 3 - 5 years’ experience with design and implementation in the following technologies. The vendors listed are preferred:\nIPS - Intrusion Prevention System. CiscoDoS - Denial of Service. Radware, Cloudflare, AkamaiWAF - Web Application Firewall. Cloudflare, Radware, AkamaiNAC - Network Access Control. Cisco\n\nAny working experience with the following technologies is also desirable:\nNetflowHoneyPotsSSL/TLS CertificatesHSM - High Security ModulesGovernance - Tufin SecureChange and SecureTrackPacket Broker - Gigamon\n\nCandidates should be well-spoken, have strong typing skills, be able to focus on tasks of priority but also make time for tasks of lesser priority, work efficiently by being organized and have a strong work ethic.\n\nAll associates participate in an off-hour support rotation. Change implementation is risk based; candidates will need to work on weekends when and if necessary. Project and time management will be core fundamentals of the job role. This includes detailing tasks, setting, and achieving on-time delivery dates, coordinating the efforts of other teams, communicating effectively to all participants, and driving projects to completion. In addition, candidates are expected to write technical documents and illustrations to showcase our knowledge and monetary investments in each technology.\n\nSalary Range: $155,000 to $160,000 Annual\n\nBonus Eligible\n\nPlease visit www.broadridgebenefits.com for more information on our comprehensive benefit offerings.\n\nDisability Assistance\n\nWe recognize that ensuring our long-term success means creating an environment where everyone is welcome, where everyone's strengths are valued and where everyone can perform at their best. Broadridge provides equal employment opportunities to all associates and applicants for employment without regard to race, color, religion, sex (including sexual orientation, gender identity or expression and pregnancy), marital status, national origin, ethnic origin, age, disability, genetic information, military or veteran status and other protected characteristics protected by applicable federal, state, or local laws. US applicants: Click here to view the \"EEO is the Law\" poster. If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation in the event you are unable or limited in your ability to use or access the Company's career webpage because of your disability. You may request a reasonable accommodation(s) by calling 888-237-7769 or by sending an email to BRcareers@broadridge.com.\n\n", "Years Experience": "5 years", "Years Context": "....ate would have 3 - 5 years’ experience with design and implementation in the following technologies. The vendors listed are pr....", "Skills": "express(1)\naws(1)"}, {"Date Added": "01/25/2023", "Job ID": "3206112134", "URL": "https://www.linkedin.com/jobs/view/3206112134/", "Job Title": "Enterprise Architect - Atlanta", "Company": "SHI International Corp.", "Description": "Job Summary\n\nThe Enterprise Architect is a strategic, customer-facing member of the Stratascale Account Team. They are a consultative partner for our large enterprise customers, focusing on understanding their goals and strategies and mapping solutions to business outcomes. The Enterprise Architect will have a deep understanding of the solutions and capabilities represented within Stratascale’s five Centers of Excellence, which are Cloud Ascension, Cybersecurity, Digital Experience, Data Intelligence, and Automation.\n\nThe Enterprise Architect is responsible for developing cross-functional strategies and solutions bringing together technical expertise, real-world experience, strong executive engagement skills and an inspirational mindset to help our customers solve their business challenges.\n\nThis position is a remote position, required to reside in the state of Georgia, however may be required to report to our Stratascale Office as required for business needs as determined by Stratascale management.\n\nAbout Us\n\nStratascale, an SHI company, brings together the benefits of 31 years' experience delivering the very best technologies with a fresh consultative approach to designing, delivering and supporting the technology our customers need to transform their business. We call it Digital Agility.\n\nTo learn more about Stratascale visit our website: https://stratascale.com/\n\nResponsibilities\n\nIncludes but not limited to:\n Demonstrates leadership to ensure that Stratascale’s recommended solutions are comprehensive, achieve customer expectations, and meet business objectives  Engage with multiple layers of contacts within an organization to gain insights into the client’s environment  Translates the clients’ business and technical objectives into solutions  Act as liaison between client stakeholders and Stratascale subject matter experts  Position Stratascale services and drive the development of supporting documentation  Accountable to manage opportunities and engage specialty resources to drive multi-faceted solution development  Focused on delivering a world class customer experience  Participate in account planning and execution  Ongoing training and learning to understand and position Stratascale’s service offerings  Territorial alignment with strategic OEM partners  Educate and develop sales teams on technical selling, product training, Stratascale services, and technology trends \n\nQualifications\n Bachelor’s degree or equivalent work experience  Proficient with Microsoft Office Products Visio, PowerPoint, Excel, Word  7 years + client-facing experience working on one or more complex data center, cloud, security, network infrastructure solutions  Experience supporting enterprise accounts desired  Familiarity with the RFP process  Conceptual understanding around Disaster Recovery, Business Continuity, High Availability Solutions, and Virtualization technologies  Expertise in mainstream technologies including Dell, NetApp, HPE, Cisco, Palo Alto, Pure Storage, Azure and AWS  Experience with Public and Private Cloud Solutions \n\nRequired Skills\n Possess a real passion for technology  Outstanding written and verbal communication  Able to build relationships with customers  Proactive mindset  Excellent Presentation Skills  Ability to work effectively, add value as a team member and assume a leadership role for the team.  Ability to train and disseminate information within an Area or Operation.  Ability to resolve and close complex technical and selling situations  Ability to work effectively within all levels of an organization, both internally and externally  Ability to work both individually and in a team environment  Must be results driven with a strong sense of urgency  Attention to detail, organization, and follow up skills are critical  Initiative to research and resolve problems with a positive attitude  Exceptional time management  Strong documentation skills to include system/network diagrams and presentations  Highly organized \n\nUnique Requirements\n Travel to client locations required up to 25%  Extended hours are required to complete some special projects \n\nAdditional Information\n The estimated annual pay range for this position is $175,000 - $250,000 which includes a base salary and bonuses. The compensation for this position is dependent on job-related knowledge, skills, experience, and market location and, therefore, will vary from individual to individual. Benefits may include, but are not limited to, medical, vision, dental, 401K, and flexible spending.  Equal Employment Opportunity – M/F/Disability/Protected Veteran Status \n\n Job Wrapping 1 \n\n Job Wrapping 2", "Years Experience": "31 years\n7 years", "Years Context": "....r the benefits of 31 years' experience delivering the very best technologies with a fresh consultative approach to designing, ....\n....oint, Excel, Word  7 years + client-facing experience working on one or more complex data center, cloud, security, network inf....", "Skills": "git(2)\nAWS(1)"}, {"Date Added": "01/25/2023", "Job ID": "3452443904", "URL": "https://www.linkedin.com/jobs/view/3452443904/", "Job Title": "IT Systems Engineer", "Company": "Acumen Pharmaceuticals, Inc.", "Description": "LocationRemote with a preference for candidates located in EST or CST time zone\nRole DescriptionAcumen Pharmaceuticals is searching for an IT Systems Engineer to join our IT team. This is an opportunity to come in on the ground floor of building a great company focused on a critical unmet medical need, Alzheimer’s Disease.\nThe position will support the IT department by resolving help desk tickets and answering employee questions regarding their PCs, software, phones, and other online systems.\nResponsibilitiesMaintains and manages the help desk ticketing system and tickets in the queue.Sets up new employees’ accounts and machines.Acquires and deploys licenses for existing software and products when needed.Responds to employees’ questions regarding M365, Microsoft Office, SharePoint, OneDrive, and Microsoft Teams.May be assigned other projects and tasks by the Director of IT that are aligned with department goals.\nKnowledge & Skills Previous experience frequently working with and troubleshooting in the following systems required: Intune Mobile Device Management (MDM), M365, and AzureFamiliarity with the following systems: SharePoint and OneDrive, Remote Software, Windows 10/11, Microsoft Office 365, and Microsoft Teams\n RequirementsAt least 2 years of previous IT experience in a professional setting required.IT and/or related degree/certifications in IT related industry preferred.Excellent communication skills.\nCompensation and BenefitsCompetitive base salary, eligibility for an annual incentive bonus and eligibility to participate in company stock option plan. Competitive benefits package including health, dental, vision, life insurance, 401K and paid time off.\nAbout Acumen PharmaceuticalsAcumen Pharmaceuticals, Inc. is a public company (NASDAQ: ABOS) with offices in Charlottesville, VA and Carmel, IN. Acumen is developing targeted therapies for the safe and effective treatment of Alzheimer’s Disease and related neurodegenerative diseases. Acumen’s lead program, ACU193, is a monoclonal antibody which binds to amyloid beta oligomers which are widely acknowledged to be major mediators of Alzheimer’s Disease pathology. Acumen has initiated human clinical studies of ACU193 in 2021 and is seeking to add key contributors to support the development of ACU193 and the growth of the company.\nEqual Employment OpportunityAcumen Pharmaceuticals provides equal employment opportunities to all employees and applicants without regard to race, color, religious creed, sex, national origin, ancestry, citizenship status, pregnancy, childbirth, (or related medical conditions, including, but not limited to lactation), physical disability, mental and/or intellectual disability, age, military status or status as a Vietnam-era or special disabled veteran, marital status, registered domestic partner or civil union status, gender (including sex stereotyping and gender identity or expression), medical condition (including, but not limited to, cancer related or HIV/AIDS related), genetic information, sexual orientation or any other characteristic protected by applicable federal, state and local law.\nAccommodation Of DisabilitiesAcumen Pharmaceuticals is committed to providing reasonable accommodation for qualified applicants and employees with a disability (including veterans with a disability), unless such accommodation would cause an undue hardship.", "Years Experience": "2 years", "Years Context": "....quirementsAt least 2 years of previous IT experience in a professional setting required.IT and/or related degree/certification....", "Skills": "express(1)"}, {"Date Added": "01/25/2023", "Job ID": "3450765310", "URL": "https://www.linkedin.com/jobs/view/3450765310/", "Job Title": "Jr/Mid Software Engineer", "Company": "Allegis Group", "Description": "Jr./Mid. Developer \n\n 6-Month Contract to Hire \n\n 100% remote \n\n Job Description \n\nOur client is looking for someone who designs, modifies, develops, writes, and implements software programming applications. Supports and/or installs software applications/operating systems. Participates in the testing process through test review and analysis, test witnessing and certification of software.\n\nAs a member of the team, Enterprise Applications, the software engineer provides:\n Technical support for the client’s company, develop new applications and implement vendor solutions, as well as enhance and maintain existing applications in SASS. Review code and provide feedback relative to best practices and improving performance. Conduct design and code reviews to ensure code meets best practice guidelines, unit testing, security, and scalability and maintainability guidelines. Troubleshoot production support issues, identify the root cause issue, and work to solve the problem permanently. Contribute to the design and architecture to enable secure, scalable, and maintainable software and should be able to clearly articulate the implications of design/architectural decisions, issues and plans to technology leadership. Drive a quality mindset within the team and demonstrates ability to work in a collaborative team environment. Design and implement innovative solutions, reusable components and patterns, frameworks and libraries to meet business needs. Exhibit excellent problem-solving skills with strong aptitude in appreciating the focus, scope and impact of the work in a much wider and forward-looking software landscape. Ability to demonstrate on-time delivery, excellent communication, and a positive go-getter attitude.\n\n Top Skills' Details \n Proven experience with Java/J2EE, Oracle and/or SQL Server or other databases; Oracle development tools such as Toad, SQL Developer; Git/Subversion version control systems; Automated unit testing technologies (Such as JUnit, or similar). Proven experience with MVC frameworks such as Spring, Groovy/Grails; Experience with data integration platforms such as Talend. Proven experience with Web development technologies using IntelliJ or Eclipse and web containers. Experience evaluating new tools, technologies, vendor products for possible implementation, and ability working in a collaborative team environment. Excellent organization skills, specifically with assigned tasks and use of time. Experience with Agile Methodology, XML/JSON and developing SOAP and REST webservices, Maven, Gradle, Jira, Confluence.\n\n+++ 5+ years of Java/J2EE experience building and supporting web applications; 10+ experience in backend database programming. Experience with WCAG\n\naccessibility standards/guidelines, OWASP Top Ten security vulnerabilities, and AWS, Azure cloud platforms services. Experience working with Student Information System.\n\n About TEKsystems \n\nWe're partners in transformation. We help clients activate ideas and solutions to take advantage of a new world of opportunity. We are a team of 80,000 strong, working with over 6,000 clients, including 80% of the Fortune 500, across North America, Europe and Asia. As an industry leader in Full-Stack Technology Services, Talent Services, and real-world application, we work with progressive leaders to drive change. That's the power of true partnership. TEKsystems is an Allegis Group company.\n\nThe company is an equal opportunity employer and will consider all applications without regards to race, sex, age, color, religion, national origin, veteran status, disability, sexual orientation, gender identity, genetic information or any characteristic protected by law.", "Years Experience": "5+ years", "Years Context": "....+++ 5+ years of Java/J2EE experience building and supporting web applications; 10+ experience in backend databas....", "Skills": "Java(2)\nSQL(2)\nGit(1)\nAWS(1)\nFull-Stack(1)"}, {"Date Added": "01/25/2023", "Job ID": "3448422551", "URL": "https://www.linkedin.com/jobs/view/3448422551/", "Job Title": "Software Engineer", "Company": "State Farm", "Description": "Overview\n\nDo you crave innovation and want to work for a company that is the BEST at what they do in the industry? Does the opportunity to work remote and maintaining a work life balance appeal to you? Then we have the perfect job for you! We are seeking software engineers who push the envelope and strive to create the best product possible. This position will allow you to utilize different technologies, languages, and frameworks to drive solutions while working on inclusive teams that foster diversity of thought. You will be provided opportunities via in house training programs for upskilling to support your development and career goals!\n\nCheck out what our Software Engineers have to say about working at State Farm: https://youtu.be/1t5y2PHDypI\n\nResponsibilities\n\nWe are courting a creative Software Engineer with hands on experience and a passion to explore the NEW in a high-performing effort to elevate our organization. As a full stack engineer, you will understand architectures of AWS and Azure clouds as well as across Platforms with AWS services to an emerging environment. We are big on automation, so get ready to integrate some cloud flows! Additionally, you will be working with the citizen developer as well as pro dev community to build self-sufficiency.\n\nWhat ‘s In It For You:\nWork with cutting edge technologies, languages, platforms and methods!Be part of small, self-empowered Agile teamsFlexible Hybrid work arrangement\n\nWhat Your Work Look Will Look Like:\nDevelops solutions and managing across multi-cloud architectures  Completes required coding to satisfy the defined acceptance criteria and deliver desired outcome  Leads solution design, considering risks, mitigations, performance, user experience, and testability  Assists in development of automated testing and supporting code as necessary  Utilizes agile software development practices, data and testing standards, code reviews, source code management, continuous delivery, and software architecture  Considers applying emerging technology solutions to increase efficiency and effectiveness, expectation of continuous innovation  Resolves problems that result in a decreased time to market; improves quality, enhances flexibility, and embraces the solution provider mindset  Provides input into overall testing plan; contributes to test approach and scenarios for requirements  Provides product and/or process expertise necessary to support design, development, testing and execution of solutions  Fosters Low Code Community  \n\nQualifications\n\nCompetitive candidates will bring the following required skills:\n5 years relevant experience with software development or Cloud Solutions Architect Utilizing application architecture to design solutions for complex, integrated solutions   Ability to quickly adapt to a changing and fast-paced agile development environment  A proven willingness to learn and use new technologies  Provides highest level of support for problem and issue resolution  \n\nAdditional skills desired:  \nExperience with the Microsoft Power Platform  Experience with API web services development  Experience with Microsoft Azure and AWS  Use of modern DevOps tools such as Azure DevOps  Cloud Solutions Architect certifications and experience Experience with Microsoft365 automation/capabilities as well as Dynamics 365\n\nJoin State Farm!\n\nAs a Fortune 50 company, we hire the best employees to serve our customers, making us a leader in the insurance and financial services industry. State Farm embraces diversity and inclusion to ensure a workforce that is engaged, builds on the strengths and talents of all associates, and creates a Good Neighbor culture.\n\nWe offer competitive benefits and pay with the potential for an annual financial award based on both individual and enterprise performance. Our employees have an opportunity to participate in volunteer events within the community and engage in a learning culture. We offer programs to assist with tuition reimbursement, professional designations, employee development, wellness initiatives, and more!\n\nVisit our Careers page for more information on our benefits, locations and the process of joining the State Farm team!\n\nREMOTE: Qualified candidates (outside of hub locations listed below) may be considered for 100% remote work arrangements based on where a candidate currently resides or is currently located.\n\nHYBRID: Qualified candidates (in or near hub locations listed below) should plan to spend time working from home and some time working in the office as part of our hybrid work environment.\n\nHUB LOCATIONS: Dunwoody, GA; Richardson, TX; Tempe, AZ; or Bloomington, IL\n\nSPONSORSHIP: Applicants are required to be eligible to lawfully work in the U.S. immediately; employer will not sponsor applicants for U.S. work authorization (e.g. H-1B visa) for this opportunity\n\nFor Los Angeles candidates: Pursuant to the Los Angeles Fair Chance Initiative for Hiring, we will consider for employment qualified applicants with criminal histories.\n\nFor San Francisco candidates: Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n\nFor Colorado candidates:\n\nSalary Range: $69,114.50-$137,000\n\nCompetitive Benefits including:\n401k PlanHealth InsuranceDental/Vision plansLife InsurancePaid Time OffAnnual Merit IncreasesTuition ReimbursementHealth InitiativesFor more details visit our benefits summary page\n\nSFARM\n\n", "Years Experience": "5 years", "Years Context": "....5 years relevant experience with software development or Cloud Solutions Architect Utilizing application ar....", "Skills": "full stack(1)\nAWS(3)\nios(1)"}, {"Date Added": "01/25/2023", "Job ID": "3388970233", "URL": "https://www.linkedin.com/jobs/view/3388970233/", "Job Title": "Java SRE / 100% Remote / Full-time + Equity", "Company": "Motion Recruitment", "Description": "This very well-known travel eCommerce company is looking for a highly experienced Principal Site Reliability Engineer (AWS) with expertise with experience working with high-traffic, production deployments, to Amazon Web Services to join our world-class engineering team, responsible for powering the most critical features of our globally known web site and mobile applications, operating across 43 markets and 22 languages, servicing our 490 million monthly active users.\n\nAs a Principal Site Reliability Engineer (AWS) you will be expected to work with engineers across the B2C Supply Engineering team and internal platform teams in developing or integrating necessary tooling and monitoring to ensure that the teams can maintain target service level objectives. You will also play an active role in on-going efforts to migrate existing on-premise services into AWS, driving cloud-first best practices.\n\nRequired Skills & Experience\n12+ years of experience in commercial software development including leadership and operations experienceStrong understanding of AWS technologies (e.g. EKS, ECS, CDK, RDS, Dynamo)Experience with production Cloud deployments and integrated CI/CD pipelinesExperience with Kubernetes and Microservices-based architectureStrong Java background, including developing and debugging highly-concurrent, high-throughput systems and application development Desired Skills & Experience\nWorked in ecommerce previously Familiarity with Hive / Hadoop / Spark / SnowflakePast experience with datacenter-to-cloud migrationsFamiliarity with RESTful APIs and GraphQLExperience with Terraform and AtlantisExperience with Apache Solr and/or ElasticSearchExperience with Kafka, ActiveMQExperience with Nodejs, ES6, and front-end technologies like ReactExperience with Istio The Offer\nCompetitive Salary\nYou Will Receive The Following Benefits\nEquityBonusMedical Insurance & Health Savings Account (HSA)e401(k)Paid Sick Time Leave Applicants must be currently authorized to work in the United States on a full-time basis now and in the future.\n\nPosted By: Mickey Burke\n\n", "Years Experience": "12+ years", "Years Context": "....12+ years of experience in commercial software development including leadership and operations experienceStro....", "Skills": "AWS(4)\nAmazon(1)\nJava(1)\nGraphQL(1)\nNode(1)\nfront-end(1)\nReact(1)"}, {"Date Added": "01/25/2023", "Job ID": "3450549143", "URL": "https://www.linkedin.com/jobs/view/3450549143/", "Job Title": "Programmer Support, and Administration - Symitar / Episys", "Company": "Modis", "Description": "Position OverviewThe Sr. Programmer Analyst will be responsible for ensuring the efficient and accurate operation of the Company’s core operating systems and designated third party processing systems. Additional duties include, but are not limited to, assigned projects tasks, core maintenance, quality controls, technology/job script evaluations, implementation of hardware/software, report creation, troubleshooting (all levels), and afterhours on call responsibilities.As a senior, this position emphasis’s the individuals advanced knowledge of programming related to the core and third-party systems. The senior has the ability to function as an independent contributor with little to no guidance or direction from their management team in regard to programming efforts. In addition, the Sr. Programmer will support the training effort and development of their peers and those in the Programmer/Analyst and System Analyst roles.\nEssential FunctionsSenior Programming, Support, and Administration Act as a resource for peer and other technology team members, supporting questions/concerns regarding core and third party applications. Provide training and guidance to non-senior programmer/analyst roles as needed.Perform 2nd level review and approval for programming changes/edits as per our change management practices.Independently assist in projects requiring complex programming to support conversions, integrations, enhancements, and mergers.Participate in advanced troubleshoot efforts and problem-solving initiatives.Act as project leader for annual core system and third-party system release updates.Support vendor management and information security due diligence as needed.Work with third-party vendors on various projects, issues, and other matters as assigned. Collaborate with cross departmental teams and management on special assignments.Partner with other Technology areas on project management, automation enhancements, end user support, efficiency efforts, and other issues as defined.Support the data analytics efforts, importing/updating data and creating dash boards as needed.Provide excellent verbal and written communication skills to appropriately explain programming/technology components to non-programming personnel.Act as an independent contributing resource (with minimal support from direct management) for members of technology leadership to call upon for support outside of traditional channels. Programming, Support, and Administration Ensure successful completion of end of day, month, quarter and year end processing.  Troubleshoot core/third party system related problems occurring during processing, or issues reported by end users.Analyze, document, and recommend solutions as corrective actions are initiated.Develop, implement and maintain Symitar PowerOn programs.Responsible for following change management and quality control procedures. Assist in projects for all mergers, product enhancements, new product/services creation, and third part integrations.Responsible for supporting software releases, system upgrades, file expansions and interfaces. Respond to end users requests for reports and data exports.Maintain security of systems at all times.Responsible for assisting in disaster recovery preparation and planning.Support maintenance surrounding server(s) that house the core operating system in collaboration with Information System/Security department.Prepare recurring and ad-hoc reports for management.Support programming efforts surrounding the development, implementation, and maintenance for assigned Sub -Core/Third Party systems.Utilize internal ticketing system to respond to incoming requests, track issues, and document resolutions.Maintain general understanding of end user operations surrounding supported core and third part systems.Adhere to policies, procedures, best practices, and core values.OtherParticipate in rotating On Call schedule will be required to be available to troubleshoot technology issues before/after normal business hours via a VPN from home or remote location. Participate in special assignments and projects as requested by management.Assist in all other duties as assigned.QualificationsKnowledge & Experience: Applicants must possess the following qualifications or an equivalent combination of education and experience:Education: 4 year degree in a technical or related areaExperience:  5 years of experience programming preferredDesired experience: Programming Symitar Episys", "Years Experience": "4 year\n5 years", "Years Context": "...., month, quarter and year end processing.  Troubleshoot core/third party system related problems occurring during processing,....\n....erience:Education: 4 year degree in a technical or related areaExperience:  5 years of experience programming preferredDesire....", "Skills": ""}, {"Date Added": "01/25/2023", "Job ID": "3450427244", "URL": "https://www.linkedin.com/jobs/view/3450427244/", "Job Title": "Python Developer", "Company": "hackajob", "Description": "Hackajob has partnered with a leading, trusted source of enterprise-grade market intelligence and performance metrics in the mobile app ecosystem.Since being founded in 2013, this organization has seen a 65% growth year-over-year with employee headcount also increasing over 50% as international growth has been successful which supported them raising $45 Million in 2020.They are currently looking for backend python developers of various levels to continue to build on their innovative mobile performance, trend insights, and ad network products which offer enterprise-level data on the global mobile app economy.\nLocation: Boston MA-based, hybrid model\nRequirements:* At least 2 years of commercial experience using Python* Current or previous commercial experience with Django/Flask or other Python frameworks* Expertise with Typescript/Angular/React\nThey also offer a comprehensive benefits package, if you're interested in finding out more about this fantastic opportunity please get your application in and we can arrange a call.", "Years Experience": "2 years", "Years Context": "....as seen a 65% growth year-over-year with employee headcount also increasing over 50% as international growth has been success....\n....rements:* At least 2 years of commercial experience using Python* Current or previous commercial experience with Django/Flask ....", "Skills": "python(1)\nPython(2)\nReact\n(1)"}]