[{"jobId": "3240000386", "title": "CPU Design Verification Engineer", "company": "Accenture", "description": "We Are:\n\nThe Silicon Design group is a diverse team of world class silicon engineers. We have 100+ years of cumulative hands-on experience in architecture, logic design, verification, physical design, emulation and firmware. We use the latest silicon technologies and processes to help our clients create well-designed solutions to highly complex challenges. We are designing and developing next-generation, high performance SoCs, supporting our clients in their drive to deliver their product vision to their users. We are involved in all aspects of chip design from definition and architecture through to verification and signoff. Accenture engineers are true “Silicon to SW” Partners, allowing a new breed of companies in the semiconductor ecosystem to innovate in an unparalleled time to market.\n\nYou Are:\n\nAn experienced SoC Design Verification Engineer able to provide design verification services for multi CPU/DSP SoC.\n\nThe Work:\n\nTestbench development - System Verilog UVM and C tests\n\nIntegration/development of C tests/APIs and SW build flow\n\nIntegration/development of UVM mailboxes and HW/SW communication components\n\nTest plan development\n\nPower Aware testbench development and simulations\n\nSeamless porting between simulation/emulation/prototyping platforms\n\nRegression setup and debug for RTL/Gate Level Netlist/UPF PA sim/Emulation/Proto\n\nCoverage collection and closure\n\nWorking with cross functional teams (DV/Arch/Design/FW) to identify coverage scope\n\nEngage with the team to drive continuous improvement to the verification environment to find more bugs and improve coverage\n\nWork as a team to grow together.\n\nMentor and coach junior team members\n\nHere’s what you need:\n\nA minimum of five years of experience with CPU Design Verification\n\nBachelor’s Degree or equivalent (12 years) work experience (If an, Associate’s Degree with 6 years of work experience)\n\nBonus points if:\n\nExperience with ARM Cortex\n\nIn-depth knowledge of digital logic design, chip architecture and microarchitecture\n\nExperience in developing TestPlan/testbenches, SystemVerilog/UVM/C-based TestBench, and writing/debugging tests\n\nExperience with advanced verification techniques such as different booting verification, end-to-end verification; multiple CPUs verification as part of the IP is desirable.\n\nExperience in ARM AMBA protocols; AXI4, AHB and APB.\n\nTeam player with excellent communication skills and be able to work independently on the verification efforts for a block/area of the design\n\nCompensation for roles at Accenture varies depending on a wide array of factors including but not limited to the specific office location, role, skill set and level of experience. As required by local law, Accenture provides a reasonable range of compensation for roles that may be hired in California, Colorado, New York City or Washington as set forth below and information on benefits offered is here.  \n\nRole Location: Range of Starting Pay for role\n\nCalifornia: $67,900-$163,000\n\nColorado: $67,900-$163,000\n\nNew York City: $78,600- $188,600\n\nWashington: $72,300- $173,500\n\nWhat We Believe\n\nWe have an unwavering commitment to diversity with the aim that every one of our people has a full sense of belonging within our organization. As a business imperative, every person at Accenture has the responsibility to create and sustain an inclusive environment.\n\nInclusion and diversity are fundamental to our culture and core values. Our rich diversity makes us more innovative and more creative, which helps us better serve our clients and our communities. Read more here\n\nEqual Employment Opportunity Statement\n\nAccenture is an Equal Opportunity Employer. We believe that no one should be discriminated against because of their differences, such as age, disability, ethnicity, gender, gender identity and expression, religion or sexual orientation.\n\nAll employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.\n\nAccenture is committed to providing veteran employment opportunities to our service men and women.\n\nFor details, view a copy of the Accenture Equal Opportunity and Affirmative Action Policy Statement.\n\nRequesting An Accommodation\n\nAccenture is committed to providing equal employment opportunities for persons with disabilities or religious observances, including reasonable accommodation when needed. If you are hired by Accenture and require accommodation to perform the essential functions of your role, you will be asked to participate in our reasonable accommodation process. Accommodations made to facilitate the recruiting process are not a guarantee of future or continued accommodations once hired.\n\nIf you would like to be considered for employment opportunities with Accenture and have accommodation needs for a disability or religious observance, please call us toll free at 1 (877) 889-9009, send us an email or speak with your recruiter.\n\nOther Employment Statements\n\nApplicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States.\n\nCandidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.\n\nJob candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.\n\nThe Company will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. Additionally, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the Company's legal duty to furnish information.\n\n", "years experience": [], "years context": ["ineers. We have 100+ years of cumulative hands-on experience in architecture, logic design, verification, physical design, emu", "A minimum of five years of experience with CPU Design Verification", "ee or equivalent (12 years) work experience (If an, Associate’s Degree with 6 years of work experience)"], "skills": ["git", "express", "express"], "listedAt": 1674558915000}, {"jobId": "3449241095", "title": "Retail Sales Associate", "company": "Burlington Stores, Inc.", "description": "LOCATION 1485 Highway 138 SE Conyers GA US 30013\n\nOverview\n\nIf you want an exciting job with one of the largest off-price retail stores in the nation, join the Burlington Stores, Inc. team as a Retail Sales Associate! Are you an outgoing, upbeat, people-person with great organizational skills? Would you thrive in a high-energy environment where associates work together to drive results? Is it important to you to make a difference in the community where you live and work? If you answered yes, then this may be the right opportunity for you.\n\nRetail Sales Associates are important ambassadors of the Burlington brand, at the front lines in our mission to provide world-class service to our customers. You’ll be responsible for greeting and assisting customers, maintaining a neat, organized and clean sales floor, and supporting the management team with day-to-day store operations. Retail Sales Associates may be assigned to work in any or all of the following departments: Ladies, Men, Youth, Sportswear, Shoes, Home, or Baby Depot.\n\nResponsibilities\nAssisting customers in locating merchandise when neededAssisting in floor moves, merchandising, display maintenance, and housekeepingAssisting in ringing up sales at registers and/or bagging merchandisePerforming other tasks as assigned by manager from time-to-time\nCandidates must be able to work a flexible schedule; including nights, weekends and holidays as required.\n\nIf you…\n\n…are excited to deliver great values to customers every day;\n\n…take a sense of pride and ownership in helping drive positive results for a team;\n\n…are committed to treating colleagues and customers with respect;\n\n…believe in the power of diversity and inclusion;\n\n…want to participate in initiatives that positively impact the world around you;\n\nCome join our team. You’re going to like it here!\n\nYou will enjoy a competitive wage, flexible hours, and an associate discount. Part-time associates, based on hours worked, may be eligible for Burlington’s benefits package which includes dental and vision coverage, and including life insurance. Part-time associates may also be eligible for paid time off, paid holidays and a 401(k) plan.\n\nWe are a rapidly growing brand, and provide a variety of training and development opportunities so our associates can grow with us. Our store teams work hard and have fun together! Burlington associates make a difference in the lives of customers, colleagues, and the communities where we live and work every day. Burlington Stores, Inc. is an equal opportunity employer committed to workplace diversity.\n\nLocation US-GA-Conyers\n\nPosting Number 2022-191252\n\nAddress 1485 Highway 138 SE\n\nZip Code 30013\n\nWorkplace Type On-Site\n\nPosition Type Regular Part-Time\n\nPosted Date 4 weeks ago (12/29/2022 12:58 PM)\n\nCareer Site Category Store Associate\n\nPosition Category Store Associate\n\nEvergreen Yes\n\nMin USD $9.00/Hour\n\nMid USD $9.00/Hour", "years experience": [], "years context": [], "skills": [], "listedAt": 1674495542000}, {"jobId": "3451491420", "title": "Commercial Parts Pro", "company": "Advance Auto Parts", "description": "Job Description\n\nJob Description\n\nProfessional level sales position capable of supporting advanced functions on the commercial side of the business. Position is responsible for profitable growth of the commercial business via customer retention and growth. Position partners with GM to manage Team Members. The role has expert knowledge of automotive system and part knowledge. The role has the ability to source from numerous places including special order, FDO, second source, etc. The role has the ability to direct the drivers to ensure timely and accurate delivery. Position is full time.\n\n \n\nPrimary Responsibilities\n Maintain commercial customer relationships Provide GAS2 selling experience commercial customers Achieve personal / store sales goals and service objectives Provide day-to-day supervisory support for Team Members Collaborate with GM on coaching and developmental needs for Team Members Dispatch drivers ensuring delivery standards are achieved Maintain commercial stocking programs Build and maintain a network of second source suppliers\n \n\nSecondary Responsibilities\n Maintain core bank and commercial returns Maintain commercial credit accounts Partner with GM to ensure proper driver coverage\n \n\nSuccess Factors\n Friendly communication Ability to locate and stock parts Safety knowledge and skills Operating inventory systems and store equipment Parts and automotive system knowledge skills Operating POS and Parts lookup systems ASE P2 certified or ASE ready equivalent Advanced solution, project and product quality recommendation ability Ability to source from numerous places including special order, FDO, second source, etc. Advanced selling skills for commercial customers Ability to multi-task and remain organized\nEffective communication, listening and problem solving skills\n\nEssential Job Skills Necessary for Success as a Commercial Parts Pro\n Working knowledge of automotive systems, and diagnostic ability to include: internal engine, suspension, brakes, electronic, exhaust, etc. Speak and write English (Spanish a plus); communicate effectively and build strong relationships with customers, peers and management Ability to read and interpret documents such as safety rules, operating and maintenance instructions, parts catalogs, and procedure manuals; ability to write simple correspondence Understand and execute instructions furnished in written, oral, or diagram form Successfully complete the Parts Knowledge Assessment Use basic math accurately: add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals Use Microsoft software effectively (Word, Excel required) Strong organizational skills Understand Commercial profitability concepts, including knowledge of competition, market opportunities, and customer prioritization (may work with the Commercial Account Manager to determine pricing discounts for specific Commercial customers) Ability to work an assortment of days, evenings, and weekends as needed\n \n\nPrior Experience that Sets a Commercial Parts Pro up for Success \n\nA minimum of 3 years of prior automotive parts experience preferred\n\nProven sales ability with past experience in fulfillment of customer transactions\n\nFormal or informal experience leading teams, including supervising daily tasks, and working together to achieve goals\n\nEducation\n\nHigh school diploma or general education degree (GED)\n\nCertificates, Licenses, Registrations\n\nASE Certification Preferred, But Not Required\n\nPhysical Demands \n\nThe physical demands and work environment described here are representative of those that must be met by an employee to successfully perform the essential functions of this job, with or without reasonable accommodation. While performing the duties of this job, the employee will predominantly be walking or standing. The employee is required to be able to talk and hear, and use hands and fingers to handle or feel; reach with hands and arms; climb or balance; and stoop, kneel, crouch, or crawl. The employee must frequently lift and/or move up to 50 pounds and occasionally lift and/or move up to 100 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, depth perception, and ability to adjust focus.\n\nWork Environment\n\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job, with or without reasonable accommodation. While performing the duties of this job, the employee is usually working inside; however, they will occasionally be outside and exposed to various weather conditions while performing such tasks as installing batteries and wiper blades. The employee is also occasionally exposed to moving mechanical parts; high, precarious places; toxic or caustic chemicals; risk of electrical shock; explosives; and vibration. The noise level in the work environment is usually moderate.\n\nPosition is eligible for sales commission based on individual or store performance.\n\nCalifornia Residents Click Below For Privacy Notice\n\nhttp://www.worldpaccareers.com/uploads/2/4/0/4/24047148/advance_auto_parts_--_california_candidate_privacy_notice.pdf\n\nAAPRTL\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age national origin, religion, sexual orientation, gender identity, status as a veteran and basis of disability or any other federal, state or local protected class.", "years experience": [], "years context": ["A minimum of 3 years of prior automotive parts experience preferred"], "skills": [], "listedAt": 1674516314000}, {"jobId": "3452352812", "title": "Java - Lead SaaS Engineer (remote)", "company": "Addison Group", "description": "Direct Hire remote Lead SaaS Engineer opportunity available for a fast-growing tech company\n responsible for building and leading a world class engineering teamAccountable for executing roadmap of SaaS division Strategize with CTO on solutionsWorking in agile methodologiesDegree is required5+ years as a Full Stack Developer experienced in Java Spring Boot and Hibernate on the backend, and Vue, React, or Angular on the frontend\ncompensation $175K-$220K + equity", "years experience": [], "years context": ["Degree is required5+ years as a Full Stack Developer experienced in Java Spring Boot and Hibernate on the backend, and Vue, Re"], "skills": ["Full Stack", "Java", "React", "frontend"], "listedAt": 1674579518000}, {"jobId": "3450054298", "title": "Data Center Superintendent", "company": "Jobot", "description": "Come work for a top GC in the US!\nThis Jobot Job is hosted by Dan Miller\nAre you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.\nSalary $170,000 - $220,000 per year\nA Bit About Us\nThe Superintendent is responsible for field operations on the project assigned in order to achieve timely and profitable completion of each project. The Superintendent directly supervises field labor force, including laborers/craft workers. This position must demonstrate strong leadership, organizational and time management skills, as well as have strong communication and client service skills.\n\n\nWhy join us?\n\n Top GC  Large Projects Great Pay & Benefits Job Stability\nJob Details\n + years of construction experience working with ground-up Data Centers  B.S. Degree in Construction Management, or a related field, is preferred \nWhat you will be doing\n Supervising foremen, carpenters and laborers  Mentoring Junior Staff Provide Leadership\nInterested in hearing more? Easy Apply now by clicking the \"Apply\" button.\n", "years experience": [], "years context": ["0,000 - $220,000 per year", " + years of construction experience working with ground-up Data Centers  B.S. Degree in Construction Managem"], "skills": [], "listedAt": 1674577667000}, {"jobId": "3450038760", "title": "Veterans - Entry Level Software Developer", "company": "FDM Group", "description": "Are you a military veteran with the drive to succeed in fast-paced technical environments? Do you communicate well, possess outstanding critical thinking skills, and have a strong aptitude for working in teams? Then FDM wants to launch your civilian career as a Technical Consultant.\nAbout the FDM Veterans Career Development ProgramFDM’s Veterans Career Development Program is a great way for veterans to transition into corporate careers. We recruit and train qualified military veterans aspiring to become IT and business professionals. Technology makes the world a better place and we believe passion, drive and curiosity are what you need to have a successful career in tech. This is why we do not require any previous experience nor college degree to join.\nThe program begins with training in one of our career streams in business and technology that are in high demand in the job market. We will provide you with the industry-specific technical and professional skills you need in your chosen stream, after which you will start working as an FDM Consultant with our globally recognized clients.\nUpon completion of the program, many see their journey with FDM culminating in an accelerated career progression, better placing them to apply for senior roles within the industry.\nWe are currently seeking candidates interested in building a career in a range of specialties within our Technical Pathway which include:· Software Development· Technical Operations· Cloud Computing Engineering· Business Intelligence\nMinimum Qualifications· A strong aptitude for technology and the interest and drive to expand your technical skill set.· Eager, ambitious, and adaptable to change.· Able to commit to work for FDM for a minimum of two years working as an FDM consultant following the training period.· Eligible to work in the US.\nBenefitsA chance to work for some of the most prestigious companies in the world.Opportunity to earn professional certifications related to your career path.Continuous career support and upskilling from FDM.Comprehensive and competitive benefits package.Access to a network of mentors and like-minded individuals.Relocation support (if necessary).Industry recognized paid training.\nDiversity and InclusionDiversity and inclusion are at the heart of what we value as an organization. FDM is a globally recognized organization with centers across seventeen countries globally. We are proud to celebrate our employee backgrounds consisting over 85 nationalities.\nFDM Group is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, national origin, age, disability, veteran status or any other status protected by federal, provincial or local laws.", "years experience": [], "years context": ["for a minimum of two years working as an FDM consultant following the training period.· Eligible to work in the US."], "skills": ["ios", "aws"], "listedAt": 1674572242000}, {"jobId": "3447581344", "title": "Retail Sales Associate", "company": "Jos. A. Bank Clothiers", "description": "We invest in our people and continuously work towards fostering an inspirational, inclusive, and innovative culture, so that every team member has a true sense of belonging. We help people confidently express their true selves so they can be their best. \n\nWe Have Immediate Openings – Start Right Away! \n Competitive hourly rates Flexible schedules to meet your availability! Tuition reimbursement Generous employee discount on first purchase Ongoing discounts on purchase made at any Tailored Brands store.\nWhat You Bring\n Customer service – or as we call it – culture of customer-obsession by being customer-ready and delivering a world-class experience every day Desire to learn and adapt to new programs Ability to work well and consult with retail sales associates at all levels and contribute to a positive work environment\nOur Retail Sales Associates are responsible for all aspects of the customer experience within multiple businesses (retail, rental, custom, and omni-channel) within a store location including, but not limited to:\n Engage as a member of a high-performing team through trust, commitment, and a focus on results. Build a relationship with your customer from greeting through post-sale contact. Consistently demonstrate the benchmark selling techniques for retail sales, custom clothing sales, and special occasion rentals. Continuously encourage and participate in team selling and positively impact the achievement of the store sales volume and metrics goals. Assist with visually merchandising, set up, and other store-related projects, as well as conducting merchandise stock counts. Handle the cash register, as a cashier, at the point of sale in the store.\nPhysical Requirements\n Ability to stand and walk for the majority of work shift, frequently bend, squat and twist, lift up to 50 lbs., climb a ladder to reach merchandise and or supplies, and see and distinguish between fabric patterns and colors.\nYou may have the opportunity to voluntarily work between multiple store or site locations, and across multiple brands. \n\nReasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\nOur company celebrates diversity and provides equal employment opportunity to all applicants and employees without regard to race, color, sex, sexual orientation, gender identity or expression, national origin, religion, veteran or military status, age, physical or mental disability, marital status, or any other protected status under the law.\n\nWork Locations: 00448 Marietta 3625 Dallas Hwy Sw Ste 600 Marietta 30064\n\nJob: Sales\n\nOrganization: JoS.A.Bank\n\nShift: Variable\n\nZone: South", "years experience": [], "years context": [], "skills": ["express", "express"], "listedAt": 1674536046000}, {"jobId": "3452060899", "title": "Retail Sales Specialist", "company": "O'Reilly Auto Parts", "description": "O'Reilly is now hiring Retail Sales Specialists who will provide professional services while delivering an excellent customer service experience for all customers. These team members assist Store Managers with sales, customer service, and store appearance and operations. They will also assume shift management responsibilities in the absence of the store and assistant store managers.\n\nEssential Job Functions\nEnsure all customers are served professionally by store team membersOversee counter sales to ensure team members perform customer services satisfactorilyEnsure all team members are working designated schedules and clocking in/out according to policyPerform all store closing duties, i.e. closing cash drawers, locking and securing the building and delivery vehicles, ensuring security system is on, etc.Protect company and store assets by greeting and observing customers and employees on the display floor\nQualifications\nAbility to provide outstanding, friendly, and professional customer service Retail sales experience, preferably in auto parts is desired but not requiredAutomotive systems and repair knowledge is desired but not requiredASE certification preferred\nO'Reilly takes pride in our company culture, so team members should also hold our culture values as true to their own. O'Reilly values are centered on Commitment, Dedication, Teamwork, Safety/Wellness, Enthusiasm, Expense Control, Honesty, Professionalism, Respect, Hard Work, and a Win-Win Attitude. Above all is Excellent Customer Service, which is the core of O'Reilly and the most important responsibility of our team members.\n\nBenefits\n\nAll full time team members are eligible for a benefits package that is designed to offer convenience and security to our team members and their families. Programs, resources and benefit eligibility varies based on employment status, average hours worked, location and length of service. For detailed benefits info, please click here or type http://bit.ly/ORLYBenefits in your browser.", "years experience": [], "years context": [], "skills": [], "listedAt": 1674563857000}, {"jobId": "3450052489", "title": "Senior Specialist Database Administrator", "company": "Waystar", "description": "In this role, the Sr. Specialist DBA will provide SQL Server administration, design, and development support in our diverse, fast-paced, & growing environment. The Sr. Specialist Database Administrator will also analyze system performance, database performance, system health checks, and collaborate with Application Engineering teams to tune new and existing database access interfaces. This role provides plenty of opportunity for personal growth and development, while interacting with a positive, open team that is supportive of continued knowledge sharing and team advancement.\nWhat You'll Be Doing\nPerforms system and application monitoring and alerting related to the SQL Server environment Works with the Application Engineering teams in maintaining stored procedures, indexes, etc. Automates Systems Management tasks Conducts Performance Analysis and tuning, specifically in a .NET/MS SQL environment Operationalizes new technologies introduced into the environment Coaches team members, helping them develop into more senior/experienced resources Reviews the work of team members in SQL interface/database design Works with the Business Product Owners to identify priorities for Application Development and enhancements; acquires resources for projects to fit the current and future needs of the Business Onboards new team members Participates in an on-call response rotation (24x7 environment) Additional duties as assigned \nWhat We're Looking For\nAbility to demonstrate creative thinking, advanced problem-solving, and troubleshooting Experience administering MS SQL Server (versions 2008, 2012, 2014, & 2016) Knowledge of High Availability solutions, such as Mirroring, Replication, Clustering, & Always On (Availability Groups) Understanding of database security users and roles Basic performance monitoring and analysis of SQL queries Strong teamwork, interpersonal skills, integrity, and personal responsibility Eager to learn new technologies & take personal responsibility/ownership for technical projects Ability to review data scripts and communicate feedback to teams Can effectively write performant SQL queries Understanding of data recovery techniques from backup/restore Can effectively monitor real-time transaction processing and identify issues Solves complex technical problems with little oversight Can design solutions with the overall product direction in mind Reviews the work of team members Able to plan and initiate a multi-sprint project Experience with clustered database setup Thorough understanding of database replication techniques, including Always On Can effectively communicate and guide Application Engineering teams in SQL development Deep knowledge of one or more internal SQL Server technologies Highly-specialized knowledge in the given technical or product domain Bachelor’s degree in related field or equivalent work experience \nPreferred Skills\n6+ years’ experience is preferred 4+ years’ experience in query optimization and performance tuning, using SQL Profiler and other troubleshooting tools, such as the SolarWinds Data Performance Analyzer Permissions/User Management experience is highly preferred Experience with Microsoft Azure, SSIS, SSAS, or PowerShell \nWaystar provides cloud-based technology that simplifies and unifies healthcare payments. Together, our technology, data and client support streamline workflows and improve financials for our clients, so that they can focus on their patients. We are deeply committed to living out our organizational values: honesty; kindness; passion; curiosity; fanatical focus; best work, always; making it happen; and joyful, optimistic and fun.\nWaystar products have won Best in KLAS® or Category Leader every year since 2010 and earned multiple #1 rankings from Black Book™ surveys since 2012. The Waystar platform supports more than 500,000 providers, 1,000 health systems and hospitals, and 5,000 payers and health plans. For more information, visit waystar.com or follow @Waystar on Twitter.", "years experience": [], "years context": ["6+ years’ experience is preferred 4+ years’ experience in query optimization and performance tuning, using S", "ategory Leader every year since 2010 and earned multiple #1 rankings from Black Book™ surveys since 2012. The Waystar platfor"], "skills": ["SQL", "SQL", "SQL", "SQL", "SQL", "SQL", "SQL", "SQL", "SQL", "SQL", "ios"], "listedAt": 1674576614000}]