[
  {
    "jobId": "3240000386",
    "title": "CPU Design Verification Engineer",
    "company": "Accenture",
    "description": "We Are:\n\nThe Silicon Design group is a diverse team of world class silicon engineers. We have 100+ years of cumulative hands-on experience in architecture, logic design, verification, physical design, emulation and firmware. We use the latest silicon technologies and processes to help our clients create well-designed solutions to highly complex challenges. We are designing and developing next-generation, high performance SoCs, supporting our clients in their drive to deliver their product vision to their users. We are involved in all aspects of chip design from definition and architecture through to verification and signoff. Accenture engineers are true “Silicon to SW” Partners, allowing a new breed of companies in the semiconductor ecosystem to innovate in an unparalleled time to market.\n\nYou Are:\n\nAn experienced SoC Design Verification Engineer able to provide design verification services for multi CPU/DSP SoC.\n\nThe Work:\n\nTestbench development - System Verilog UVM and C tests\n\nIntegration/development of C tests/APIs and SW build flow\n\nIntegration/development of UVM mailboxes and HW/SW communication components\n\nTest plan development\n\nPower Aware testbench development and simulations\n\nSeamless porting between simulation/emulation/prototyping platforms\n\nRegression setup and debug for RTL/Gate Level Netlist/UPF PA sim/Emulation/Proto\n\nCoverage collection and closure\n\nWorking with cross functional teams (DV/Arch/Design/FW) to identify coverage scope\n\nEngage with the team to drive continuous improvement to the verification environment to find more bugs and improve coverage\n\nWork as a team to grow together.\n\nMentor and coach junior team members\n\nHere’s what you need:\n\nA minimum of five years of experience with CPU Design Verification\n\nBachelor’s Degree or equivalent (12 years) work experience (If an, Associate’s Degree with 6 years of work experience)\n\nBonus points if:\n\nExperience with ARM Cortex\n\nIn-depth knowledge of digital logic design, chip architecture and microarchitecture\n\nExperience in developing TestPlan/testbenches, SystemVerilog/UVM/C-based TestBench, and writing/debugging tests\n\nExperience with advanced verification techniques such as different booting verification, end-to-end verification; multiple CPUs verification as part of the IP is desirable.\n\nExperience in ARM AMBA protocols; AXI4, AHB and APB.\n\nTeam player with excellent communication skills and be able to work independently on the verification efforts for a block/area of the design\n\nCompensation for roles at Accenture varies depending on a wide array of factors including but not limited to the specific office location, role, skill set and level of experience. As required by local law, Accenture provides a reasonable range of compensation for roles that may be hired in California, Colorado, New York City or Washington as set forth below and information on benefits offered is here.  \n\nRole Location: Range of Starting Pay for role\n\nCalifornia: $67,900-$163,000\n\nColorado: $67,900-$163,000\n\nNew York City: $78,600- $188,600\n\nWashington: $72,300- $173,500\n\nWhat We Believe\n\nWe have an unwavering commitment to diversity with the aim that every one of our people has a full sense of belonging within our organization. As a business imperative, every person at Accenture has the responsibility to create and sustain an inclusive environment.\n\nInclusion and diversity are fundamental to our culture and core values. Our rich diversity makes us more innovative and more creative, which helps us better serve our clients and our communities. Read more here\n\nEqual Employment Opportunity Statement\n\nAccenture is an Equal Opportunity Employer. We believe that no one should be discriminated against because of their differences, such as age, disability, ethnicity, gender, gender identity and expression, religion or sexual orientation.\n\nAll employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.\n\nAccenture is committed to providing veteran employment opportunities to our service men and women.\n\nFor details, view a copy of the Accenture Equal Opportunity and Affirmative Action Policy Statement.\n\nRequesting An Accommodation\n\nAccenture is committed to providing equal employment opportunities for persons with disabilities or religious observances, including reasonable accommodation when needed. If you are hired by Accenture and require accommodation to perform the essential functions of your role, you will be asked to participate in our reasonable accommodation process. Accommodations made to facilitate the recruiting process are not a guarantee of future or continued accommodations once hired.\n\nIf you would like to be considered for employment opportunities with Accenture and have accommodation needs for a disability or religious observance, please call us toll free at 1 (877) 889-9009, send us an email or speak with your recruiter.\n\nOther Employment Statements\n\nApplicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States.\n\nCandidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.\n\nJob candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.\n\nThe Company will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. Additionally, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the Company's legal duty to furnish information.\n\n",
    "years experience": [],
    "years context": [
      "ineers. We have 100+ years of cumulative hands-on experience in architecture, logic design, verification, physical design, emu",
      "A minimum of five years of experience with CPU Design Verification",
      "ee or equivalent (12 years) work experience (If an, Associate’s Degree with 6 years of work experience)"
    ],
    "skills": [
      "git",
      "express",
      "express"
    ],
    "listedAt": 1674558915000
  },
  {
    "jobId": "3449241095",
    "title": "Retail Sales Associate",
    "company": "Burlington Stores, Inc.",
    "description": "LOCATION 1485 Highway 138 SE Conyers GA US 30013\n\nOverview\n\nIf you want an exciting job with one of the largest off-price retail stores in the nation, join the Burlington Stores, Inc. team as a Retail Sales Associate! Are you an outgoing, upbeat, people-person with great organizational skills? Would you thrive in a high-energy environment where associates work together to drive results? Is it important to you to make a difference in the community where you live and work? If you answered yes, then this may be the right opportunity for you.\n\nRetail Sales Associates are important ambassadors of the Burlington brand, at the front lines in our mission to provide world-class service to our customers. You’ll be responsible for greeting and assisting customers, maintaining a neat, organized and clean sales floor, and supporting the management team with day-to-day store operations. Retail Sales Associates may be assigned to work in any or all of the following departments: Ladies, Men, Youth, Sportswear, Shoes, Home, or Baby Depot.\n\nResponsibilities\nAssisting customers in locating merchandise when neededAssisting in floor moves, merchandising, display maintenance, and housekeepingAssisting in ringing up sales at registers and/or bagging merchandisePerforming other tasks as assigned by manager from time-to-time\nCandidates must be able to work a flexible schedule; including nights, weekends and holidays as required.\n\nIf you…\n\n…are excited to deliver great values to customers every day;\n\n…take a sense of pride and ownership in helping drive positive results for a team;\n\n…are committed to treating colleagues and customers with respect;\n\n…believe in the power of diversity and inclusion;\n\n…want to participate in initiatives that positively impact the world around you;\n\nCome join our team. You’re going to like it here!\n\nYou will enjoy a competitive wage, flexible hours, and an associate discount. Part-time associates, based on hours worked, may be eligible for Burlington’s benefits package which includes dental and vision coverage, and including life insurance. Part-time associates may also be eligible for paid time off, paid holidays and a 401(k) plan.\n\nWe are a rapidly growing brand, and provide a variety of training and development opportunities so our associates can grow with us. Our store teams work hard and have fun together! Burlington associates make a difference in the lives of customers, colleagues, and the communities where we live and work every day. Burlington Stores, Inc. is an equal opportunity employer committed to workplace diversity.\n\nLocation US-GA-Conyers\n\nPosting Number 2022-191252\n\nAddress 1485 Highway 138 SE\n\nZip Code 30013\n\nWorkplace Type On-Site\n\nPosition Type Regular Part-Time\n\nPosted Date 4 weeks ago (12/29/2022 12:58 PM)\n\nCareer Site Category Store Associate\n\nPosition Category Store Associate\n\nEvergreen Yes\n\nMin USD $9.00/Hour\n\nMid USD $9.00/Hour",
    "years experience": [],
    "years context": [],
    "skills": [],
    "listedAt": 1674495542000
  },
  {
    "jobId": "3451491420",
    "title": "Commercial Parts Pro",
    "company": "Advance Auto Parts",
    "description": "Job Description\n\nJob Description\n\nProfessional level sales position capable of supporting advanced functions on the commercial side of the business. Position is responsible for profitable growth of the commercial business via customer retention and growth. Position partners with GM to manage Team Members. The role has expert knowledge of automotive system and part knowledge. The role has the ability to source from numerous places including special order, FDO, second source, etc. The role has the ability to direct the drivers to ensure timely and accurate delivery. Position is full time.\n\n \n\nPrimary Responsibilities\n Maintain commercial customer relationships Provide GAS2 selling experience commercial customers Achieve personal / store sales goals and service objectives Provide day-to-day supervisory support for Team Members Collaborate with GM on coaching and developmental needs for Team Members Dispatch drivers ensuring delivery standards are achieved Maintain commercial stocking programs Build and maintain a network of second source suppliers\n \n\nSecondary Responsibilities\n Maintain core bank and commercial returns Maintain commercial credit accounts Partner with GM to ensure proper driver coverage\n \n\nSuccess Factors\n Friendly communication Ability to locate and stock parts Safety knowledge and skills Operating inventory systems and store equipment Parts and automotive system knowledge skills Operating POS and Parts lookup systems ASE P2 certified or ASE ready equivalent Advanced solution, project and product quality recommendation ability Ability to source from numerous places including special order, FDO, second source, etc. Advanced selling skills for commercial customers Ability to multi-task and remain organized\nEffective communication, listening and problem solving skills\n\nEssential Job Skills Necessary for Success as a Commercial Parts Pro\n Working knowledge of automotive systems, and diagnostic ability to include: internal engine, suspension, brakes, electronic, exhaust, etc. Speak and write English (Spanish a plus); communicate effectively and build strong relationships with customers, peers and management Ability to read and interpret documents such as safety rules, operating and maintenance instructions, parts catalogs, and procedure manuals; ability to write simple correspondence Understand and execute instructions furnished in written, oral, or diagram form Successfully complete the Parts Knowledge Assessment Use basic math accurately: add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals Use Microsoft software effectively (Word, Excel required) Strong organizational skills Understand Commercial profitability concepts, including knowledge of competition, market opportunities, and customer prioritization (may work with the Commercial Account Manager to determine pricing discounts for specific Commercial customers) Ability to work an assortment of days, evenings, and weekends as needed\n \n\nPrior Experience that Sets a Commercial Parts Pro up for Success \n\nA minimum of 3 years of prior automotive parts experience preferred\n\nProven sales ability with past experience in fulfillment of customer transactions\n\nFormal or informal experience leading teams, including supervising daily tasks, and working together to achieve goals\n\nEducation\n\nHigh school diploma or general education degree (GED)\n\nCertificates, Licenses, Registrations\n\nASE Certification Preferred, But Not Required\n\nPhysical Demands \n\nThe physical demands and work environment described here are representative of those that must be met by an employee to successfully perform the essential functions of this job, with or without reasonable accommodation. While performing the duties of this job, the employee will predominantly be walking or standing. The employee is required to be able to talk and hear, and use hands and fingers to handle or feel; reach with hands and arms; climb or balance; and stoop, kneel, crouch, or crawl. The employee must frequently lift and/or move up to 50 pounds and occasionally lift and/or move up to 100 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, depth perception, and ability to adjust focus.\n\nWork Environment\n\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job, with or without reasonable accommodation. While performing the duties of this job, the employee is usually working inside; however, they will occasionally be outside and exposed to various weather conditions while performing such tasks as installing batteries and wiper blades. The employee is also occasionally exposed to moving mechanical parts; high, precarious places; toxic or caustic chemicals; risk of electrical shock; explosives; and vibration. The noise level in the work environment is usually moderate.\n\nPosition is eligible for sales commission based on individual or store performance.\n\nCalifornia Residents Click Below For Privacy Notice\n\nhttp://www.worldpaccareers.com/uploads/2/4/0/4/24047148/advance_auto_parts_--_california_candidate_privacy_notice.pdf\n\nAAPRTL\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age national origin, religion, sexual orientation, gender identity, status as a veteran and basis of disability or any other federal, state or local protected class.",
    "years experience": [],
    "years context": [
      "A minimum of 3 years of prior automotive parts experience preferred"
    ],
    "skills": [],
    "listedAt": 1674516314000
  },
  {
    "jobId": "3452352812",
    "title": "Java - Lead SaaS Engineer (remote)",
    "company": "Addison Group",
    "description": "Direct Hire remote Lead SaaS Engineer opportunity available for a fast-growing tech company\n responsible for building and leading a world class engineering teamAccountable for executing roadmap of SaaS division Strategize with CTO on solutionsWorking in agile methodologiesDegree is required5+ years as a Full Stack Developer experienced in Java Spring Boot and Hibernate on the backend, and Vue, React, or Angular on the frontend\ncompensation $175K-$220K + equity",
    "years experience": [],
    "years context": [
      "Degree is required5+ years as a Full Stack Developer experienced in Java Spring Boot and Hibernate on the backend, and Vue, Re"
    ],
    "skills": [
      "Full Stack",
      "Java",
      "React",
      "frontend"
    ],
    "listedAt": 1674579518000
  },
  {
    "jobId": "3450054298",
    "title": "Data Center Superintendent",
    "company": "Jobot",
    "description": "Come work for a top GC in the US!\nThis Jobot Job is hosted by Dan Miller\nAre you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.\nSalary $170,000 - $220,000 per year\nA Bit About Us\nThe Superintendent is responsible for field operations on the project assigned in order to achieve timely and profitable completion of each project. The Superintendent directly supervises field labor force, including laborers/craft workers. This position must demonstrate strong leadership, organizational and time management skills, as well as have strong communication and client service skills.\n\n\nWhy join us?\n\n Top GC  Large Projects Great Pay & Benefits Job Stability\nJob Details\n + years of construction experience working with ground-up Data Centers  B.S. Degree in Construction Management, or a related field, is preferred \nWhat you will be doing\n Supervising foremen, carpenters and laborers  Mentoring Junior Staff Provide Leadership\nInterested in hearing more? Easy Apply now by clicking the \"Apply\" button.\n",
    "years experience": [],
    "years context": [
      "0,000 - $220,000 per year",
      " + years of construction experience working with ground-up Data Centers  B.S. Degree in Construction Managem"
    ],
    "skills": [],
    "listedAt": 1674577667000
  },
  {
    "jobId": "3450038760",
    "title": "Veterans - Entry Level Software Developer",
    "company": "FDM Group",
    "description": "Are you a military veteran with the drive to succeed in fast-paced technical environments? Do you communicate well, possess outstanding critical thinking skills, and have a strong aptitude for working in teams? Then FDM wants to launch your civilian career as a Technical Consultant.\nAbout the FDM Veterans Career Development ProgramFDM’s Veterans Career Development Program is a great way for veterans to transition into corporate careers. We recruit and train qualified military veterans aspiring to become IT and business professionals. Technology makes the world a better place and we believe passion, drive and curiosity are what you need to have a successful career in tech. This is why we do not require any previous experience nor college degree to join.\nThe program begins with training in one of our career streams in business and technology that are in high demand in the job market. We will provide you with the industry-specific technical and professional skills you need in your chosen stream, after which you will start working as an FDM Consultant with our globally recognized clients.\nUpon completion of the program, many see their journey with FDM culminating in an accelerated career progression, better placing them to apply for senior roles within the industry.\nWe are currently seeking candidates interested in building a career in a range of specialties within our Technical Pathway which include:· Software Development· Technical Operations· Cloud Computing Engineering· Business Intelligence\nMinimum Qualifications· A strong aptitude for technology and the interest and drive to expand your technical skill set.· Eager, ambitious, and adaptable to change.· Able to commit to work for FDM for a minimum of two years working as an FDM consultant following the training period.· Eligible to work in the US.\nBenefitsA chance to work for some of the most prestigious companies in the world.Opportunity to earn professional certifications related to your career path.Continuous career support and upskilling from FDM.Comprehensive and competitive benefits package.Access to a network of mentors and like-minded individuals.Relocation support (if necessary).Industry recognized paid training.\nDiversity and InclusionDiversity and inclusion are at the heart of what we value as an organization. FDM is a globally recognized organization with centers across seventeen countries globally. We are proud to celebrate our employee backgrounds consisting over 85 nationalities.\nFDM Group is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, national origin, age, disability, veteran status or any other status protected by federal, provincial or local laws.",
    "years experience": [],
    "years context": [
      "for a minimum of two years working as an FDM consultant following the training period.· Eligible to work in the US."
    ],
    "skills": [
      "ios",
      "aws"
    ],
    "listedAt": 1674572242000
  },
  {
    "jobId": "3447581344",
    "title": "Retail Sales Associate",
    "company": "Jos. A. Bank Clothiers",
    "description": "We invest in our people and continuously work towards fostering an inspirational, inclusive, and innovative culture, so that every team member has a true sense of belonging. We help people confidently express their true selves so they can be their best. \n\nWe Have Immediate Openings – Start Right Away! \n Competitive hourly rates Flexible schedules to meet your availability! Tuition reimbursement Generous employee discount on first purchase Ongoing discounts on purchase made at any Tailored Brands store.\nWhat You Bring\n Customer service – or as we call it – culture of customer-obsession by being customer-ready and delivering a world-class experience every day Desire to learn and adapt to new programs Ability to work well and consult with retail sales associates at all levels and contribute to a positive work environment\nOur Retail Sales Associates are responsible for all aspects of the customer experience within multiple businesses (retail, rental, custom, and omni-channel) within a store location including, but not limited to:\n Engage as a member of a high-performing team through trust, commitment, and a focus on results. Build a relationship with your customer from greeting through post-sale contact. Consistently demonstrate the benchmark selling techniques for retail sales, custom clothing sales, and special occasion rentals. Continuously encourage and participate in team selling and positively impact the achievement of the store sales volume and metrics goals. Assist with visually merchandising, set up, and other store-related projects, as well as conducting merchandise stock counts. Handle the cash register, as a cashier, at the point of sale in the store.\nPhysical Requirements\n Ability to stand and walk for the majority of work shift, frequently bend, squat and twist, lift up to 50 lbs., climb a ladder to reach merchandise and or supplies, and see and distinguish between fabric patterns and colors.\nYou may have the opportunity to voluntarily work between multiple store or site locations, and across multiple brands. \n\nReasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\nOur company celebrates diversity and provides equal employment opportunity to all applicants and employees without regard to race, color, sex, sexual orientation, gender identity or expression, national origin, religion, veteran or military status, age, physical or mental disability, marital status, or any other protected status under the law.\n\nWork Locations: 00448 Marietta 3625 Dallas Hwy Sw Ste 600 Marietta 30064\n\nJob: Sales\n\nOrganization: JoS.A.Bank\n\nShift: Variable\n\nZone: South",
    "years experience": [],
    "years context": [],
    "skills": [
      "express",
      "express"
    ],
    "listedAt": 1674536046000
  },
  {
    "jobId": "3452060899",
    "title": "Retail Sales Specialist",
    "company": "O'Reilly Auto Parts",
    "description": "O'Reilly is now hiring Retail Sales Specialists who will provide professional services while delivering an excellent customer service experience for all customers. These team members assist Store Managers with sales, customer service, and store appearance and operations. They will also assume shift management responsibilities in the absence of the store and assistant store managers.\n\nEssential Job Functions\nEnsure all customers are served professionally by store team membersOversee counter sales to ensure team members perform customer services satisfactorilyEnsure all team members are working designated schedules and clocking in/out according to policyPerform all store closing duties, i.e. closing cash drawers, locking and securing the building and delivery vehicles, ensuring security system is on, etc.Protect company and store assets by greeting and observing customers and employees on the display floor\nQualifications\nAbility to provide outstanding, friendly, and professional customer service Retail sales experience, preferably in auto parts is desired but not requiredAutomotive systems and repair knowledge is desired but not requiredASE certification preferred\nO'Reilly takes pride in our company culture, so team members should also hold our culture values as true to their own. O'Reilly values are centered on Commitment, Dedication, Teamwork, Safety/Wellness, Enthusiasm, Expense Control, Honesty, Professionalism, Respect, Hard Work, and a Win-Win Attitude. Above all is Excellent Customer Service, which is the core of O'Reilly and the most important responsibility of our team members.\n\nBenefits\n\nAll full time team members are eligible for a benefits package that is designed to offer convenience and security to our team members and their families. Programs, resources and benefit eligibility varies based on employment status, average hours worked, location and length of service. For detailed benefits info, please click here or type http://bit.ly/ORLYBenefits in your browser.",
    "years experience": [],
    "years context": [],
    "skills": [],
    "listedAt": 1674563857000
  },
  {
    "jobId": "3450052489",
    "title": "Senior Specialist Database Administrator",
    "company": "Waystar",
    "description": "In this role, the Sr. Specialist DBA will provide SQL Server administration, design, and development support in our diverse, fast-paced, & growing environment. The Sr. Specialist Database Administrator will also analyze system performance, database performance, system health checks, and collaborate with Application Engineering teams to tune new and existing database access interfaces. This role provides plenty of opportunity for personal growth and development, while interacting with a positive, open team that is supportive of continued knowledge sharing and team advancement.\nWhat You'll Be Doing\nPerforms system and application monitoring and alerting related to the SQL Server environment Works with the Application Engineering teams in maintaining stored procedures, indexes, etc. Automates Systems Management tasks Conducts Performance Analysis and tuning, specifically in a .NET/MS SQL environment Operationalizes new technologies introduced into the environment Coaches team members, helping them develop into more senior/experienced resources Reviews the work of team members in SQL interface/database design Works with the Business Product Owners to identify priorities for Application Development and enhancements; acquires resources for projects to fit the current and future needs of the Business Onboards new team members Participates in an on-call response rotation (24x7 environment) Additional duties as assigned \nWhat We're Looking For\nAbility to demonstrate creative thinking, advanced problem-solving, and troubleshooting Experience administering MS SQL Server (versions 2008, 2012, 2014, & 2016) Knowledge of High Availability solutions, such as Mirroring, Replication, Clustering, & Always On (Availability Groups) Understanding of database security users and roles Basic performance monitoring and analysis of SQL queries Strong teamwork, interpersonal skills, integrity, and personal responsibility Eager to learn new technologies & take personal responsibility/ownership for technical projects Ability to review data scripts and communicate feedback to teams Can effectively write performant SQL queries Understanding of data recovery techniques from backup/restore Can effectively monitor real-time transaction processing and identify issues Solves complex technical problems with little oversight Can design solutions with the overall product direction in mind Reviews the work of team members Able to plan and initiate a multi-sprint project Experience with clustered database setup Thorough understanding of database replication techniques, including Always On Can effectively communicate and guide Application Engineering teams in SQL development Deep knowledge of one or more internal SQL Server technologies Highly-specialized knowledge in the given technical or product domain Bachelor’s degree in related field or equivalent work experience \nPreferred Skills\n6+ years’ experience is preferred 4+ years’ experience in query optimization and performance tuning, using SQL Profiler and other troubleshooting tools, such as the SolarWinds Data Performance Analyzer Permissions/User Management experience is highly preferred Experience with Microsoft Azure, SSIS, SSAS, or PowerShell \nWaystar provides cloud-based technology that simplifies and unifies healthcare payments. Together, our technology, data and client support streamline workflows and improve financials for our clients, so that they can focus on their patients. We are deeply committed to living out our organizational values: honesty; kindness; passion; curiosity; fanatical focus; best work, always; making it happen; and joyful, optimistic and fun.\nWaystar products have won Best in KLAS® or Category Leader every year since 2010 and earned multiple #1 rankings from Black Book™ surveys since 2012. The Waystar platform supports more than 500,000 providers, 1,000 health systems and hospitals, and 5,000 payers and health plans. For more information, visit waystar.com or follow @Waystar on Twitter.",
    "years experience": [],
    "years context": [
      "6+ years’ experience is preferred 4+ years’ experience in query optimization and performance tuning, using S",
      "ategory Leader every year since 2010 and earned multiple #1 rankings from Black Book™ surveys since 2012. The Waystar platfor"
    ],
    "skills": [
      "SQL",
      "SQL",
      "SQL",
      "SQL",
      "SQL",
      "SQL",
      "SQL",
      "SQL",
      "SQL",
      "SQL",
      "ios"
    ],
    "listedAt": 1674576614000
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3407411228",
    "URL": "https://www.linkedin.com/jobs/view/3407411228/",
    "Job Title": "Senior Software Engineer - REMOTE",
    "Company": "Allscripts",
    "Description": "Welcome to Veradigm! Our Mission is to be the most trusted provider of innovative solutions that empower all stakeholders across the healthcare continuum to deliver world-class outcomes. Our Vision is a Connected Community of Health that spans continents and borders. With the largest community of clients in healthcare, Veradigm is able to deliver an integrated platform of clinical, financial, connectivity and information solutions to facilitate enhanced collaboration and exchange of critical patient information.\nJob Summary\nThe purpose of this role is to understand requirements/business cases/user stories and apply computer science, engineering, and mathematical analysis to design, develop and test the application meeting the acceptance criteria. This involves understanding and applying one or more software or scripting languages.\nEssential Functions\nWork closely with analysts and other developers to ensure the solution you implement meets business needsWrite correct, well-factored code that is testable, maintainable, and demonstrates best practices within agreed upon timelinesWrite and execute test cases as needed to validate code changesWork in an agile team environment and actively participate in grooming, standups, and planning sessionsReview and provide constructive feedback on team members’ work per peer-review processSupport and troubleshoot production issues when necessary and aid operations teams to resolve issuesCreate technical specifications, documentation, and design documentation as required\nJob Requirements\nBachelor’s Degree or equivalent (Preferred)2-4 years relevant work experience (Preferred)Solid communication skillsUp to 10% travel may be required\nKnowledge, Skills And Abilities\n2+ years of experience working with the following:C#, .NET CoreSQL Server or Snowflake1+ years of experience cloud development (Azure, AWS, etc.)Azure DevOps experienceAngularExperience in test driven developmentFamiliarity with HEDIS or other healthcare quality analytics concepts preferred\nWe strongly advocate that our associates receive all CDC recommended vaccinations in prevention of COVID-19.\nVisa Sponsorship is not offered for this position.\nAt Veradigm, our greatest strength comes from bringing together talented people with diverse perspectives to support the technology needs of 180,000 physicians, 1,500 hospitals and 10,000 postacute organizations across the globe. Veradigm offers a comprehensive compensation and benefits package, including holidays, vacation, medical, dental, and vision insurance, company paid life insurance and retirement savings.\nVeradigm’ policy is to provide equal employment opportunity and affirmative action in all of its employment practices without regard to race, color, religion, sex, national origin, ancestry, marital status, protected veteran status, age, individuals with disabilities, sexual orientation or gender identity or expression or any other legally protected category. Applicants for North American based positions with Veradigm must be legally authorized to work in the United States. Verification of employment eligibility will be required as a condition of hire. Veradigm is proud to be an equal opportunity workplace dedicated to pursing and hiring a diverse and inclusive workforce.\nFrom a \"VEVRAA Federal Contractor\" We request Priority Referral of Protected Veterans\nThis is an official Veradigm Job posting. To avoid identity theft, please only consider applying to jobs posted on our official corporate site.\nThank you for reviewing this Veradigm opportunity! Does this look like a great match for your skill set? If so, scroll on down and tell us more about yourself!\n",
    "Years Experience": "2-4 years\n2+ years\n1+ years",
    "Years Context": "....alent (Preferred)2-4 years relevant work experience (Preferred)Solid communication skillsUp to 10% travel may be required....\n....2+ years of experience working with the following:C#, .NET CoreSQL Server or Snowflake1+ years of experience....",
    "Skills": "SQL(1)\nAWS(1)\nexpress(1)",
    "Remote Allowed": true
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3455733550",
    "URL": "https://www.linkedin.com/jobs/view/3455733550/",
    "Job Title": "Retail Sales – Part Time",
    "Company": "Lowe's Companies, Inc.",
    "Description": "We are happy you have taken time out of your day to check out this Retail Sales Associate opportunity with Lowe's. Do any of the following statements match your current goals?\n I'm at least 18 years old, and I want to share my whole self in an inclusive work environment I want to work for a company who welcomes and appreciates the military community I'm retired, but I still want to work part-time or full-time I currently have a job and need supplementary income I want to build a career with a company that doesn’t require a four-year degree I'm a stay-at-home parent, ready to return to work I need flexibility in my schedule because I have children or other responsibilities I'm interested in debt-free education, tuition reimbursement, or certificate programs I want to learn a skilled trade and possibly start my own company I am bilingual I love DIY projects\nWhatever your need for employment, we at Lowe's believe we can help you build a better life and career, and we are all-in to help you achieve your goals. We are hiring immediately for this role, so make sure you apply today.\nHere's what you will do in this role:\nAs a Lowe's Retail Sales Associate – Part-Time, you are the key to our customers' positive shopping experiences. You will be the smiling person who greets customers as they enter our doors or shop our aisles. You will engage customers regarding the types of projects they are working on and how you may help. You will guide shoppers to the right products or introduce them to the appropriate sales specialist who can assist. As you learn more about your department and Lowe's, you will understand which products naturally go together. It will be your responsibility to ensure that you share this knowledge with your customers. Here's an example: If a customer is looking for a lamp, do they need a shade? What about light bulbs? See, it's that simple!\nLowe's offers jobs for people who aren't interested in sitting behind a desk for hours. Instead of answering phones, you might be in the store or the garden center, walking, talking to our customers, watering plants, and restocking items. Depending on your department, some lifting (building materials, paint, or maybe mulch) may be required with or without assistance.\nWhat's in It for You?\nBeyond the chance to make a difference for customers and teammates, each day will allow you to learn, grow, and celebrate wins together with your Lowe's team. Our associates enjoy the following benefits:\n A 10% discount on everything at Lowe's Eligible for debt-free education and skilled trade programs Access to comprehensive physical, mental, and financial benefits * Opportunity to earn quarterly bonuses Flexible schedules to fit your lifestyle Career growth—over 50% of our leaders started as hourly associates\nYour Day at Lowe's\n Deliver excellent customer service Help customers find products and provide recommendations Help load customer merchandise Restock merchandise\nRequirements\n Be able to lift up to 25lbs. unassisted, or over 25lbs assisted. Possess 6 months experience operating common retail technology, smartphones, tablets, or computers. For individuals with disabilities who would like to request an accommodation, email HRServiceCenter@lowes.com.\nBilingual applicants are encouraged to apply.\n Benefits offerings change each year and eligibility varies. For the most up-to-date breakdown of what's available to you, visit MyLowesBenefits.com.\nLowe's adheres to CDC cleanliness and social distancing guidelines. Learn more at: lowes.com/l/safe.html\nBilingual, Military, and Veteran applicants are encouraged to apply.\nEEO Statement\nLowe's is an equal opportunity employer and administers all personnel practices without regard to race, color, religious creed, sex, gender, age, ancestry, national origin, mental or physical disability or medical condition, sexual orientation, gender identity or expression, marital status, military or veteran status, genetic information, or any other category protected under federal, state, or local law.",
    "Years Experience": "18 years",
    "Years Context": ".... I'm at least 18 years old, and I want to share my whole self in an inclusive work environment I want to work for a compan....\n....fferings change each year and eligibility varies. For the most up-to-date breakdown of what's available to you, visit MyLowes....",
    "Skills": "html(1)\nexpress(1)",
    "Remote Allowed": false
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3453185161",
    "URL": "https://www.linkedin.com/jobs/view/3453185161/",
    "Job Title": "Technician C",
    "Company": "AAA-The Auto Club Group",
    "Description": "Position Description\nUnder general supervision, the Service Technician C position is responsible for performing the repair and maintenance of automobile and truck vehicles for which they are fully trained. Completes routine scheduled maintenance services on automobiles and trucks as directed by manager or service consultant.\nWhat You’ll Do\nWe are an established automobile club, but we don't take our trusted reputation for granted. We earn our members' loyalty every day, with every service, phone call, and face-to-face interaction. AAA is dedicated to making sure our members have efficient, safe, and positive experiences on the road and with us, wherever they may be.\nAs a Service Technician C You Will In an efficient and productive manner, performs basic automotive repairs, adjustments and maintenance procedures as outlined on repair order for which technician is trained.Oil changes, tire replacement and repairs, general maintenance repairs, fluid exchanges, alignments, brake services are expected to be learned and performed.Drives vehicles into service bay, prepares them for and completes digital vehicle inspection.Test drives vehicles and prepares vehicle for delivery to customer after necessary repairs and maintenance.Maintains cleanliness of shop and work areas, performs other duties as necessary.\nEducation\nWHO YOU ARE\nHigh School diploma, GED or Technical school graduate, certificationMust possess valid driver’s license\nExperience\n2 years minimum experience repairing vehicles at dealership or automotive cen\nKnowledge And Skills\nKnowledge of automotive and/or truck systems, tools and technical resources and training to independently perform a variety of usually basic repairs and maintenance of automobile and truck vehicles.Understand and consistently demonstrate the proper use of equipment and tools used in such repair and maintenance and the need to maintain a clean, safe and organized work area.Ability to consistently provide exceptional customer service and improve customer service scores.\nPreferred Qualifications\nASE Certifications (or their equivalent). A4-Suspension & Steering, A5-BrakesG1-Auto Maintenance & Light Repair preferredState inspection certificate where applicableAC 609 Certification\nWHY AAA?\nWhat Makes Us Different\nYou enjoy helping others and are focused on driving results. You have lots of choices of who to work with. We help others.As a member organization, AAA is passionately committed to providing our members and customers with Value, Safety, and Total Peace of Mind in all things related to Automotive, Travel, Insurance and Member Benefits.We are focused on growth.We are 2 million plus members strong with continued job growth over the past 20 years and counting. Build your skills, experience and thrive in a company that has a demonstrated track record of stability & growth.State of the Art Repair equipmentOnline training available from industry leading strategic vendors at no cost to youASE preparation via online trainingASE Certification Exam reimbursementBonus for each ASE test/recertification passedIn the state of NC, we pay for State Inspectors LicenseWe offer a competitive Total Compensation package.  You know compensation goes way beyond take-home pay. AAA offers best in class benefits. . . excellent medical coverage, dental, vision, etc.Free AAA membershipFree uniformsFree shoesUp to 3 weeks of vacation your first year11 paid holidaysWe offer profit sharing, and 401k with matching contributions.Automatic 4% 401K employer contribution401K match of 50% up to 6% contribution(6% personal contribution @ 50% match = 3% company contribution + 4% automatic company contribution = 7% of your annual income)Hourly pay range starts at $17.32/hour (starting hourly rate based on experience)In addition to base hourly pay, Service Technician A positions are eligible for :Variable pay based on productivity: earned on every hour produced over 40 hours in a given weekAnnual Incentive OpportunityCertification Bonus OpportunityWe are committed to work-life balance.Closed SundayShorter workdays than competitor (we close at 6pm)Monday – Friday, hours are 7:30am-6pmSaturday, hours are 8am to 4pmClosed major holidays\nCOME JOIN OUR TEAM\nWe are members serving members. We are committed. We aspire to create a workplace that helps others, members and team members alike. This is What Makes Us . . . Us. Come join our team.\nAbout Car Care – At AAA Car Care, we are your preferred automotive experts providing customers with friendly, knowledgeable advice and technical expertise. With 34 stores and counting, we are the largest chains of AAA club-owned repair facilities in the USA. In our clean and conveniently located facilities, we offer a full range of automotive repair and maintenance services to AAA members and non-members. Every AAA Car Care facility is staffed with ASE-certified technicians who ensure that every car is treated with the utmost care.\nImportant Note\nACG’s Compensation philosophy is to provide a market-competitive structure of fair, equitable and performance-based pay to attract and retain excellent talent that will enable ACG to meet its short and long-term goals. ACG utilizes a geographic pay differential as part of the base salary compensation program. Pay ranges outlined in this posting are based on the various ranges within the geographic areas which ACG operates. Salary at time of offer is determined based on these and other factors as associated with the job and job level.\nThe above statements describe the principle and essential functions, but not all functions that may be inherent in the job. This job requires the ability to perform duties contained in the job description for this position, including, but not limited to, the above requirements. Reasonable accommodations will be made for otherwise qualified applicants, as needed, to enable them to fulfil these requirements.\nThe Auto Club Group, and all of its affiliated companies, is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, disability or protected veteran status.\nPrimary Location\nUnited States-Georgia-Marietta\nWork Locations\nGA-Sandy Plains Car Care Plus\nJob\nAutomotive Service/Repair\nOrganization\nCar Care\nSchedule\nFull-time\nShift\nDay\nEmployee Status\nRegular\nJob Type\nRegular\nJob Level\nIndividual Contributor\nTravel\nNo\nJob Posting\nJan 27, 2023, 8:25:04 AM",
    "Years Experience": "2 years\n20 years",
    "Years Context": "....2 years minimum experience repairing vehicles at dealership or automotive cen....\n....wth over the past 20 years and counting. Build your skills, experience and thrive in a company that has a demonstrated track r....\n.... vacation your first year11 paid holidaysWe offer profit sharing, and 401k with matching contributions.Automatic 4% 401K empl....",
    "Skills": "git(1)",
    "Remote Allowed": false
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3453726345",
    "URL": "https://www.linkedin.com/jobs/view/3453726345/",
    "Job Title": "Account Executive, LE/GE, GTS",
    "Company": "Gartner",
    "Description": "Who are we?\nGartner delivers actionable, objective insight to executives and their teams. Our expert guidance and tools enable faster, smarter decisions and stronger performance on an organization’s most critical priorities. We’ve grown exponentially since our founding in 1979 and we're proud to have nearly 16,000 associates globally that support our 14,000+ clients in more than 100 countries.\nWhat makes Gartner a great place to work?\nOur teams are composed of individuals from different geographies, cultures, religions, ethnicities, races, genders, sexual orientations, abilities and generations. We believe that a variety of experiences makes us stronger—as individuals, as communities and as an organization. That’s why we're recognized worldwide as a great place to work year after year. We've been recognized by Fortune as one of the World’s Most Admired Companies, named a Best Place to Work for LGBTQ Equality by the Human Rights Campaign Corporate Equality Index and a Best Place to Work for Disability Inclusion by the Disability Equality Index. Looking for a place to turn your big ideas into reality? Join #LifeAtGartner\nWhat we offer:\nOur people are our most valuable asset, so we invest in them from Day 1. When you join our team, you’ll have access to a vast array of benefits to help you live your life well. These resources are designed to support your physical, financial and emotional well-being. We encourage continued personal and professional growth through ongoing learning and development opportunities. Our employee resource groups, charity match and volunteer programs keep you connected to your internal Gartner community and causes that matter to you.\nThe policy of Gartner is to provide equal employment opportunities to all applicants and employees without regard to race, color, creed, religion, sex, sexual orientation, gender identity, marital status, citizenship status, age, national origin, ancestry, disability, veteran status, or any other legally protected status and to affirmatively seek to advance the principles of equal employment opportunity.\nGartner is committed to being an Equal Opportunity Employer and offers opportunities to all job seekers, including job seekers with disabilities. If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation if you are unable or limited in your ability to use or access the Company’s career webpage as a result of your disability. You may request reasonable accommodations by calling Human Resources at +1 (203) 964-0096 or by sending an email to ApplicantAccommodations@gartner.com.\nJob Requisition ID:75424\nBy submitting your information and application, you confirm that you have read and agree to the country or regional recruitment notice linked below applicable to your place of residence.\nGartner Applicant Privacy Link: https://jobs.gartner.com/applicant-privacy-policy\nFor efficient navigation through the application, please only use the back button within the application, not the back arrow within your browser.",
    "Years Experience": "",
    "Years Context": ".... great place to work year after year. We've been recognized by Fortune as one of the World’s Most Admired Companies, named a ....",
    "Skills": "",
    "Remote Allowed": false
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3453729311",
    "URL": "https://www.linkedin.com/jobs/view/3453729311/",
    "Job Title": "PL/SQL Developer",
    "Company": "InterEx Group",
    "Description": "QUALIFICATIONSEducation:Bachelor’s Degree in Computer Science or equivalent (Work Experience in lieu of Education)Knowledge/Skills/Abilities:10 years of development experience using PL/SQL8-10 years of experience with Oracle: In-depth knowledge of Oracle database objects Very good knowledge of SQL Sound knowledge of PL/SQL performance tuning, AWR, ASH analysis, and database statistics gatheringMust have good problem-solving, troubleshooting and communication skills\nPREFERRED EXPERIENCE:Good knowledge of UNIX commands, basic understanding of Shell scriptingExperience with Oracle Database 11g and aboveExperience using software development tools including source control (Git, SVN), quality management ( Agile Central), and Continuous Integration tools (Jenkins, XL Release) is a plus.Experience with Java or other object-oriented languages helpfulGood knowledge of Advanced Queuing, DBMS_SCHEDULER and setting up CRON jobs.",
    "Years Experience": "10 years\n10 years",
    "Years Context": "..../Skills/Abilities:10 years of development experience using PL/SQL8-10 years of experience with Oracle: In-depth knowledge of O....",
    "Skills": "SQL(3)\nGit(1)\nJava(1)",
    "Remote Allowed": false
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3457129382",
    "URL": "https://www.linkedin.com/jobs/view/3457129382/",
    "Job Title": "Prime Named Account Executive - MuleSoft Healthcare & Life Sciences",
    "Company": "MuleSoft",
    "Description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.\nJob Category\nSales\nJob Details\nAbout MuleSoft, a Salesforce Company\nOur mission is to help organizations change and innovate faster by making it easy to connect the world’s applications, data, and devices. Companies like Spotify, McDonald’s, and Unilever rely on MuleSoft to stay agile, deliver faster, and make the most of their IT investment with API-led connectivity. Hiring exceptional people who want to build a great company together is our number one priority, and we’re committed to providing an equal opportunity workplace where everyone is supported and inspired to do their best work. We work tirelessly to build this culture, and we’re proud to have been named the #1 Top Workplace in the Bay Area and a best place to work 6 years in a row.\nAbout Salesforce\nSalesforce, the Customer Success Platform and world's #1 CRM, empowers companies to connect with their customers in a whole new way. The company was founded on three disruptive ideas: a new technology model in cloud computing, a pay-as-you-go business model, and a new integrated corporate philanthropy model. These founding principles have taken our company to great heights, including being named one of Forbes’s “World’s Most Innovative Company” seven years in a row and #1 on the FORTUNE ‘100 Best Companies to Work For®’ List. We are the fastest growing of the top 10 enterprise software companies, and this level of growth equals incredible opportunities to grow a career at Salesforce. Together, with our whole Ohana (Hawaiian for \"family\") made up of our employees, customers, partners and communities, we are working to improve the state of the world.\nOur headcount demand is always changing as we grow; some of the locations listed here may or may not have an immediate opening at the time of your application.\nAccount Executive - MuleSoft\nMuleSoft sells into a diverse set of industries and is broken down into the following segments:\nCommercial\nMid-Market\nEnterprise\nStrategic\nKey\nEvery CIO today is being forced to evaluate their integration strategy in order to move faster and increase innovation to meet the demands of the market. Organizations are spending over $443 billion on integration work every year, yet they still can’t move fast enough to outpace competition. MuleSoft is creating a new category of software to uniquely solve this massive challenge, with our industry-leading integration platform and a maniacal focus on customer success for over 1,200 enterprises across the globe.\nWe are looking for an outcomes-oriented, highly collaborative Account Executive with an entrepreneurial spirit to help us tackle this massive market opportunity and achieve significant revenue targets. MuleSoft is one of the fastest growing enterprise software companies ever, and our Sales team is key to our explosive growth across the globe.\nYour Impact\nThis is not your standard tactical role selling a piece of software. You will be the CEO of your territory, owning and driving the go-to-market strategy, and leading the sales cycle with a cross-functional team. We are paving the way to not only change the way our customers build software, but transform the way they do business. You will sell strategic business outcomes with long-term, high growth engagements: 45 customers have $1M+ ACV, and we have a 117% dollar net retention rate.\nYour Qualifications\nDepending on the segment, the years of experience and skillset needed to be successful will vary from 5-10+ yrs of quota carrying full-cycle sales experience, software or technology experience selling to IT and business leaders preferred. In addition, a bachelor's degree is strongly preferred.\nAcross all sales teams, we are looking for the following attributes:\nConsultative selling experience\nProspecting Skills\nStrong Communication Skills\nHas a competitive Spirit\nCan collaborate and influence in a “win as a team” environment\nResourceful\nCoachable\nHas a drive for results\nIs a trusted advisor to the customers and colleagues\nEngagement\nStrong business acumen\nCan articulate ROI\nSolution Selling Ability\nStrong Discovery Skills\nObjection Handling Skills\nPlanning and Closing Skills\nAccommodations\nIf you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.\nPosting Statement\nAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits.\nSalesforce, Inc. and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce, Inc. and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce, Inc. and Salesforce.org will not pay any third-party agency or company that does not have a signed agreement with Salesforce, Inc. or Salesforce.org.\nSalesforce welcomes all.\nFor Colorado-based roles, the base salary hiring range for this position is $74,300 to $193,800.\nFor New York-based roles, the base salary hiring range for this position is $81,700 to $213,200.\nFor California-based roles, the base salary hiring range for this position is $81,700 to $213,200.\nCompensation offered will be determined by factors such as location, level, job-related knowledge, skills, and experience.\nCertain roles may be eligible for incentive compensation, equity, and benefits. More details about our company benefits can be found at the following link: https://www.salesforcebenefits.com.",
    "Years Experience": "6 years",
    "Years Context": "....best place to work 6 years in a row.....\n....ative Company” seven years in a row and #1 on the FORTUNE ‘100 Best Companies to Work For®’ List. We are the fastest growing o....\n....tegration work every year, yet they still can’t move fast enough to outpace competition. MuleSoft is creating a new category ....\n.... on the segment, the years of experience and skillset needed to be successful will vary from 5-10+ yrs of quota carrying full-....",
    "Skills": "",
    "Remote Allowed": true
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3455990603",
    "URL": "https://www.linkedin.com/jobs/view/3455990603/",
    "Job Title": "Sales and Service Rep (Hourly)",
    "Company": "Safety-Kleen",
    "Description": "Overview\n\nSafety-Kleen in Morrow, GA is looking for a CDL Route Driver (Sales and Service Representative) to operate a Class B box truck to provide onsite service for parts washer machines and sell products and services in a defined route. This role provides regularly scheduled parts cleaner service, containerized waste collection for proper disposal, and delivery of petroleum-based lubricants and other related products.\n\nSafety-Kleen, a subsidiary of Clean Harbors is the leading provider of environmental, energy and industrial services throughout the United States, Canada, Mexico and Puerto Rico. Everywhere industry meets environment, Clean Harbors is on-site, providing premier environmental, energy and industrial services. We are solving tough problems through innovation and proven methodology – come be part of the solution with us.\n\nWhy work for Clean Harbors?\nHealth and Safety is our #1 priority and we live it 3-6-5!Focus on maintaining sustainability and cleaning the Earth Recruiting Pay rangeComprehensive health benefits coverage after 30 days of full-time employment including 401K with Company matchOpportunities for growth and development for all the stages of your careerCompany paid training and tuition reimbursement\nResponsibilities\nEnsure Health and Safety is the number one priority by complying with all safe work practices, policies, and processes and always acting in a safe mannerMay visit 10-12 customer sites per daySwitch out 15- & 30-gallon drums of solutionsService parts washer machines and clean out sediment from sinksUp-sell at customer locations and generate new leads in the fieldService automotive repair, fleets, and manufacturing type businessesComplete daily scheduled services, deliveries, and pick-ups in a timely mannerComplete all required documentation and labelingFollow all local, state (provincial) and federal compliance regulations and rulesSafely operate vehicles in accordance with U.S. DOT, local, state (provincial) and federal requirementsSafely observe all corporate operating guidelines and proceduresObserve all company environmental health and safety operating guidelinesPerforms other duties as assigned\nQualifications\nClass B CDLObtain Hazmat and Tanker endorsement within 90 days of employmentBasic computer and math skillsGood written and verbal communication skillsStrong customer service skillsPerform physical functions per job requirements Successfully complete a background check, drug test, and physical, by position\nPreferred Qualifications\nHazmat and Tanker endorsementPrevious route driving or commercial driving experienceBusiness to business sales experience\nClean Harbors is an equal opportunity employer. We do not discriminate against applicants due to race, ancestry, color, sexual orientation, gender identity, national origin, religion, age, physical or mental disability, veteran status, or based on any other federal, state/provincial, or local protected class.\n\nClean Harbors is a Military & Veteran friendly company.\nSK",
    "Years Experience": "",
    "Years Context": "",
    "Skills": "",
    "Remote Allowed": false
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3455940451",
    "URL": "https://www.linkedin.com/jobs/view/3455940451/",
    "Job Title": "Sales Associate",
    "Company": "Spencer's",
    "Description": "Job Description\nThe Sales Associate is responsible for maintaining Guest Services as per Company Standard. The Sales Associate will support the Store Management Team by generating sales, conducting housekeeping, merchandising, signing, pricing, POS operations and loss prevention in adherence to all Company policies and procedures. The minimum age requirement for this position is 16. The physical demands of the job require climbing ladders, lifting up to 50 pounds and may require 8 hours of standing/walking.",
    "Years Experience": "",
    "Years Context": "",
    "Skills": "",
    "Remote Allowed": false
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3451614743",
    "URL": "https://www.linkedin.com/jobs/view/3451614743/",
    "Job Title": "Software Engineer",
    "Company": "JPMorgan Chase & Co.",
    "Description": "The Asset and Wealth Management Observability and Reliability Engineering Team is a diverse and inclusive team comprised of Software Engineers, Infrastructure Engineers, and Site Reliability Engineers with a wide range of subject matter expertise. As an SRE on this team, you will get to build thoughtful and strategic tools from the ground up that help to solve large scale technology problems, reduce toil through the SDLC lifecycle, and implement SRE practices within applications. Our current tech stack consists primarily of Python/FastAPI and React.js. During the development lifecycle, we also leverage other tools/platforms/services such as Jenkins, Dynatrace, Splunk, Prometheus, and Terraform. In addition, we aim to stay up-to-date with the latest industry trends and standards, and adopt applicable tools and practices where possible.\nJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world's most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.\nThe health and safety of our colleagues, candidates, clients and communities has been a top priority in light of the COVID-19 pandemic. JPMorgan Chase was awarded the \"WELL Health-Safety Rating\" for all of our 6,200 locations globally based on our operational policies, maintenance protocols, stakeholder engagement and emergency plans to address a post-COVID-19 environment.\nAs a part of our commitment to health and safety, we have implemented various COVID-related health and safety requirements for our workforce. Employees are expected to follow the Firm's current COVID-19 or other infectious disease health and safety requirements, including local requirements. Requirements include sharing information including your vaccine card in the firm's vaccine record tool, and may include mask wearing. Requirements may change in the future with the evolving public health landscape. JPMorgan Chase will consider accommodation requests as required by applicable law.\nWe offer a competitive total rewards package including base salary determined based on the role, experience, skill set, and location. For those in eligible roles, discretionary incentive compensation which may be awarded in recognition of individual achievements and contributions. We also offer a range of benefits and programs to meet employee needs, based on eligibility. These benefits include comprehensive health care coverage, on-site health and wellness centers, a retirement savings plan, backup childcare, tuition reimbursement, mental health support, financial coaching and more. Additional details about total compensation and benefits will be provided during the hiring process.\nEqual Opportunity Employer/Disability/Veterans",
    "Years Experience": "00 years",
    "Years Context": "....story spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial ba....",
    "Skills": "Python(1)\nReact(1)\nexpress(1)",
    "Remote Allowed": false
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3457138261",
    "URL": "https://www.linkedin.com/jobs/view/3457138261/",
    "Job Title": "Sales Specialist",
    "Company": "Cintas",
    "Description": "Job DescriptionCintas is seeking a Sales Specialist in Training for Cintas Fire Protection. Responsibilities include selling our products and services to new customers, generating new business, cold calling, presenting and demonstrating our products and services, and working with the service department to ensure customer satisfaction.Our Sales Representatives EnjoySolid base salary and commission potentialExtensive car package (lease/gas/insurance, maintenance allowance)Monthly bonuses and incentivesA comprehensive 12-week sales training programMentorship programAnnual recognition eventsRequiredSkills/QualificationsHigh School Diploma/GED; Bachelor's Degree preferredValid driver's licensePreferredBusiness-to-business, industrial and/or outside sales experienceCold calling experience1-3 years' sales experienceOur Employee-partners EnjoyCompetitive Pay401(k)/Profit Sharing/ESOPMedical, Dental and Vision Insurance PackageDisability and Life Insurance PackagePaid Time Off and HolidaysCareer Advancement OpportunitiesHeadquartered in Cincinnati, Cintas is a publicly held company traded over the Nasdaq Global Select Market under the symbol CTAS and is a component of both the Standard & Poor’s 500 Index and Nasdaq-100 Index.Cintas Corporation helps more than 900,000 businesses of all types and sizes get READY™ to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, mats, mops, restroom supplies, first aid and safety products, fire extinguishers and testing, and safety and compliance training, Cintas helps customers get Ready for the Workday®.To support our growth across North America, we’re seeking driven professionals with ambition to move up within our company. Our professional culture, our dedication to our employee-partners and limitless career opportunities—these are just a few benefits we’re proud to offer. Our employee-partners know every job is critical, and that teamwork drives innovation. Let’s talk about how you’ll fit into our team and how your hard work will be recognized through competitive pay, world-class benefits and ongoing career development. Are you Ready™ for limitless opportunities at Cintas?Cintas Corporation is an EEO/Affirmative Action Employer and will make all employment-related decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.Job Category: SalesOrganization: FireEmployee Status: RegularSchedule: Full TimeShift: 1st Shift",
    "Years Experience": "1-3 years",
    "Years Context": "....alling experience1-3 years' sales experienceOur Employee-partners EnjoyCompetitive Pay401(k)/Profit Sharing/ESOPMedical, Denta....",
    "Skills": "",
    "Remote Allowed": false
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3453713196",
    "URL": "https://www.linkedin.com/jobs/view/3453713196/",
    "Job Title": "Maintenance Operations Engineer",
    "Company": "Cushman & Wakefield",
    "Description": "Job Title\n\nMaintenance Operations Engineer\n\nJob Description Summary\n\nResponsible to ensure the efficient operation and maintenance of mechanical, electrical and plumbing equipment and systems for the assigned property(s). Responsibilities include (but are not limited to) maintaining a clean and safe working environment, performing rounds, conducting routine assessments, performance of day-to-day preventive and corrective maintenance, painting, and housekeeping for assigned properties\n\nJob Description\n Perform all plumbing, electrical, or HVAC requirements of the building(s) Maintain heating equipment, chillers (air and/ or water cooled), DX units, pumps, cooling towers, fan coil units, VAV, and air distribution systems, etc. Monitor and adjust all mechanical/pneumatic equipment, steam stations, control gauges, distributor panels, valves, thermostats, diffusers, and other equipment necessary to provide a comfortable environment for the buildings Verify field conditions and perform any necessary repairs or adjustments Monitor Energy Management Repair doors, ceilings, hand railings, and floors and other general repairs, adjustments and installations about the property Perform repairs to plumbing fixtures (water closets, urinals, flush valve assemblies, lavatories, etc.) Perform preventive maintenance duties in accordance with C&W standards, building protocol, manufacturer recommendations and industry best practices. including changing filters, cleaning coils, flushing condensers, punching tubes, greasing fan, pump and motor bearings as required, inspecting and adjusting belts, replacing motor bearings, aligning pulleys and shafts, monitor condenser, chilled, heating and secondary water chemical treatment and its associated feed equipment, clean and maintain cooling towers, and perform annual inspections and other scheduled routines as directed. Inspect engine room equipment, fan room equipment, cooling tower, all motors, house pumps, electric rooms, back-up generator, fire pump(s), sump pump(s), and ejector pumps. Replace lamps, light fixtures, reinstall or replace signage, verify rooms are clean and clear of obstructions and debris Check for properly operating emergency exit signs and lights and ensure free and clear access to emergency stairs and exits. Perform additional fire and life safety inspections as per NFPA and local jurisdiction, C&W standards, building protocol and as directed by superiors and property management Document and report activities to supervisor Respond immediately to emergency situations (fire, evacuation, equipment failure, etc.) and customer concerns Comply with all applicable codes, regulations, governmental agency, and company directives as relates to building operations and practice safe work habits Complete all required C&W Safety Training as scheduled annually Comply with C&W Uniform Dress Code while working and maintain a neat and clean appearance while on the property at times other than working hours\nKEY COMPETENCIES\n Technical Proficiency Initiative Flexibility Multi-Tasking Sense of Urgency\nIMPORTANT EDUCATION\n High School Diploma of GED Equivalent Graduate of apprentice program or trade school preferred\nImportant Experience\n 5+ years of related work experience in operating mechanical, electrical, and plumbing systems in a commercial property setting\nAdditional Eligibility Qualifications\n Appropriate license/permit for trade as may be required, i.e. Journeyman or Master Electrician License or City Licenses, such as Refrigeration Certificate of Fitness, High Pressure Boiler License, High Pressure Steam Operator, etc.) May be required to have certification as a Universal Technician for CFC’s depending on market licensure requirements Possess and maintain a valid driver’s license and good driving record with periodic checks (where applicable) Basic Computing Skills in Outlook, Excel & Word Experience in operation, maintenance and basic repair of HVAC, boilers, heaters, pumps, refrigerant systems, compressors, water systems, etc. Knowledgeable in energy management systems, techniques and operations. Thorough knowledge in all building systems operations, maintenance and repair.\nMay be only maintenance staff member on duty during certain shifts; may be required to work extended periods of time without relief when responding to priority/emergency situations (including overtime type assignments); may require shift work and/or on call duties\n\nWORK ENVIRONMENT\n\nThis job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets and fax machines. Regularly required to travel outside between properties in varying weather conditions.\n\nPHYSICAL DEMANDS\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job.\n Must have ability to stoop, stand, climb, frequently lift a minimum of 50 lbs. of equipment (pumps, tools, ladders) and safely install rigging/lifting devices Regularly required to crouch and reach to install/move equipment by bending forward at the waist or by bending legs and spine Involves movement between departments, floors, and properties to facilitate work Ability to speak clearly so others can understand you Ability to read and understand information presented orally and in writing Regularly required to utilize vision abilities, allowing reading of printed material, drawings, and schematics\nAAP/EEO STATEMENT\n\nC&W provides equal employment opportunity to all individuals regardless of their race, color, creed, religion, gender, age, sexual orientation, national origin, disability, veteran status, or any other characteristic protected by state, federal, or local law. Further, the company takes affirmative action to ensure that applicants are employed and employees during employment are treated without regard to any of these characteristics. Discrimination of any type will not be tolerated.\n\nOther Duties\n\nThis job description is not designed to cover or contain a comprehensive list of activities, duties or responsibilities that are required of the employee. Other duties, responsibilities and activities may change or be assigned at any time with or without notice.\n\nCushman & Wakefield provides equal employment opportunity. Discrimination of any type will not be tolerated. Cushman & Wakefield is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veteran status or any other characteristic protected by state, federal, or local law.\n\nIn compliance with the Americans with Disabilities Act Amendments Act (ADAAA), if you have a disability and would like to request an accommodation in order to apply for a position at Cushman & Wakefield, please call the ADA line at 1-888-365-5406 or email HRServices@cushwake.com. Please refer to the job title and job location when you contact us.\n\nIn compliance with the Americans with Disabilities Act Amendments Act (ADAAA), if you have a disability and would like to request an accommodation in order to apply for a position at Cushman & Wakefield, email HRServices@cushwake.com or HRServices@cwservices.com. All inquiries not related to accommodations will go unanswered.",
    "Years Experience": "5+ years",
    "Years Context": ".... 5+ years of related work experience in operating mechanical, electrical, and plumbing systems in a commercia....",
    "Skills": "",
    "Remote Allowed": false
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3452555614",
    "URL": "https://www.linkedin.com/jobs/view/3452555614/",
    "Job Title": "Digital Product Manager",
    "Company": "Aditi Consulting",
    "Description": "LOCATION: Atlanta, GA, Irving, TX, Basking Ridge, NJ\nHYBRID- Currently contractors are remote but whenever HR enforces, they need to be prepared to come in 2 days a week.\nMUST HAVE SKILLS (Most Important):● Prior experience with digital digital operations, ecommerce, website design as a product owner/product manager● Executive grade presentation skills to tell an impactful story● Experience working with the field and operations to coordinate adoption of projects● Experience creating digital journeys for ecommerce transactions in agile environment● Experience with customer escalations, creating tickets based on voice of customer and working with IT teams to implement● Data driven with ability to analyze, understand and decipher insights from available analytics● Use tools like Adobe Insights and other reporting and analytics tools like glass box● Ability to identify, trouble shoot, and resolve problems across the digital ecosystem.● Exceptional communication skills; written, oral and presentation.\nJOB DUTIES:● Manage active sales funnel and monitor performance and log any experience issues in jira. Work with GTS to resolve and prioritize the issues,● Understanding and balancing the needs the business and the digital audience, you’ll create a highly engaging digital user experience to achieve our marketing goals. ● You’ll craft the vision and lead the innovative User Experience (UX) design that will provide the best user experience across all our platforms. Because here, better matters. \nEDUCATION/CERTIFICATIONS:4-year College degree",
    "Years Experience": "",
    "Years Context": "",
    "Skills": "git(6)\nAdobe(1)",
    "Remote Allowed": false
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3457128292",
    "URL": "https://www.linkedin.com/jobs/view/3457128292/",
    "Job Title": "ServiceNow Security Access Engineer",
    "Company": "Wells Fargo",
    "Description": "About This Role\n\nAt Wells Fargo, we are looking for talented people who will put our customers at the center of everything we do. We are seeking candidates who embrace diversity, equity and inclusion in a workplace where everyone feels valued and inspired.\n\nHelp us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you.\n\nTechnology sets IT strategy; enhances the design, development, and operations of our systems; optimizes the Wells Fargo infrastructure; provides information security; and enables Wells Fargo global customers to have 24 hours a day, 7 days a week banking access through in-branch, online, ATMs, and other channels.\n\nOur mission is to deliver stable, secure, scalable, and innovative services at speeds that delight and satisfy our customers and unleash the skills potential of our employees.\n\nThe Enterprise Functions Technology (EFT) group provides technology solutions and support for Risk, Audit, Finance, Marketing, Human Resources, Corporate Properties, and Stakeholder Relations business lines. In addition, EFT provides unique technology solutions and innovation for Wells Fargo Technology, Enterprise Shared Services, and Enterprise Data Management. This combined portfolio of applications and tools are continually engineered to meet the challenges of stability, security, scalability, and speed.\n\nWells Fargo is seeking a ServiceNow Security Engineer with a focus on ACLs, role management and platform security. Candidates should have strong prior experience in complex ACL requirements and be able to gather complex requirements from stakeholders through interview sessions. A full understanding of role functionality, advanced condition building and scoped application version control are essential to the role.\n\nIn This Role, You Will\n Review and document current state of access control design and implementation  Provide guidance and ensure best practice to Wells Fargo ServiceNow access strategy  Lead requirements gathering sessions from Developers and Stakeholders to identify and document requirements for ACLs, Roles and Groups as appropriate  Implement ACLs, Roles and Groups as required  Fulfill requests for restricted functions requires Elevated Privileges such as Plugin Activation, Service Account management and Single Sign On administration  Contribute to process and practices documentation and improvement  Engage with Compliance and Audit teams to assess security and contribute to the creation and execution of controls that ensure adherence to our requirements    Required Qualifications, US:  \n 4+ years of Specialty Software Engineering experience, or equivalent demonstrated through one or a combination of the following: work experience, training, military experience, education  2+ years of ServiceNow Development or Implementation experience  ServiceNow Certified System Administrator  US Citizen Requirement for ServiceNow FedRamp Instance    Desired Qualifications:  \n ServiceNow Certified Application Developer  ServiceNow Certified Implementation Specialist  This position is not eligible for visa sponsorship.\n\nInternal Job ID: @RWF22\n\n Pay Range \n\n$96,600.00 - $171,800.00 Annual\n\nBenefits\n Information about Wells Fargo's employee benefits   We Value Diversity \n\nAt Wells Fargo, we believe in diversity, equity and inclusion in the workplace; accordingly, we welcome applications for employment from all qualified candidates, regardless of race, color, gender, national origin, religion, age, sexual orientation, gender identity, gender expression, genetic information, individuals with disabilities, pregnancy, marital status, status as a protected veteran or any other status protected by applicable law.\n\nEmployees support our focus on building strong customer relationships balanced with a strong risk mitigating and compliance-driven culture which firmly establishes those disciplines as critical to the success of our customers and company. They are accountable for execution of all applicable risk programs (Credit, Market, Financial Crimes, Operational, Regulatory Compliance), which includes effectively following and adhering to applicable Wells Fargo policies and procedures, appropriately fulfilling risk and compliance obligations, timely and effective escalation and remediation of issues, and making sound risk decisions. There is emphasis on proactive monitoring, governance, risk identification and escalation, as well as making sound risk decisions commensurate with the business unit's risk appetite and all risk and compliance program requirements.\n\nCandidates applying to job openings posted in US: All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nReference Number\n\nR-158446-2",
    "Years Experience": "4+ years\n2+ years",
    "Years Context": ".... 4+ years of Specialty Software Engineering experience, or equivalent demonstrated through one or a combinati....\n....ience, education  2+ years of ServiceNow Development or Implementation experience  ServiceNow Certified System Administrator  ....",
    "Skills": "express(1)",
    "Remote Allowed": false
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3455909421",
    "URL": "https://www.linkedin.com/jobs/view/3455909421/",
    "Job Title": "(USA) Tire & Battery Technician - Automotive",
    "Company": "Walmart",
    "Description": "What You'll Do At\n\n Position Summary... As a Tire & Battery Center Technician you will work to provide safe and efficient service in both the sales and service areas of the department and deliver to our members more of what they love, for less. You will work collaboratively with other associates to ensure the club meets the member’s expectations. What you'll do... \nBe a Team Member: Collaborates with team members to fulfil sales and service requests; educating other associates on tools, tasks, resources and mentor new technicians; communicating and developing interpersonal skills for providing safe and efficient customer service.Be an Expert: Demonstrates knowledge of safety and compliance protocols, tire and battery industry guidelines, service standards, equipment operations, TPMS (Tire Pressure Monitoring systems), product specifications, and seasonality; demonstrating knowledge of Point of Sale systems, phone, and in-person selling techniques.Be a Techie: Leverages digital tools to plan for and drive sales, improve the service experience, and elevate associate engagement; utilizing hand held technology and systems to make immediate business decisions related to services, safety alerts, new product information, product application, and training; adapting to new tools and encouraging others to use them.Be an Owner: Communicates equipment, tools and supplies needs to TBC Lead; tracking and monitoring returns and special orders; operating cash registers; processing transactions; working hands-on in the physical area; maintaining accurate inventory, audit, safety, and compliance standards; reporting TBC complaints, safety hazards, and problems with products, services, and work areas; completing paperwork, logs, and other required documentation; ensuring merchandise is packaged, labeled, and stored in accordance with company policies and procedures;; identifying member needs; assists members with purchasing decisions; and resolves issues and concerns.Be a Talent Ambassador: Being a brand advocate by valuing the member's experience in the TBC area and modeling high quality service and products; developing, influencing and inspiring others for working in a style that is respectful, supportive and team oriented; understanding the roadblocks and assisting in training team members.Complies with company policies, procedures, and standards of ethics and integrity by implementing related action plans; using the Open Door Policy; and applying these in executing business processes and practices.Completes work assignments and priorities by using policies, data, and resources; collaborating with managers, co-workers, customers, and other business partners; identifying priorities, deadlines, and expectations; carrying out tasks; communicating progress and information; determining and recommending ways to address improvement opportunities; and adapting to and learning from change, difficulties, and feedback.  Minimum Qualifications...  \n\n Outlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications.  \n\nMinimum QualificationsValid State-issued Driver's License.\n\nI acknowledge that the position for which I am applying requires me to successfully complete all job required trainings and assessments within a prescribed time period if I receive the position.\n\nMust be 18 years of age or older  Preferred Qualifications...  \n\nOutlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications. \n\nAuto service industry, Retail Experience  Primary Location...  1520 SCENIC HWY N, SNELLVILLE, GA 30078-2130, United States of America\n\nAbout Sam's Club\n\nSam Walton opened the first Sam's Club in 1983 to meet a growing need among customers who wanted to buy merchandise in bulk. Since then, Sam's Club has grown rapidly, opening more than 600 clubs in the U.S. and 100 clubs internationally. By offering affordable, wholesale merchandise to members, Sam's Club helps make saving simple for families and small business owners.\n\nSam's Club employs about 110,000 associates in the U.S. The average club is 134,000 square feet and offers bulk groceries and general merchandise. Most clubs also have specialty services, such as a pharmacy, an optical department, a photo center, or a tire and battery center.\n\nSam’s Club is an Equal Opportunity Employer- By Choice. We believe we are best equipped to help our associates, customers, and the communities we serve live better when we really know them. That means understanding, respecting, and valuing diversity- unique styles, experiences, identities, abilities, ideas and opinions- while being inclusive of all people.",
    "Years Experience": "18 years",
    "Years Context": "....Must be 18 years of age or older  Preferred Qualifications...  ....",
    "Skills": "git(1)",
    "Remote Allowed": false
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3457128929",
    "URL": "https://www.linkedin.com/jobs/view/3457128929/",
    "Job Title": "Night Operations Department Supervisor",
    "Company": "Lowe's Companies, Inc.",
    "Description": "What You Will Do \nAll Lowe’s associates deliver quality customer service while maintaining a store that is clean, safe, and stocked with the products our customers need. As an Night Operations Department Supervisor, this means:\n Removing barriers, addressing inefficiencies, and enabling staff to delighting our customers. Collaborating with front-end and back-end operations associates to ensure items are adequately stocked. Monitoring use of store power equipment and coaching employees on safe behaviors and lifting techniques.\nThe Night Operations Department Supervisor is primarily responsible for leading and enabling a team of associates to deliver the best possible customer experience in the store. This includes coaching and training associates, delegating, following-up on daily tasks, managing performance, and ensuring adequate department coverage. The Night Operations Department Supervisor impacts Lowe’s mission daily by planning, scheduling, monitoring, and successfully implementing all non-selling operations in the back end and front end of the store, facilitating the store’s ability to provide a superior customer shopping experience and maximize sales and profitability.\nTo be successful, the Night Operations Department Supervisor must collaborate and communicate with other Department Supervisors and Assistant Store Managers to determine the most effective methods for meeting service, operations, and safety objectives. The individual in this role must continuously drive efficiencies and be able to teach others the skills needed to maintain effective store operations. It is important that this associate communicate upward to keep management informed of concerns, issues, recognitions, and morale.\nThe Night Operations Department Supervisor helps keep our store safe by conducting safety walks, reporting hazards, training and monitoring staff, and understanding all safety and lifting requirements.\nIn addition to the responsibilities summarized above, individuals in this role may occasionally open or close the store or serve as manager-on-duty (MOD).\nTravel Requirements: This role does not require regular travel; however, this role may need to travel on occasion to meetings, trainings, or to support neighboring stores.\nWhat We're Looking For\n Hourly Full Time: Generally scheduled 39 to 40 hours; more hours may be required based on the needs of the store. Requires working overnight shift. Physical ability to perform tasks that may require prolonged standing, sitting, and other activities necessary to perform job duties. Minimally must be able to lift 25 pounds without assistance; may lift over 25 pounds with or without assistance.\nWhat You Need To Succeed\nMinimum Qualifications\n High School Diploma or equivalent and 3 years of experience in a retail environment OR 5 years of experience in a retail environment. Experience providing direction or supervision to teams (with or without direct report responsibility). Experience supporting or participating in the process of training, mentoring and developing associates. Experience working cross-functionally. Experience Using Microsoft Office Suite. Ability to obtain sales related licensure or registration as may be required by law.\nPreferred Qualifications\n Experience supporting front-end or back-end operations in a retail environment. Experience in customer service role. Experience in a leadership role with direct report responsibility. Experience working in the home improvement retail sector. Experience working in a fast paced, dynamic retail environment. Experience in key carrying role with manager-on-duty responsibilities. Experience using store computer systems (including but not limited to: Project Tool, Genesis, Sterling, M2O, Thin Client, etc.).\nIf the state or local municipality requires a salesperson license for this position, you must either be licensed or pass the requisite licensing exam within sixty (60) days of starting employment in this position.\nEEO Statement\nLowe’s is an equal opportunity employer and administers all personnel practices without regard to race, color, religious creed, sex, gender, age, ancestry, national origin, mental or physical disability or medical condition, sexual orientation, gender identity or expression, marital status, military or veteran status, genetic information, or any other category protected under federal, state, or local law.",
    "Years Experience": "3 years\n5 years",
    "Years Context": ".... or equivalent and 3 years of experience in a retail environment OR 5 years of experience in a retail environment. Experience ....",
    "Skills": "front-end(2)\nfront end(1)\nexpress(1)",
    "Remote Allowed": false
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3452557025",
    "URL": "https://www.linkedin.com/jobs/view/3452557025/",
    "Job Title": "Inside Sales Associate",
    "Company": "POOLCORP",
    "Description": "Pay: Up to $21/hr and up to $2,000 through our performance bonuses in the summer.\nLocation: Kennesaw, GA - 133; 1920 Shiloh Road Bldg 4, Suite 300, Kennesaw, Georgia - 30144\nJob Summary\nThe Inside Sales Associate works with customers to find what they want, create solutions and ensure a smooth sales process.\nResponsibilities\nEstablishes relationships with customers by assisting walk-in and phone customers, representing the company in a professional manner.Processes, pulls and distributes customer products quickly and efficiently.Handles questions and complaints in a timely and professional manner.Accurately performs data entry of sales orders to generate an invoice of products ordered to be picked up or delivered. Secures payment of invoice with proper funds or obtain credit authorization in accordance with company policy.Evaluates and determines disposition of warranty items handled at the counter, as prescribed by the manufacturer's warranty policy and customer needs.Estimates date of delivery to customer, based on knowledge of vendor’s production and delivery schedules.Assists in receiving, shipping, and general warehouse duties.\nRequirements\nHigh school diploma or GED.1+ years related inside sales experience preferred.The ability to move 100 pounds with a dolly.Strong counter \"presence\" and the ability to deal directly with customers for a large portion of the day.Strong customer-service attitude.Good computer skills including MS Office programs.Ability to work in a fast-paced environment dealing with inventory, product allocations and customer issues.Familiarity with a related product line such as pool supplies, parts, chemicals or pool construction helpful.Must be 18 years of age or older to apply.\nWhy not work for an INDUSTRY LEADER? \nPOOLCORP is the world’s leading distributor of outdoor living products. We operate in more than 400 Sales Centers in 13 countries with nearly 6,000 employees who proudly service the needs of our customers. The POOLCORP network includes SCP Distributors, SCP Distributors International, Superior Pool Products, Jetline and Horizon Distributors.\nWhy POOLCORP?\nAt POOLCORP you’ll find plenty of excellent career advancement and training opportunities to support your career growth. Our generous benefits package includes medical, dental, vision, prescription coverage, 401 (k) with 4% company match, education reimbursement, paid time off, and more! As a company, we value integrity, trust, diversity, and ingenuity in everything we do, including our employees. Our family-oriented, hometown culture is supported by a stable, growing company – giving you the best of all worlds.\nSo, end your job search here – at POOLCORP – Where Outdoor Living Comes to Life!\nPOOLCORP is a drug-free company.\nPOOLCORP is an Equal Opportunity Employer – By Choice. The Company understands, respects, and values diversity – unique styles, experiences, identities, ideas, and opinions – while striving to be inclusive of all people. This commitment is critical to our success as a global company as we seek to recruit, develop, and retain the most talented people from a diverse candidate pool. Hiring and promotional decisions are based solely on the qualifications required for the job to be filled.\nTo apply, email monica.kurtz@poolcorp.com\n#SE1",
    "Years Experience": "1+ years\n18 years",
    "Years Context": "....ol diploma or GED.1+ years related inside sales experience preferred.The ability to move 100 pounds with a dolly.Strong counte....\n....n helpful.Must be 18 years of age or older to apply.....",
    "Skills": "",
    "Remote Allowed": false
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3452561177",
    "URL": "https://www.linkedin.com/jobs/view/3452561177/",
    "Job Title": "GIS Analyst",
    "Company": "Atkins",
    "Description": "GIS Analyst \nAtkins seeks an energetic, highly motivated, and detail-oriented self-starter to join our team in our Atlanta, GA office as a GIS Analyst.\nMajor Function/RoleUnder direction, applies full competency in GIS studies related to functional area of assignment. Ideal Candidates will have basic knowledge with geospatial analysis and mapping process with ESRI products.\nAbout UsAtkins is one of the world’s most respected design, engineering and project management consultancies. Atkins has been providing infrastructure planning, engineering, construction, environmental consulting, urban planning, architecture, and program management services to public and private clients across the United States for more than 50 years. Atkins has the depth and breadth of expertise to respond to the most technically challenging and time-critical infrastructure projects and the urgent transition to a low-carbon economy.\nJob DutiesDuties may require mastery of specialized techniques, ingenuity and ability to apply analytical approach to the solution of a wide variety of problems. Performs work under supervision according to FEMA specifications and standards. Specific duties will include:\nConduct data gathering, prepare maps, analysis, and metadata for various GIS projects.Inform Team Lead of any issues with receiving required data such as incomplete data or time delays that can’t be rectified by dealing directly the Scientist or EngineerBe involved with all technical discussions and meetings between the PM and clientCreate, update, and maintain GIS databases according to FEMA specifications.Be responsible for all FEMA submittals related to GIS work (QR1, QR3, QR5)Perform quality control to ensure data integrity.Work with Team Lead to identify GIS data needed to complete the FEMA study.Ensure the quality of the GIS data and mapping per FEMA guidelines.Able to work independently, while use good judgement seeking help when necessary.\nHow will you contribute?B.A. or B.S. or M.S. in Geography, computer science, or GIS-related environmental discipline commensurate with hiring discipline.Familiar with GIS technology and ESRI software.Good interpersonal and computer skills and capable of developing technical writing and communication skills.\nWhat we offer at Atkins?At Atkins, you will enjoy a robust rewards package which includes:Opportunity to work on various projects of various sizes.Competitive salary.Flexible work schedules.Paid Time Off (PTO).Group Insurance.Retirement Savings Plan with employer match.Employee Assistance Program (EAP).Learning and development programs, training, career opportunities and a highly regarded tuition reimbursement program.\nIf this sounds like you and you would like to expand your career with us, apply today! \nAtkins is an equal opportunity, drug-free employer committed to diversity in the workplace. EOE/Minorities/Females/Vet/Disability.\nPlease Review Atkins Equal Opportunity Statement Herehttps://careers.snclavalin.com/equal-opportunities-statement\nAtkins cares about your privacy and are committed to protecting your privacy. Please consult our Privacy Notice on our Careers site to know more about how we collect, use and transfer your Personal Data.By submitting your personal information to Atkins, you confirm that you have read and accept our Privacy Notice.\nNote To Staffing And Direct Hire AgenciesIn the event a recruiter or agency who is not on our preferred supplier list submits a resume/candidate to anyone in the company, SNC-Lavalin family of companies, we explicitly reserve the right to recruit and hire the candidate(s) at our discretion and without any financial obligation to the recruiter or agency. https://careers.snclavalin.com/recruitment-agencies",
    "Years Experience": "50 years",
    "Years Context": "....tes for more than 50 years. Atkins has the depth and breadth of expertise to respond to the most technically challenging and t....",
    "Skills": "",
    "Remote Allowed": false
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3456102533",
    "URL": "https://www.linkedin.com/jobs/view/3456102533/",
    "Job Title": "Game Dev. Unity Software Engineer Internship (Long-Term)",
    "Company": "Light & Wonder",
    "Description": "Gaming:\nWelcome to the world of land-based gaming. Light & Wonder’s gaming team builds cutting-edge technology, products, and content for the most iconic casinos and operators across the globe.\nPosition Summary\nAre you ready to level up your career? At Light & Wonder, we are committed to making the best games in the world. We are looking for smart, passionate, and creative people to join our team and help us transform the gaming world. We are a global, industry-leading gaming technology company that embraces challenge, fosters an inclusive culture, values integrity, innovation and winning, and is committed to developing and supporting its people.\nAs a member of our award-winning game studios, you will be creating compelling games played around the world.\nIf you are ready to play… come join us and let’s make games!\nLight & Wonder’s Game Development Internship Program\nHow It Works\nWe’re looking for individuals who can commit to a long-term internship program. That means:\nYou will be available 20-29 hours a week for at least 6 monthsEvery 6 months we review your progress, and if everyone’s happy (you and us), we can extend for another 6 monthsIf everyone’s still happy, we can keep extending 6 months at a time until you have been with us a year, or until 6 months after you graduate, whichever is longer\nWhat You Get Out Of It\nCompetitive hourly payExperience working alongside industry veterans on real projects in the gaming industryA good chance of a full-time job offers at the end of your internship\nA full-time offer is dependent on some things within our control (i.e., your performance during your internship), and some things outside our control (i.e., normal hiring approvals from leadership). while we cannot promise anything, we have a pretty good track record at converting interns into full-time employees.\nWhat You Don’t Get Out Of It\nBoredSponsorship—sorry, but we are currently only looking for individuals who are authorized to work in the US and do not require sponsorship now or in the future\nIs It Remote?\nYes, mostly:\nIf you are not already in Las Vegas, you can work from wherever you are (except AK, MT, NH, SC, or VT)If you are already in Las Vegas, you will still mostly work remotely, except for the occasional team get-together in the office to review a game in a cabinet, to grab lunch, or bothIf we are able to extend a full-time offer at the end of your internship, we prefer candidates who are open to relocation to Las Vegas (we help pay for relocation)\nWhat To Expect During Your InternshipOn Day 1, you will be partnered with an experienced software engineer on one of our Las Vegas-based game development studios to mentor you throughout your internshipYour internship will start with some initial training on our platform and the tools and development environment we useAs your internship progresses, you will be working alongside your mentor on an actual slot product destined for casinos around the world, which includesWriting code to implement game features and functionalityImplementing gameplay elements including art assets, animations, sounds, and player interactionsFinding the root cause of bugs and fixing themYou will attend team meetings, game reviews, and other meetings related to your studio or the game you are working onYou will learn about how gameplay programming ties the entire game together and how it fits into the game development processYou will learn how to collaborate with artists, animators, sound designers, and mathematicians as part of the game development pipelineYou will learn what makes a good slot game from some of the best game designers in the industryMost importantly, you will have fun making games\nQualifications\nWhat Skills and Experience You Need\nYou must be at least 18 years old and be working toward or have completed a bachelor’s degree in Computer Science or a related fieldYou must be familiar with C# and UnityBonus points if you are familiar with Visual StudioMore bonus points if you have a portfolio of game projects you have worked on in school or on your ownYou should enjoy working in a creative environmentYou need excellent communication, organization, and time-management skills\n, \nWork Conditions\nLight & Wonder and its affiliates (collectively, “L&W”) are engaged in highly regulated gaming and lottery businesses. As a result, certain L&W employees may, among other things, be required to obtain a gaming or other license(s), undergo background investigations or security checks, or meet certain standards dictated by law, regulation or contracts. In order to ensure L&W complies with its regulatory and contractual commitments, as a condition to hiring and continuing to employ its employees, L&W requires all of its employees to meet those requirements that are necessary to fulfill their individual roles. As a prerequisite to employment with L&W (to the extent permitted by law), you shall be asked to consent to L&W conducting a due diligence/background investigation on you. \nThis job description should not be interpreted as all-inclusive; it is intended to identify major responsibilities and requirements of the job. The employee in this position may be requested to perform other job-related tasks and responsibilities than those stated above. \nLight & Wonder is an Equal Opportunity Employer and does not discriminate against applicants due to race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. If you’d like more information about your equal employment opportunity rights as an applicant under the law, please click here for EEOC Poster.\n",
    "Years Experience": "18 years",
    "Years Context": ".... have been with us a year, or until 6 months after you graduate, whichever is longer....\n.... must be at least 18 years old and be working toward or have completed a bachelor’s degree in Computer Science or a related fi....",
    "Skills": "ios(2)",
    "Remote Allowed": true
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3451600289",
    "URL": "https://www.linkedin.com/jobs/view/3451600289/",
    "Job Title": "Software Development Engineer",
    "Company": "CVS Health",
    "Description": "Job Description\nCVS Health Digital is looking for hands-on, passionate people who want to join a high energy and growing team to make a difference in customers’ lives and who want to be on the forefront of digital innovation that aims to reinvent what a pharmacy and a health care company can be in the digital world.\nThis role includes closely working with a team of engineers to drive delivery excellence, partner with business and other IT leaders to build digital assets, provide expert level support to resolve complex issues and provide RCA, identify gaps in systems in current digital eco system and provide solutions to enhance overall performance. All of this is critical to driving Digital growth and improving customer experience.\nThis individual will collaborate with digital leaders, business partners, and IT colleagues to deliver business growth and great customer experiences that differentiate CVS in the market, while ensuring efficient, effective and SAFe development.\nPay Range\nThe typical pay range for this role is:\nMinimum: $ 70,000\nMaximum: $ 140,000\nPlease keep in mind that this range represents the pay range for all positions in the job grade within which this position falls. The actual salary offer will take into account a wide range of factors, including location.\nRequired Qualifications\n3+ years of overall Software/Digital development experience\n2+ years of microservices, cloud native applications development and web development experience using tools such as React JS, CSS, Java/J2EE, Spring Framework, NodeJS, Messaging Frameworks (i.e, Kafka/Rabbit MQ), NoSQL/RDBMS databases (i.e, Mongo DB, PostgresSQL, Redis), and other tech stacks (Open source and proprietary)\n1+ years of experience with unit Testing frameworks such as Junit, Mockito, and BDD testing tools like Selenium\n1+ years of experience with Docker containerization, Kubernetes etc.\n1+ years of experience with CI/CD tools like Harness, Jenkins, Circle CI etc.\nPreferred Qualifications\nExperience with agile development required, Scaled Agile Framework (SAFe) experienced preferred\n Experience in handling multiple competing priorities in a fast-paced environment Healthcare/Retail Domain experience Excellent interpersonal and communication skills; thrives working in a highly iterative, agile, and open team environment Experience with any cloud provider (GCP, Azure, AWS) Experience with any other UI Frameworks is a plus. Experience with any BDD testing frameworks such as Selenium is a plus. Good understanding and working experience in IT Security best practices and other compliance standards such as ADA, HIPAA, PCI DSS\n\nEducation\nBachelor’s degree or equivalent work experience\nBusiness Overview\nBring your heart to CVS Health Every one of us at CVS Health shares a single, clear purpose: Bringing our heart to every moment of your health. This purpose guides our commitment to deliver enhanced human-centric health care for a rapidly changing world. Anchored in our brand — with heart at its center — our purpose sends a personal message that how we deliver our services is just as important as what we deliver. Our Heart At Work Behaviors™ support this purpose. We want everyone who works at CVS Health to feel empowered by the role they play in transforming our culture and accelerating our ability to innovate and deliver solutions to make health care more personal, convenient and affordable. We strive to promote and sustain a culture of diversity, inclusion and belonging every day. CVS Health is an affirmative action employer, and is an equal opportunity employer, as are the physician-owned businesses for which CVS Health provides management services. We do not discriminate in recruiting, hiring, promotion, or any other personnel action based on race, ethnicity, color, national origin, sex/gender, sexual orientation, gender identity or expression, religion, age, disability, protected veteran status, or any other characteristic protected by applicable federal, state, or local law. We proudly support and encourage people with military experience (active, veterans, reservists and National Guard) as well as military spouses to apply for CVS Health job opportunities.",
    "Years Experience": "3+ years\n2+ years\n1+ years\n1+ years\n1+ years",
    "Years Context": "....3+ years of overall Software/Digital development experience....\n....2+ years of microservices, cloud native applications development and web development experience using tools ....\n....1+ years of experience with unit Testing frameworks such as Junit, Mockito, and BDD testing tools like Selen....\n....1+ years of experience with Docker containerization, Kubernetes etc.....\n....1+ years of experience with CI/CD tools like Harness, Jenkins, Circle CI etc.....",
    "Skills": "git(8)\nReact (1)\nCSS(1)\nJava(1)\nNode(1)\nNoSQL(1)\nMongo(1)\nPostgres(1)\nSQL(1)\nAWS(1)\nexpress(1)",
    "Remote Allowed": true
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3452554296",
    "URL": "https://www.linkedin.com/jobs/view/3452554296/",
    "Job Title": "Enterprise Architect",
    "Company": "Ascendion",
    "Description": "We are looking for an experienced Enterprise Architect to join our leading clients in the Insurance industry. The ideal candidate will have a strong background in system architecture, cloud computing, enterprise architecture and infrastructure and will be responsible for designing and implementing innovative solutions to support our company's strategic goals.\nKey Responsibilities:Lead the design and implementation of cloud and infrastructure solutions that align with our company's business and technical goalsCollaborate with cross-functional teams to identify and evaluate new technologies and solutions that can improve our company's operationsDevelop and maintain roadmaps for cloud and infrastructure initiatives, and ensure that they are aligned with our company's overall strategyWork with IT leaders to ensure that our company's cloud and infrastructure solutions are secure, compliant, and meet industry standardsProvide guidance and mentorship to team members on cloud and infrastructure best practices and technologies\nQualifications:10+ years of experience in an enterprise architect role, with a focus on cloud and infrastructureStrong experience with cloud platforms such as AWS, Azure, or Google CloudExperience with infrastructure technologies such as servers, storage, networking, and virtualizationStrong understanding of cloud security and compliance requirementsStrong communication and leadership skills\nIf you are interested, please send your resume to swathi.murthy@ascendion.com or set up a quick chat here: calendly.com/swathi_murthyas",
    "Years Experience": "10+ years",
    "Years Context": "....Qualifications:10+ years of experience in an enterprise architect role, with a focus on cloud and infrastructureStrong exper....",
    "Skills": "AWS(1)",
    "Remote Allowed": true
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3456960743",
    "URL": "https://www.linkedin.com/jobs/view/3456960743/",
    "Job Title": "Intern_Software Engineer (Remote -US)",
    "Company": "Cubic Corporation",
    "Description": "Business Unit\n\nCubic Transportation Systems\n\nCompany Details\n\nCubic offers an opportunity to provide innovative technology for government and commercial customers around the globe, helping to solve their future problems today. We’re the leading integrator of payment and information technology and services for intelligent travel solutions worldwide, and the leading provider of realistic combat training systems, secure communications and networking and highly specialized support services for military and security forces of the U.S. and allied nations. If you have an entrepreneurial spirit and thrive in an innovative environment, we want to talk to you about your next role at Cubic! We are seeking employees inspired by technology, and motivated by the rewards of hard work, commitment, teamwork, quality, integrity, and respect. We invite you to explore opportunities with Cubic.\n\nJob Details\n\nJob Summary: \n\nWhile seeking a college degree in engineering, computer science or related discipline, supports in the analysis, design, programming, modification and testing of software programs for designated products and/or customer applications. This position typically works under close supervision and direction.\n\nEssential Job Duties And Responsibilities\nPerforms software engineering duties including design, programming, testing, documentation, and support analysis.Writes software design document and test plans.Develops computer programs with guidance from other software engineers.Performs problem analysis with guidance from other software engineers.Performs unit testing and integration testing on software.Review code written by other software engineers.Assists in preparation of software and system design.Shows commitment to company values, ethics, safety, security, labor charging and quality.Supports as required total quality management/continuous process improvement teams.\nMinimum Job Requirements\nEnrollment in a four-year college degree program in engineering, computer science or other related technical discipline and in at least the second year of college. Effective written and oral communication skills to include the use of typical Microsoft Office products. Previously exposed to introductory computer language training. Must be able to work in a lab environment and be able to use a computer. \nThe description provided above is not intended to be an exhaustive list of all job duties, responsibilities and requirements. Duties, responsibilities and requirements may change over time and according to business need.\n\nAdditional Information\n\n(Colorado only*) Targeted full-time hourly range between $24.30 - $30.92 + benefits.\nNote: Disclosure as required by sb19-085 (8-5-20) of the minimum salary compensation range for this role when being hired to work from Colorado.\n(New York only**) Targeted full-time hourly range between $26.30 - $32.92 + benefits.\nNote: Disclosure as required by New York Law.\n(California only***) Targeted full-time hourly range between $26.30 - $32.92 + benefits.\nNote: Disclosure of the pay scale data as required by Labor Code Section 432.3.\n(Washington only****) Targeted full-time hourly range between $24.30 - $30.92 + benefits outlined above.\nNote: Disclosure as required by the Washington Equal Pay and Opportunities Act.\nThe Cubic pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law.\n\nWorker Type\n\nEmployee",
    "Years Experience": "",
    "Years Context": ".... at least the second year of college. Effective written and oral communication skills to include the use of typical Microsoft....",
    "Skills": "",
    "Remote Allowed": true
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3438139696",
    "URL": "https://www.linkedin.com/jobs/view/3438139696/",
    "Job Title": "DevOps Engineer",
    "Company": "hackajob",
    "Description": "hackajob has partnered with one of the biggest companies in the technology and innovation sector, working across the private and public sector, with clients ranging from startups to national governments.\nYour day to dayAs a DevOps Engineer, you'll be working in cloud building, deploying and managing our customers' environments. You will work part of a wider team who are striving to successfully achieve an outcome or deliverable.\nSkillset:• Knowledge on the foundational infrastructure services (Compute, Storage and Network, Database)• Experience with cloud platform (AWS, Microsoft Azure, GCP)• Expertise on the CI/CD, DevOps tools and processes (Jenkins, Bitbucket)• Infrastructure as code automation tools (Ansible, Terraform)• Basic programming (Shell scripting, Golang, Python)• Familiarity with agile methodologies / tools ( Jira, Confluence, Scrum, Kanban)• Experience on the Cloud and Container technologies (Docker, Kubernetes)• Project Management experience• Consistently demonstrates clear and concise written and verbal communication• Ability to work in a matrix environment and partner with virtual teams• Ability to work independently, multi-task, and take ownership of various parts of a project or initiative\nIn return* Basic salary $100K - $155K depending on experience* benefits package\nIf you're interested in finding out more about this fantastic opportunity please get your application in and we can arrange a call.",
    "Years Experience": "",
    "Years Context": "",
    "Skills": "AWS(1)\nPython(1)",
    "Remote Allowed": true
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3373758807",
    "URL": "https://www.linkedin.com/jobs/view/3373758807/",
    "Job Title": "Remote Software Developer II",
    "Company": "O'Reilly Auto Parts",
    "Description": "A Software Developer II at O'Reilly Auto Parts develops and supports applications for internal and external systems including Inventory, Supply Chain, eCommerce, Retail Applications, Enterprise Search and more. Our teams are focused on the development, design and integration of various software systems, databases, and third-party packages utilizing tools and technologies including Java, JavaScript, Spring, Hibernate, SOLR, and SQL.\nEssential Job Functions\nPartner with developers, engineers and stakeholders to develop new features and to enhance and support existing applications and programs.Work with business systems analysts and stakeholders to translate business to technical requirements and problem solve.Collaborate with project teams and cross functional teams to troubleshoot open issues and bug-fixes.Collaborate, coach and mentor team members on best practices, code reviews, internal tools, and process improvements.Write and maintain readable, sustainable, and efficient code in highly optimized and scalable architectures.Own applications from conception and design, to implementation and support.Debug and test code as needed.Create and update technical documentation. \nSkills And Qualifications\nCollege degree or equivalent work experience.1-2 years software development experience in a classroom setting or related job function, internships would qualify toward experience.Entry level knowledge of programming, database systems, and systems analysis and design.Ability to write technical documentation.Good problem-solving skills.Good verbal and written communications skills.Must work well in a team environment.Ability to learn independently.Willingness to work flexible schedule including nights/weekends.\nBenefits\nAll full time team members are eligible for a benefits package that is designed to offer convenience and security to our team members and their families. Programs, resources and benefit eligibility varies based on employment status, average hours worked, location and length of service. For detailed benefits info, please click here or type http://bit.ly/ORLYBenefits in your browser.\n\nCompensation Range\n\n$70,000.00 - $95,000.00 annually, pay will be based upon applicable experience, training and skills\n\nBonus\n\nThis job is eligible for an annual cash bonus based on individual goal achievement.",
    "Years Experience": "1-2 years",
    "Years Context": ".... work experience.1-2 years software development experience in a classroom setting or related job function, internships would q....",
    "Skills": "Java(1)\nJavaScript(1)\nSQL(1)",
    "Remote Allowed": true
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3457118453",
    "URL": "https://www.linkedin.com/jobs/view/3457118453/",
    "Job Title": "Ruby on Rails Developer (REMOTE) (125-150K)",
    "Company": "Dice",
    "Description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Vaco Technology, is seeking the following. Apply via Dice today!\nThe Software Developer (Ruby) will work in a fast-paced environment and play a key role in establishing the technology platform for the company. We have a rapidly growing customer base, and the development team is tasked with creating the industry leading web-based platform for risk management software. The Software Developer will work in a remote environment in a highly collaborative, self-managed team structure. Team members pride themselves in clean, testable code. The ideal candidate will be able to communicate at all levels of the organization, including design discussions with executives, partners, and potentially customers.\nResponsibilities\n Develop robust, scalable, and secure features  Write clean, maintainable, and efficient code  Participate at all stages of the development lifecycle  Implement best practices of test-driven development, continuous integration, refactoring, peer reviews, and code standards  Champion Kanban and SCRUM agile practices  Continue to grow skillset by staying informed about relevant new technologies, while driving adoption and integration into design  Empower self and teammates to be accountable for decisions \nRequired Skills/Abilities\nDesign and develop responsive web applicationsMaintain and troubleshoot applicationsExperience working in an agile or product organizationCustomer first mentalityWork with a geographically diverse team (fully remote)3+ years' experience working in a Ruby on Rails development positionPostgreSQL or relational database experienceAWS administration or configuration required (Google Cloud Platform experience a plus)Proficient with GitHub and testing tools (Rspec a plus)Python, Snowflake, and Tableau experience a plus\nEducation And Experience\nDegree in computer science or related field5 years working in a technology roleExceptional teamworkExcellent verbal and written communicationAbility to work independently and in a team structure - provided by Dice",
    "Years Experience": "3+ years\n5 years",
    "Years Context": "....eam (fully remote)3+ years' experience working in a Ruby on Rails development positionPostgreSQL or relational database experi....\n....ce or related field5 years working in a technology roleExceptional teamworkExcellent verbal and written communicationAbility t....",
    "Skills": "PostgreS(1)\nAWS(1)\nGit(1)\nPython(1)",
    "Remote Allowed": true
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3456115380",
    "URL": "https://www.linkedin.com/jobs/view/3456115380/",
    "Job Title": "Software Engineer (Remote)",
    "Company": "The Home Depot",
    "Description": "Position Purpose\nThe Software Engineer is responsible for assisting in developing and designing a product that Home Depot customers and associates will love. As a Software Engineer, you will be part of a dynamic team with engineers of all experience levels who help each other build and grow technical and leadership skills while creating, deploying, and supporting production applications. In addition, Software Engineers may be involved in product configuration, security, resilience, performance tuning and production monitoring.\nKey Responsibilities\n60% Delivers and Executes - Assists in developing, testing, deploying, and maintaining software; Follows best practices established by the organization and participates in improvement conversations; Consistently helps the team achieve results, even under tough circumstances20% Learns and Grows - Learns through successful and failed experiment when tackling new problems; Actively seeks ways to grow and be challenged using both formal and informal development channels20% Plans and Aligns - Builds partnerships and works collaboratively with others to meet shared objectives; Collaborates with other team members in agile processes; Relates openly and comfortably with diverse groups of people\nDirect Manager/Direct Reports\nThis position typically reports to Software Engineer Manager or Sr. ManagerThis position has 0 Direct Reports\nTravel Requirements\nNo travel required.\nPhysical Requirements\nMost of the time is spent sitting in a comfortable position and there is frequent opportunity to move about. On rare occasions there may be a need to move or lift light articles.\nWorking Conditions\nLocated in a comfortable indoor area. Any unpleasant conditions would be infrequent and not objectionable.\nMinimum Qualifications\nMust be eighteen years of age or older.Must be legally permitted to work in the United States.\nPreferred Qualifications\nExposure to front end technology such as HTML, CSS, and Javascript/Typescript frameworksExposure to an object-oriented programming language (preferably Java)Exposure to source code version controlExposure to Relational or noSQL database technologyExposure to cloud computing techniquesExposure to CI/CD toolsExposure to microservice-based architecture\nMinimum Education\nThe knowledge, skills and abilities typically acquired through the completion of a bachelor's degree program or equivalent degree in a field of study related to the job.\nPreferred Education\nNo additional education\nMinimum Years Of Work Experience\n1\nPreferred Years Of Work Experience\nNo additional years of experience\nMinimum Leadership Experience\nNone\nPreferred Leadership Experience\nNone\nCertifications\nNone\nCompetencies\nGlobal PerspectiveManages AmbiguityNimble LearningSelf-DevelopmentCollaboratesCultivates InnovationSituational AdaptabilityCommunicates EffectivelyDrives ResultsInterpersonal Savvy",
    "Years Experience": "",
    "Years Context": "....Must be eighteen years of age or older.Must be legally permitted to work in the United States.....\n....No additional years of experience....",
    "Skills": "front end(1)\nHTML(1)\nCSS(1)\nJavascript(1)\nJava(1)\nnoSQL(1)",
    "Remote Allowed": true
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3456102325",
    "URL": "https://www.linkedin.com/jobs/view/3456102325/",
    "Job Title": "Ruby on Rails Engineer",
    "Company": "Aha!",
    "Description": "Aha! is a very different type of high-growth SaaS company. We are self-funded, highly profitable, and 100 percent remote. We provide the world's #1 product development software so teams can build products that customers love. More than 600,000 product builders use our suite of tools which includes Aha! Roadmaps , Aha! Ideas , Aha! Create , and Aha! Develop . And they rely on our training programs via Aha! Academy to become product development experts. We are recognized as one of the best fully remote companies to work for, champion the Bootstrap Movement , and have given over $1M to people in need through Aha! Cares . Learn more at www.aha.io .\nOur team\nAha! engineering is a mid-sized, fully remote team that is highly productive. We are centered around North American time zones so we can collaborate during the workday.\nWe help each other grow: We each bring unique skills to the table and want our teammates to feel valued from the start. Our onboarding program exposes new hires to the codebase and lets them contribute right away. We move quickly: We ship code multiple times a day. We believe in getting valuable features in front of customers and iteratively improving as we learn what works and what does not. We value product over process: We want the team to have the time and focus on solving complex challenges. We minimize the overhead by setting clear goals and avoiding heavyweight processes and excessive meetings.We share knowledge freely: We share our learnings with each other and with the developer community. Our engineering blog demonstrates how we tackle interesting challenges at Aha! We enjoy: We like what we do. And we want you to love your team and your job too. Learn more about The Responsive Method , our company values , and the generous benefits we offer.Our technology\nOur web application is a single-instance, multi-tenant Ruby on Rails monolith supported by Postgres (database), Redis (background jobs), and memcached (Rails caching). We also run a Node.js webserver to support collaborative editing and real-time updates. Our application is hosted on Amazon Web Services and architected with ECS for reproducibility and scalability.\nWe utilize a growing amount of React on the front end to build rich client-side experiences, including our fully collaborative text editor and our slide presentation editor. We balance the strengths of both technologies — Rails for its conventions and simplicity and React for more powerful interactive functionality.\nWe embrace new technologies that help us deliver a lovable product, but we also remain cognizant of the maintenance overhead that a new library or platform brings. We solve the problems in front of us rather than prematurely optimizing to address issues that may never materialize.\nWe do most of our planning and collaboration in Aha! Roadmaps and built Aha! Develop so that software engineers and their teams could take advantage of those same rich features. We use Slack and Zoom for video calls. (Email? Rarely.)\nYour Experience\nMost of our features involve writing significant Ruby on Rails code, so you should have experience working in a Rails codebase. We also write a lot of React but we are happy to help you learn that part on the job.\nYou Also Have The Below Experience And Skills\nWe believe that being a kind person who elevates the rest of the team is just as valuable as writing great code. You have strong problem-solving skills and experience working on important functionality for a cloud-based product. You are humble, eager to learn, and always willing to help others. You want teammates who enjoy solving problems regardless of the technologies and techniques involved. You have worked at meaningful scale before and want to do so again.\n2+ years of experience working in Ruby on RailsExperience producing scalable, efficient, and maintainable codeExperience building features (ideally at a high-growth SaaS company)Active collaborator with product teamsYour work at Aha!\nAs a Ruby On Rails Engineer, Your Work Will Include\nWe work on a broad range of features across the full stack.\nImplementing new features for our users, touching each layer of the MVC as neededBuilding deeply interactive reporting interfaces using ReactWorking proactively with product and UX to refine and iterate on specifications as the feature takes shapeInvestigating slow performance and optimizing queries to ensure Aha! is snappy and satisfying to useInterfacing directly with users to quickly squash bugs as part of our regular customer support rotation Documenting components in our style guide to help drive consistency\nIf this role sounds appealing, we would love to hear from you. (A real human reviews every application.)\nGrow with us\nEveryone deserves to reach their fullest potential. We know that when we do work that matters with people we care about in a high-growth environment, we feel engaged and alive. And our goal is to help you do just that. We offer all the benefits you would expect and more, including profit sharing. The specific benefits listed below are reflective of what we offer U.S.-based hires. We also do our best to extend identical benefits to international teammates.\nThe base salary range for this role in the US is between $100,000 and $160,000Cash-based compensation also includes profit sharing and we contribute a percentage of your total pay each month towards your retirementMedical, dental, and vision plans — for many teammates, we cover 100 percent of the premiumsUp to 200 hours of paid time off a year to spend however you want30 to 90 days of paid parental leave and five to 10 days of paid care and bereavement leaveUp to $1,000 annually for third-party education, along with paid time off to immerse yourself in learningVolunteer opportunities throughout the year\nBase salary and total compensation are dependent upon many factors, such as: skills, experience, and relevant past roles",
    "Years Experience": "2+ years",
    "Years Context": "....2+ years of experience working in Ruby on RailsExperience producing scalable, efficient, and maintainable co....\n....s of paid time off a year to spend however you want30 to 90 days of paid parental leave and five to 10 days of paid care and ....\n....ities throughout the year....",
    "Skills": "Bootstrap(1)\nPostgres(1)\nNode(1)\nAmazon(1)\nReact (3)\nfront end(1)\nfull stack(1)\nReact(1)",
    "Remote Allowed": true
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3456102325",
    "URL": "https://www.linkedin.com/jobs/view/3456102325/",
    "Job Title": "Ruby on Rails Engineer",
    "Company": "Aha!",
    "Description": "Aha! is a very different type of high-growth SaaS company. We are self-funded, highly profitable, and 100 percent remote. We provide the world's #1 product development software so teams can build products that customers love. More than 600,000 product builders use our suite of tools which includes Aha! Roadmaps , Aha! Ideas , Aha! Create , and Aha! Develop . And they rely on our training programs via Aha! Academy to become product development experts. We are recognized as one of the best fully remote companies to work for, champion the Bootstrap Movement , and have given over $1M to people in need through Aha! Cares . Learn more at www.aha.io .\nOur team\nAha! engineering is a mid-sized, fully remote team that is highly productive. We are centered around North American time zones so we can collaborate during the workday.\nWe help each other grow: We each bring unique skills to the table and want our teammates to feel valued from the start. Our onboarding program exposes new hires to the codebase and lets them contribute right away. We move quickly: We ship code multiple times a day. We believe in getting valuable features in front of customers and iteratively improving as we learn what works and what does not. We value product over process: We want the team to have the time and focus on solving complex challenges. We minimize the overhead by setting clear goals and avoiding heavyweight processes and excessive meetings.We share knowledge freely: We share our learnings with each other and with the developer community. Our engineering blog demonstrates how we tackle interesting challenges at Aha! We enjoy: We like what we do. And we want you to love your team and your job too. Learn more about The Responsive Method , our company values , and the generous benefits we offer.Our technology\nOur web application is a single-instance, multi-tenant Ruby on Rails monolith supported by Postgres (database), Redis (background jobs), and memcached (Rails caching). We also run a Node.js webserver to support collaborative editing and real-time updates. Our application is hosted on Amazon Web Services and architected with ECS for reproducibility and scalability.\nWe utilize a growing amount of React on the front end to build rich client-side experiences, including our fully collaborative text editor and our slide presentation editor. We balance the strengths of both technologies — Rails for its conventions and simplicity and React for more powerful interactive functionality.\nWe embrace new technologies that help us deliver a lovable product, but we also remain cognizant of the maintenance overhead that a new library or platform brings. We solve the problems in front of us rather than prematurely optimizing to address issues that may never materialize.\nWe do most of our planning and collaboration in Aha! Roadmaps and built Aha! Develop so that software engineers and their teams could take advantage of those same rich features. We use Slack and Zoom for video calls. (Email? Rarely.)\nYour Experience\nMost of our features involve writing significant Ruby on Rails code, so you should have experience working in a Rails codebase. We also write a lot of React but we are happy to help you learn that part on the job.\nYou Also Have The Below Experience And Skills\nWe believe that being a kind person who elevates the rest of the team is just as valuable as writing great code. You have strong problem-solving skills and experience working on important functionality for a cloud-based product. You are humble, eager to learn, and always willing to help others. You want teammates who enjoy solving problems regardless of the technologies and techniques involved. You have worked at meaningful scale before and want to do so again.\n2+ years of experience working in Ruby on RailsExperience producing scalable, efficient, and maintainable codeExperience building features (ideally at a high-growth SaaS company)Active collaborator with product teamsYour work at Aha!\nAs a Ruby On Rails Engineer, Your Work Will Include\nWe work on a broad range of features across the full stack.\nImplementing new features for our users, touching each layer of the MVC as neededBuilding deeply interactive reporting interfaces using ReactWorking proactively with product and UX to refine and iterate on specifications as the feature takes shapeInvestigating slow performance and optimizing queries to ensure Aha! is snappy and satisfying to useInterfacing directly with users to quickly squash bugs as part of our regular customer support rotation Documenting components in our style guide to help drive consistency\nIf this role sounds appealing, we would love to hear from you. (A real human reviews every application.)\nGrow with us\nEveryone deserves to reach their fullest potential. We know that when we do work that matters with people we care about in a high-growth environment, we feel engaged and alive. And our goal is to help you do just that. We offer all the benefits you would expect and more, including profit sharing. The specific benefits listed below are reflective of what we offer U.S.-based hires. We also do our best to extend identical benefits to international teammates.\nThe base salary range for this role in the US is between $100,000 and $160,000Cash-based compensation also includes profit sharing and we contribute a percentage of your total pay each month towards your retirementMedical, dental, and vision plans — for many teammates, we cover 100 percent of the premiumsUp to 200 hours of paid time off a year to spend however you want30 to 90 days of paid parental leave and five to 10 days of paid care and bereavement leaveUp to $1,000 annually for third-party education, along with paid time off to immerse yourself in learningVolunteer opportunities throughout the year\nBase salary and total compensation are dependent upon many factors, such as: skills, experience, and relevant past roles",
    "Years Experience": "2+ years",
    "Years Context": "....2+ years of experience working in Ruby on RailsExperience producing scalable, efficient, and maintainable co....\n....s of paid time off a year to spend however you want30 to 90 days of paid parental leave and five to 10 days of paid care and ....\n....ities throughout the year....",
    "Skills": "Bootstrap(1)\nPostgres(1)\nNode(1)\nAmazon(1)\nReact (3)\nfront end(1)\nfull stack(1)\nReact(1)",
    "Remote Allowed": true
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3453705770",
    "URL": "https://www.linkedin.com/jobs/view/3453705770/",
    "Job Title": "Front-End Developer(Junior)",
    "Company": "SynergisticIT",
    "Description": "SynergisticIT understands the complex nature of the job market and how difficult it can be to secure a position, especially for fresh graduates. Therefore, we assist and help tech-savvies to convert their passions into professions. We go above and beyond to keep you working in your niche. \nAs we focus on long-term success, we provide complete career development solutions. From job search to upskilling portfolio and interview preparation, we can guide you at every step of your career.\nSynergisticIT spares no efforts to connect you with a large network of tech giants, including Google, Apple, PayPal, Dell, Cisco, Client, etc. Presently, we are actively looking for entry-level Java Developers with a driven mindset. Get the right opportunity and gain experience in building web-centric solutions on Java.\nQualifications Needed\nBachelor's or Master's degree in any of the following disciplines: Computer Science Electrical Engineering Information Systems Information Technology Computer Engineering.Skills Required 0 to 2 years of experience in Java development Understanding of the software development life cycle Basic knowledge of Core Java Excellent written and verbal communication skills Self-learner, highly motivated, team player, and technically inquisitive Strong work ethics and creative problem-solving abilities Result-oriented approach and ability to meet high-level project requirementsPreferred Skills Spring Boot Microservices Rest WebservicesBenefits Competitive salary Flexible work schedule & part-time off E-verified (Certifications on advanced Java) H1B filing No relocation On job technical support Skill Enhancement Opportunity to work with Fortune 500 Companies \nRoles and Responsibilities As an entry-level Java Developer, you will be responsible for designing, developing, and maintaining Java applications. Troubleshoot problems in Java-based applications. Conduct code testing to ensure faster and seamless app performance. Integrate Java apps with databases, servers, and network systems. Coordinate with other teams to generate optimal outcomes.  Complete app development as per the client's specifications and time frames. Provide user support by building assistance tools and documentations.Who can apply?\nIt is an ideal job for recent IT graduates looking to build a solid career in the tech industry. Anyone with basic programming knowledge in Core JAVA, C++ can apply for this position.\n \nCandidate's Outcome: https://www.synergisticit.com/candidate-outcomes/\n \nNo third-party candidates or c2c candidates\n \nIf you are interested, please apply to the posting.\n \nNo phone calls please, Shortlisted candidates would be reached out.",
    "Years Experience": "2 years",
    "Years Context": "....ills Required 0 to 2 years of experience in Java development Understanding of the software development life cycle Basic knowle....",
    "Skills": "Java(9)\nJAVA(1)",
    "Remote Allowed": true
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3452683771",
    "URL": "https://www.linkedin.com/jobs/view/3452683771/",
    "Job Title": "Senior Software Developer (UI/React)",
    "Company": "Proofpoint",
    "Description": "It's fun to work in a company where people truly BELIEVE in what they're doing!\nWe're committed to bringing passion and customer focus to the business.\nThe Role\nMany companies cannot protect themselves from domain-name based identity deception and brand abuse due to outdated or obsolete infrastructure. Identity Defense made it our mission to bridge this gap. Join one of the fastest growing products at Proofpoint and put an end to this problem.\nOur team is looking for experienced and motivated software developers who are passionate about building rich visual interfaces and action-oriented enterprise software. We value creativity, hard work, and collaboration and support our employees’ needs to balance their work and personal life needs.\nYour day-to-day \nBuild a world class SaaS threat intelligence application.Design APIs that integrate with common Security tools.Work closely with product development and UX to bring the best solution to market.Collaborate with other product teams to ensure a unified customer experience.Grow your career by working across a talented team full of diverse experience and skills.Raise the level of your peers by sharing your knowledge and experience.\nWhat You Bring To The Team\n5+ years of front-end and/or API development experienceDeep understanding with React, HTML5, CSS3 and other modern web technologiesPractical knowledge of modern JavaScript (ES6 / NPM / Webpack) Desire to solve challenging UX and big data visualization problemsDemonstrated experience with unit and end-to-end Testing\nNOTE This role can be either full remote or hybrid. An ideal remote candidate will be in Mountain or Central time zones. The current team primarily resides in the Denver Metro area.\nApplicant must reside in the US or Canada\nIf you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us!\nIf you are a Colorado Resident \nProofpoint carefully considers a wide range of compensation factors, including your background and experience. These considerations can cause your compensation to vary.\nThe hiring range for this position is typically \n125,250.00 - 167,000.00 USD\nActual offer will be based on the individual candidate. Bonus, commission, and/or equity may be eligible for this position.\nAdditional benefits for this position can be found at https //pfptbenefits.com.\nThis statement is being provided in accordance with the Colorado Pay and Benefit Disclosure requirements of sb19-968.\n",
    "Years Experience": "5+ years",
    "Years Context": "....5+ years of front-end and/or API development experienceDeep understanding with React, HTML5, CSS3 and other ....",
    "Skills": "front-end(1)\nReact(1)\nHTML5(1)\nCSS3(1)\nJavaScript(1)",
    "Remote Allowed": true
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3385770210",
    "URL": "https://www.linkedin.com/jobs/view/3385770210/",
    "Job Title": "Software Engineering Intern II - Mail Antispam",
    "Company": "Yahoo",
    "Description": "It takes powerful technology to connect our brands and partners with an audience of nearly 900 million. Whether you’re looking to write mobile app code, engineer the servers behind our massive ad tech stacks, or develop algorithms to help us process trillions of data points a day, what you do here will have a huge impact on our business—and the world. Want in?\nA Little About Us\nThe Yahoo Mail Antispam Team develops and maintains high-performing systems that reliably protect our users from spam, phish, fraud and abuse with advanced ML/AI algorithms. These systems require extreme reliability, resilience and performance. We are tackling some of the toughest challenges in architecture design, algorithm development and data engineering. There are innumerable opportunities to innovate in all these areas.\nYahoo Mail is the ultimate consumer inbox. It is the best way to access your email and stay organized from a computer, phone or tablet. With its beautiful design and lightning fast speed, Yahoo Mail makes reading, organizing, and sending emails easier than ever. Come join this amazing team of Engineers, Product Managers and Designers to work on next generation innovative experiences transforming how users connect with each other every day.\nYour Day\nDesign, implement, test, and debug features of large-scale Mail Antispam systems to prove or deliver towards our upcoming designs & projects; revise and refine as required.Collaborate with a senior technical leader or architect.Learn from a multitude of sources, including on the job project experience, reviewing code from others, team education sessions, collaborating with peers, frequently soliciting advice & shoulder reviews from leaders & architects, as well as online or class-based learning.Participate in agile development with weekly sprints, planning & estimating work, daily standup, & retrospectives.Take initiative to identify, solve, and pursue problems you discover to full completion.Communicate and solicit ideas for your project.Contribute to best practices and work culture of our team.\nYou Must Have\nActively pursuing a MS, or PhD in Computer Science or a related major, and strong record of academic achievementExperience in algorithm design and ML/AIFamiliarity with data mining, text processing and classification algorithmsUnderstanding of statistical methods and exploratory data analysisStrong understanding of the fundamentals including Data Structures, Algorithms, OS and NetworkingExperience in software development with Java, C/C++, or PythonOutstanding troubleshooting and debugging skillsGreat problem solving, listening & communication skills\nLove To Have\nExperience with Big Data technologies like Hadoop, HBase and SparkPrevious exposure to anti-spam or anti-abuse engineeringExperience in large-scale, large-user base system development experienceCyber security knowledgeInternship experience at a tech company\nYahoo is proud to be an equal opportunity workplace. All qualified applicants will receive consideration for employment without regard to, and will not be discriminated against based on age, race, gender, color, religion, national origin, sexual orientation, gender identity, veteran status, disability or any other protected category. Yahoo is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please submit a request via the Accommodation Request Form (www.yahooinc.com/careers/contact-us.html) or call 408-336-1409. Requests and calls received for non-disability related issues, such as following up on an application, will not receive a response.\nAt Yahoo, we know that diversity makes us stronger. We are committed to a collaborative, inclusive environment that encourages authenticity and fosters a sense of belonging. We strive for everyone to feel valued, connected, and empowered to reach their potential and contribute their best. Check out our diversity and inclusion (www.yahooinc.com/diversity/) page to learn more.\nUS Only: Please be aware that Yahoo requires all employees entering a U.S. Yahoo office and/or attending a company event (including client events) are required to be vaccinated for COVID-19. This position will require the successful candidate to obtain and show proof of a vaccination to enter a U.S. Yahoo office and/or attending a company event (including client events). Yahoo is an equal opportunity employer, and will provide reasonable accommodation to those individuals who are unable to be vaccinated consistent with federal, state, and local law.\nThe compensation for this position ranges from $45,760.00 - $135,200.00/yr and will vary depending on factors such as your location, skills and experience. The compensation package may also include incentive compensation opportunities in the form of discretionary annual bonus or commissions, in addition to equity incentives. Yahoo provides industry-leading benefits including healthcare, 401K savings plan, company holidays, vacation, sick time, parental leave and an employee assistance program. Eligibility requirements apply.\nYahoo has a high degree of flexibility around employee location and hybrid working. In fact, our flexible-hybrid approach to work is one of the things our employees rave about. Most roles don’t require specific regular patterns of in-person office attendance. If you join Yahoo, you may be asked to attend (or travel to attend) on-site work sessions, team-building, or other in-person events. When these occur, you’ll be given notice to make arrangements.\nIf you’re curious about how this factors into this role, please discuss with the recruiter.\nCurrently work for Yahoo? Please apply on our internal career site.",
    "Years Experience": "",
    "Years Context": "",
    "Skills": "Java(1)\nPython(1)\nhtml(1)",
    "Remote Allowed": true
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3455992558",
    "URL": "https://www.linkedin.com/jobs/view/3455992558/",
    "Job Title": "ReactJS (UX/UI) Developer - Contract - 100% Remote",
    "Company": "Dice",
    "Description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Right Skale, Inc., is seeking the following. Apply via Dice today!\nReactJS (UX/UI) Developer - Contract - 100% Remote \nWe are looking for a strong UI/ UX Engineer to develop and implement user interface components using React.js concepts and workflows such as Redux, Flux, and Webpack. You will also be responsible for profiling, improving front-end performance, and documenting our front-end codebase.\n Requirements:\nBachelor's degree in computer science, information technology, or a similar field.Previous experience working as a react.js developer.In-depth knowledge of JavaScript, Typescript, CSS, HTML, and front-end languages.Knowledge of REACT tools including React.js, Webpack, Enzyme, Redux, and Flux.Experience with user interface design.Experience with browser-based debugging and performance testing software.Excellent troubleshooting skills.Good project management skills.Agile Mindset - needs to work in a highly dynamic work environment where specs and requirements can change often based on user feedback.\nYou will work remotely but the client teams are based in the bay area and the position would require at least 4 hours to overlap with Pacific Time.\nPay rate - 65-85 DOE\nJob type - Contract\nDuration - 6 Months + extendible\nRight Skale Inc, headquartered in Pleasanton, CA, is an emerging global product development and platform engineering company.\nWith a focus on digital transformation and cloud computing, we provide end-to-end technology solutions and services from strategy, architecture, and consulting to software development.\n provided by Dice",
    "Years Experience": "",
    "Years Context": "",
    "Skills": "React(3)\nRedux(2)\nfront-end(3)\nreact(1)\nJavaScript(1)\nCSS(1)\nHTML(1)\nREACT (1)\ngit(1)",
    "Remote Allowed": true
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3453733481",
    "URL": "https://www.linkedin.com/jobs/view/3453733481/",
    "Job Title": "Dynamics 365 Developer",
    "Company": "DTI (Diversified Technology Inc.)",
    "Description": "Job Title: Dynamics 365 DeveloperLength: long-term, 1+ years (will likely extend to 4 years)Client: Local Government clientLocation: Travel to Chicago for onboarding fingerprinting (reimbursed), 100% remote afterRate: $55-$60/hrWork Authorization: W-2 no C2C or sponsorship available at this time\nResponsibilities:Develop and support Microsoft Dynamics 365 and Azure based applicationsDevelop, deploy, and unit test integration components using approved toolsTroubleshoot components developed on Dynamics 365 and Azure platform and help in resolving defectsAbility to work independently with strong communication skills and client presence\nRequired:3+ yrs of development experience with dynamics CRM (OData, plugins, workflows, API integration using SDK)Integration experience with 3rd party systems using API (Rest/Soap)AZURE services and integrating with Dynamics 365DevOps integration with source control system, dynamics solution, and environment troubleshootingOwn code quality, unit testing, packaging of the code",
    "Years Experience": "1+ years\n4 years",
    "Years Context": "....ength: long-term, 1+ years (will likely extend to 4 years)Client: Local Government clientLocation: Travel to Chicago for onboa....",
    "Skills": "",
    "Remote Allowed": true
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3456268685",
    "URL": "https://www.linkedin.com/jobs/view/3456268685/",
    "Job Title": "UI Frontend developer with CSS and HTML",
    "Company": "Dice",
    "Description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Compass Computing Group, Inc., is seeking the following. Apply via Dice today!\nBring your UI Frontend development talents to Compass Computing Group, twice recognized as one of Portland's Fastest Growing Private 100 companies. Be an integral part of a team that provides outstanding professional I.T. staffing assistance and superb project management services to diverse clients. We have an opportunity for a part time UI Frontend developer. Position can be done 100% remote. Immediate start date and position is part-time on as needed basis with an average of 10 hours a week. You will enhance an existing commercial website. Role is to convert Figma/Adobe XD designs into CSS via Anima or other method.\nRequired Skills and Abilities :\nCSS - must have - 4 + years experienceHTML\nNice to Have Skills and Abilities :\nFigma and/or Adobe XDAnima\nEXPERIENCE :\n4 years demonstrated web design experience in an enterprise environment. Looking for a CSS guru.\nApply now!\n provided by Dice",
    "Years Experience": "4 years",
    "Years Context": "....SS - must have - 4 + years experienceHTML....\n....4 years demonstrated web design experience in an enterprise environment. Looking for a CSS guru.....",
    "Skills": "Frontend(2)\nAdobe(2)\nCSS(3)\nHTML(1)",
    "Remote Allowed": true
  },
  {
    "Date Added": "01/27/2023",
    "Job ID": "3453705770",
    "URL": "https://www.linkedin.com/jobs/view/3453705770/",
    "Job Title": "Front-End Developer(Junior)",
    "Company": "SynergisticIT",
    "Description": "SynergisticIT understands the complex nature of the job market and how difficult it can be to secure a position, especially for fresh graduates. Therefore, we assist and help tech-savvies to convert their passions into professions. We go above and beyond to keep you working in your niche. \nAs we focus on long-term success, we provide complete career development solutions. From job search to upskilling portfolio and interview preparation, we can guide you at every step of your career.\nSynergisticIT spares no efforts to connect you with a large network of tech giants, including Google, Apple, PayPal, Dell, Cisco, Client, etc. Presently, we are actively looking for entry-level Java Developers with a driven mindset. Get the right opportunity and gain experience in building web-centric solutions on Java.\nQualifications Needed\nBachelor's or Master's degree in any of the following disciplines: Computer Science Electrical Engineering Information Systems Information Technology Computer Engineering.Skills Required 0 to 2 years of experience in Java development Understanding of the software development life cycle Basic knowledge of Core Java Excellent written and verbal communication skills Self-learner, highly motivated, team player, and technically inquisitive Strong work ethics and creative problem-solving abilities Result-oriented approach and ability to meet high-level project requirementsPreferred Skills Spring Boot Microservices Rest WebservicesBenefits Competitive salary Flexible work schedule & part-time off E-verified (Certifications on advanced Java) H1B filing No relocation On job technical support Skill Enhancement Opportunity to work with Fortune 500 Companies \nRoles and Responsibilities As an entry-level Java Developer, you will be responsible for designing, developing, and maintaining Java applications. Troubleshoot problems in Java-based applications. Conduct code testing to ensure faster and seamless app performance. Integrate Java apps with databases, servers, and network systems. Coordinate with other teams to generate optimal outcomes.  Complete app development as per the client's specifications and time frames. Provide user support by building assistance tools and documentations.Who can apply?\nIt is an ideal job for recent IT graduates looking to build a solid career in the tech industry. Anyone with basic programming knowledge in Core JAVA, C++ can apply for this position.\n \nCandidate's Outcome: https://www.synergisticit.com/candidate-outcomes/\n \nNo third-party candidates or c2c candidates\n \nIf you are interested, please apply to the posting.\n \nNo phone calls please, Shortlisted candidates would be reached out.",
    "Years Experience": "2 years",
    "Years Context": "....ills Required 0 to 2 years of experience in Java development Understanding of the software development life cycle Basic knowle....",
    "Skills": "Java(9)\nJAVA(1)",
    "Remote Allowed": true
  }
]
