[{"jobId": "3240000386", "title": "CPU Design Verification Engineer", "company": "Accenture", "description": "We Are:\n\nThe Silicon Design group is a diverse team of world class silicon engineers. We have 100+ years of cumulative hands-on experience in architecture, logic design, verification, physical design, emulation and firmware. We use the latest silicon technologies and processes to help our clients create well-designed solutions to highly complex challenges. We are designing and developing next-generation, high performance SoCs, supporting our clients in their drive to deliver their product vision to their users. We are involved in all aspects of chip design from definition and architecture through to verification and signoff. Accenture engineers are true “Silicon to SW” Partners, allowing a new breed of companies in the semiconductor ecosystem to innovate in an unparalleled time to market.\n\nYou Are:\n\nAn experienced SoC Design Verification Engineer able to provide design verification services for multi CPU/DSP SoC.\n\nThe Work:\n\nTestbench development - System Verilog UVM and C tests\n\nIntegration/development of C tests/APIs and SW build flow\n\nIntegration/development of UVM mailboxes and HW/SW communication components\n\nTest plan development\n\nPower Aware testbench development and simulations\n\nSeamless porting between simulation/emulation/prototyping platforms\n\nRegression setup and debug for RTL/Gate Level Netlist/UPF PA sim/Emulation/Proto\n\nCoverage collection and closure\n\nWorking with cross functional teams (DV/Arch/Design/FW) to identify coverage scope\n\nEngage with the team to drive continuous improvement to the verification environment to find more bugs and improve coverage\n\nWork as a team to grow together.\n\nMentor and coach junior team members\n\nHere’s what you need:\n\nA minimum of five years of experience with CPU Design Verification\n\nBachelor’s Degree or equivalent (12 years) work experience (If an, Associate’s Degree with 6 years of work experience)\n\nBonus points if:\n\nExperience with ARM Cortex\n\nIn-depth knowledge of digital logic design, chip architecture and microarchitecture\n\nExperience in developing TestPlan/testbenches, SystemVerilog/UVM/C-based TestBench, and writing/debugging tests\n\nExperience with advanced verification techniques such as different booting verification, end-to-end verification; multiple CPUs verification as part of the IP is desirable.\n\nExperience in ARM AMBA protocols; AXI4, AHB and APB.\n\nTeam player with excellent communication skills and be able to work independently on the verification efforts for a block/area of the design\n\nCompensation for roles at Accenture varies depending on a wide array of factors including but not limited to the specific office location, role, skill set and level of experience. As required by local law, Accenture provides a reasonable range of compensation for roles that may be hired in California, Colorado, New York City or Washington as set forth below and information on benefits offered is here.  \n\nRole Location: Range of Starting Pay for role\n\nCalifornia: $67,900-$163,000\n\nColorado: $67,900-$163,000\n\nNew York City: $78,600- $188,600\n\nWashington: $72,300- $173,500\n\nWhat We Believe\n\nWe have an unwavering commitment to diversity with the aim that every one of our people has a full sense of belonging within our organization. As a business imperative, every person at Accenture has the responsibility to create and sustain an inclusive environment.\n\nInclusion and diversity are fundamental to our culture and core values. Our rich diversity makes us more innovative and more creative, which helps us better serve our clients and our communities. Read more here\n\nEqual Employment Opportunity Statement\n\nAccenture is an Equal Opportunity Employer. We believe that no one should be discriminated against because of their differences, such as age, disability, ethnicity, gender, gender identity and expression, religion or sexual orientation.\n\nAll employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law.\n\nAccenture is committed to providing veteran employment opportunities to our service men and women.\n\nFor details, view a copy of the Accenture Equal Opportunity and Affirmative Action Policy Statement.\n\nRequesting An Accommodation\n\nAccenture is committed to providing equal employment opportunities for persons with disabilities or religious observances, including reasonable accommodation when needed. If you are hired by Accenture and require accommodation to perform the essential functions of your role, you will be asked to participate in our reasonable accommodation process. Accommodations made to facilitate the recruiting process are not a guarantee of future or continued accommodations once hired.\n\nIf you would like to be considered for employment opportunities with Accenture and have accommodation needs for a disability or religious observance, please call us toll free at 1 (877) 889-9009, send us an email or speak with your recruiter.\n\nOther Employment Statements\n\nApplicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States.\n\nCandidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.\n\nJob candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process.\n\nThe Company will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. Additionally, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the Company's legal duty to furnish information.\n\n", "years experience": [], "years context": ["ineers. We have 100+ years of cumulative hands-on experience in architecture, logic design, verification, physical design, emu", "A minimum of five years of experience with CPU Design Verification", "ee or equivalent (12 years) work experience (If an, Associate’s Degree with 6 years of work experience)"], "skills": ["git", "express", "express"], "listedAt": 1674558915000}, {"jobId": "3449241095", "title": "Retail Sales Associate", "company": "Burlington Stores, Inc.", "description": "LOCATION 1485 Highway 138 SE Conyers GA US 30013\n\nOverview\n\nIf you want an exciting job with one of the largest off-price retail stores in the nation, join the Burlington Stores, Inc. team as a Retail Sales Associate! Are you an outgoing, upbeat, people-person with great organizational skills? Would you thrive in a high-energy environment where associates work together to drive results? Is it important to you to make a difference in the community where you live and work? If you answered yes, then this may be the right opportunity for you.\n\nRetail Sales Associates are important ambassadors of the Burlington brand, at the front lines in our mission to provide world-class service to our customers. You’ll be responsible for greeting and assisting customers, maintaining a neat, organized and clean sales floor, and supporting the management team with day-to-day store operations. Retail Sales Associates may be assigned to work in any or all of the following departments: Ladies, Men, Youth, Sportswear, Shoes, Home, or Baby Depot.\n\nResponsibilities\nAssisting customers in locating merchandise when neededAssisting in floor moves, merchandising, display maintenance, and housekeepingAssisting in ringing up sales at registers and/or bagging merchandisePerforming other tasks as assigned by manager from time-to-time\nCandidates must be able to work a flexible schedule; including nights, weekends and holidays as required.\n\nIf you…\n\n…are excited to deliver great values to customers every day;\n\n…take a sense of pride and ownership in helping drive positive results for a team;\n\n…are committed to treating colleagues and customers with respect;\n\n…believe in the power of diversity and inclusion;\n\n…want to participate in initiatives that positively impact the world around you;\n\nCome join our team. You’re going to like it here!\n\nYou will enjoy a competitive wage, flexible hours, and an associate discount. Part-time associates, based on hours worked, may be eligible for Burlington’s benefits package which includes dental and vision coverage, and including life insurance. Part-time associates may also be eligible for paid time off, paid holidays and a 401(k) plan.\n\nWe are a rapidly growing brand, and provide a variety of training and development opportunities so our associates can grow with us. Our store teams work hard and have fun together! Burlington associates make a difference in the lives of customers, colleagues, and the communities where we live and work every day. Burlington Stores, Inc. is an equal opportunity employer committed to workplace diversity.\n\nLocation US-GA-Conyers\n\nPosting Number 2022-191252\n\nAddress 1485 Highway 138 SE\n\nZip Code 30013\n\nWorkplace Type On-Site\n\nPosition Type Regular Part-Time\n\nPosted Date 4 weeks ago (12/29/2022 12:58 PM)\n\nCareer Site Category Store Associate\n\nPosition Category Store Associate\n\nEvergreen Yes\n\nMin USD $9.00/Hour\n\nMid USD $9.00/Hour", "years experience": [], "years context": [], "skills": [], "listedAt": 1674495542000}, {"jobId": "3451491420", "title": "Commercial Parts Pro", "company": "Advance Auto Parts", "description": "Job Description\n\nJob Description\n\nProfessional level sales position capable of supporting advanced functions on the commercial side of the business. Position is responsible for profitable growth of the commercial business via customer retention and growth. Position partners with GM to manage Team Members. The role has expert knowledge of automotive system and part knowledge. The role has the ability to source from numerous places including special order, FDO, second source, etc. The role has the ability to direct the drivers to ensure timely and accurate delivery. Position is full time.\n\n \n\nPrimary Responsibilities\n Maintain commercial customer relationships Provide GAS2 selling experience commercial customers Achieve personal / store sales goals and service objectives Provide day-to-day supervisory support for Team Members Collaborate with GM on coaching and developmental needs for Team Members Dispatch drivers ensuring delivery standards are achieved Maintain commercial stocking programs Build and maintain a network of second source suppliers\n \n\nSecondary Responsibilities\n Maintain core bank and commercial returns Maintain commercial credit accounts Partner with GM to ensure proper driver coverage\n \n\nSuccess Factors\n Friendly communication Ability to locate and stock parts Safety knowledge and skills Operating inventory systems and store equipment Parts and automotive system knowledge skills Operating POS and Parts lookup systems ASE P2 certified or ASE ready equivalent Advanced solution, project and product quality recommendation ability Ability to source from numerous places including special order, FDO, second source, etc. Advanced selling skills for commercial customers Ability to multi-task and remain organized\nEffective communication, listening and problem solving skills\n\nEssential Job Skills Necessary for Success as a Commercial Parts Pro\n Working knowledge of automotive systems, and diagnostic ability to include: internal engine, suspension, brakes, electronic, exhaust, etc. Speak and write English (Spanish a plus); communicate effectively and build strong relationships with customers, peers and management Ability to read and interpret documents such as safety rules, operating and maintenance instructions, parts catalogs, and procedure manuals; ability to write simple correspondence Understand and execute instructions furnished in written, oral, or diagram form Successfully complete the Parts Knowledge Assessment Use basic math accurately: add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals Use Microsoft software effectively (Word, Excel required) Strong organizational skills Understand Commercial profitability concepts, including knowledge of competition, market opportunities, and customer prioritization (may work with the Commercial Account Manager to determine pricing discounts for specific Commercial customers) Ability to work an assortment of days, evenings, and weekends as needed\n \n\nPrior Experience that Sets a Commercial Parts Pro up for Success \n\nA minimum of 3 years of prior automotive parts experience preferred\n\nProven sales ability with past experience in fulfillment of customer transactions\n\nFormal or informal experience leading teams, including supervising daily tasks, and working together to achieve goals\n\nEducation\n\nHigh school diploma or general education degree (GED)\n\nCertificates, Licenses, Registrations\n\nASE Certification Preferred, But Not Required\n\nPhysical Demands \n\nThe physical demands and work environment described here are representative of those that must be met by an employee to successfully perform the essential functions of this job, with or without reasonable accommodation. While performing the duties of this job, the employee will predominantly be walking or standing. The employee is required to be able to talk and hear, and use hands and fingers to handle or feel; reach with hands and arms; climb or balance; and stoop, kneel, crouch, or crawl. The employee must frequently lift and/or move up to 50 pounds and occasionally lift and/or move up to 100 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, depth perception, and ability to adjust focus.\n\nWork Environment\n\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job, with or without reasonable accommodation. While performing the duties of this job, the employee is usually working inside; however, they will occasionally be outside and exposed to various weather conditions while performing such tasks as installing batteries and wiper blades. The employee is also occasionally exposed to moving mechanical parts; high, precarious places; toxic or caustic chemicals; risk of electrical shock; explosives; and vibration. The noise level in the work environment is usually moderate.\n\nPosition is eligible for sales commission based on individual or store performance.\n\nCalifornia Residents Click Below For Privacy Notice\n\nhttp://www.worldpaccareers.com/uploads/2/4/0/4/24047148/advance_auto_parts_--_california_candidate_privacy_notice.pdf\n\nAAPRTL\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age national origin, religion, sexual orientation, gender identity, status as a veteran and basis of disability or any other federal, state or local protected class.", "years experience": [], "years context": ["A minimum of 3 years of prior automotive parts experience preferred"], "skills": [], "listedAt": 1674516314000}, {"jobId": "3452352812", "title": "Java - Lead SaaS Engineer (remote)", "company": "Addison Group", "description": "Direct Hire remote Lead SaaS Engineer opportunity available for a fast-growing tech company\n responsible for building and leading a world class engineering teamAccountable for executing roadmap of SaaS division Strategize with CTO on solutionsWorking in agile methodologiesDegree is required5+ years as a Full Stack Developer experienced in Java Spring Boot and Hibernate on the backend, and Vue, React, or Angular on the frontend\ncompensation $175K-$220K + equity", "years experience": [], "years context": ["Degree is required5+ years as a Full Stack Developer experienced in Java Spring Boot and Hibernate on the backend, and Vue, Re"], "skills": ["Full Stack", "Java", "React", "frontend"], "listedAt": 1674579518000}, {"jobId": "3450054298", "title": "Data Center Superintendent", "company": "Jobot", "description": "Come work for a top GC in the US!\nThis Jobot Job is hosted by Dan Miller\nAre you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.\nSalary $170,000 - $220,000 per year\nA Bit About Us\nThe Superintendent is responsible for field operations on the project assigned in order to achieve timely and profitable completion of each project. The Superintendent directly supervises field labor force, including laborers/craft workers. This position must demonstrate strong leadership, organizational and time management skills, as well as have strong communication and client service skills.\n\n\nWhy join us?\n\n Top GC  Large Projects Great Pay & Benefits Job Stability\nJob Details\n + years of construction experience working with ground-up Data Centers  B.S. Degree in Construction Management, or a related field, is preferred \nWhat you will be doing\n Supervising foremen, carpenters and laborers  Mentoring Junior Staff Provide Leadership\nInterested in hearing more? Easy Apply now by clicking the \"Apply\" button.\n", "years experience": [], "years context": ["0,000 - $220,000 per year", " + years of construction experience working with ground-up Data Centers  B.S. Degree in Construction Managem"], "skills": [], "listedAt": 1674577667000}, {"jobId": "3450038760", "title": "Veterans - Entry Level Software Developer", "company": "FDM Group", "description": "Are you a military veteran with the drive to succeed in fast-paced technical environments? Do you communicate well, possess outstanding critical thinking skills, and have a strong aptitude for working in teams? Then FDM wants to launch your civilian career as a Technical Consultant.\nAbout the FDM Veterans Career Development ProgramFDM’s Veterans Career Development Program is a great way for veterans to transition into corporate careers. We recruit and train qualified military veterans aspiring to become IT and business professionals. Technology makes the world a better place and we believe passion, drive and curiosity are what you need to have a successful career in tech. This is why we do not require any previous experience nor college degree to join.\nThe program begins with training in one of our career streams in business and technology that are in high demand in the job market. We will provide you with the industry-specific technical and professional skills you need in your chosen stream, after which you will start working as an FDM Consultant with our globally recognized clients.\nUpon completion of the program, many see their journey with FDM culminating in an accelerated career progression, better placing them to apply for senior roles within the industry.\nWe are currently seeking candidates interested in building a career in a range of specialties within our Technical Pathway which include:· Software Development· Technical Operations· Cloud Computing Engineering· Business Intelligence\nMinimum Qualifications· A strong aptitude for technology and the interest and drive to expand your technical skill set.· Eager, ambitious, and adaptable to change.· Able to commit to work for FDM for a minimum of two years working as an FDM consultant following the training period.· Eligible to work in the US.\nBenefitsA chance to work for some of the most prestigious companies in the world.Opportunity to earn professional certifications related to your career path.Continuous career support and upskilling from FDM.Comprehensive and competitive benefits package.Access to a network of mentors and like-minded individuals.Relocation support (if necessary).Industry recognized paid training.\nDiversity and InclusionDiversity and inclusion are at the heart of what we value as an organization. FDM is a globally recognized organization with centers across seventeen countries globally. We are proud to celebrate our employee backgrounds consisting over 85 nationalities.\nFDM Group is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, national origin, age, disability, veteran status or any other status protected by federal, provincial or local laws.", "years experience": [], "years context": ["for a minimum of two years working as an FDM consultant following the training period.· Eligible to work in the US."], "skills": ["ios", "aws"], "listedAt": 1674572242000}, {"jobId": "3447581344", "title": "Retail Sales Associate", "company": "Jos. A. Bank Clothiers", "description": "We invest in our people and continuously work towards fostering an inspirational, inclusive, and innovative culture, so that every team member has a true sense of belonging. We help people confidently express their true selves so they can be their best. \n\nWe Have Immediate Openings – Start Right Away! \n Competitive hourly rates Flexible schedules to meet your availability! Tuition reimbursement Generous employee discount on first purchase Ongoing discounts on purchase made at any Tailored Brands store.\nWhat You Bring\n Customer service – or as we call it – culture of customer-obsession by being customer-ready and delivering a world-class experience every day Desire to learn and adapt to new programs Ability to work well and consult with retail sales associates at all levels and contribute to a positive work environment\nOur Retail Sales Associates are responsible for all aspects of the customer experience within multiple businesses (retail, rental, custom, and omni-channel) within a store location including, but not limited to:\n Engage as a member of a high-performing team through trust, commitment, and a focus on results. Build a relationship with your customer from greeting through post-sale contact. Consistently demonstrate the benchmark selling techniques for retail sales, custom clothing sales, and special occasion rentals. Continuously encourage and participate in team selling and positively impact the achievement of the store sales volume and metrics goals. Assist with visually merchandising, set up, and other store-related projects, as well as conducting merchandise stock counts. Handle the cash register, as a cashier, at the point of sale in the store.\nPhysical Requirements\n Ability to stand and walk for the majority of work shift, frequently bend, squat and twist, lift up to 50 lbs., climb a ladder to reach merchandise and or supplies, and see and distinguish between fabric patterns and colors.\nYou may have the opportunity to voluntarily work between multiple store or site locations, and across multiple brands. \n\nReasonable accommodations may be made to enable individuals with disabilities to perform the essential functions\n\nOur company celebrates diversity and provides equal employment opportunity to all applicants and employees without regard to race, color, sex, sexual orientation, gender identity or expression, national origin, religion, veteran or military status, age, physical or mental disability, marital status, or any other protected status under the law.\n\nWork Locations: 00448 Marietta 3625 Dallas Hwy Sw Ste 600 Marietta 30064\n\nJob: Sales\n\nOrganization: JoS.A.Bank\n\nShift: Variable\n\nZone: South", "years experience": [], "years context": [], "skills": ["express", "express"], "listedAt": 1674536046000}, {"jobId": "3452060899", "title": "Retail Sales Specialist", "company": "O'Reilly Auto Parts", "description": "O'Reilly is now hiring Retail Sales Specialists who will provide professional services while delivering an excellent customer service experience for all customers. These team members assist Store Managers with sales, customer service, and store appearance and operations. They will also assume shift management responsibilities in the absence of the store and assistant store managers.\n\nEssential Job Functions\nEnsure all customers are served professionally by store team membersOversee counter sales to ensure team members perform customer services satisfactorilyEnsure all team members are working designated schedules and clocking in/out according to policyPerform all store closing duties, i.e. closing cash drawers, locking and securing the building and delivery vehicles, ensuring security system is on, etc.Protect company and store assets by greeting and observing customers and employees on the display floor\nQualifications\nAbility to provide outstanding, friendly, and professional customer service Retail sales experience, preferably in auto parts is desired but not requiredAutomotive systems and repair knowledge is desired but not requiredASE certification preferred\nO'Reilly takes pride in our company culture, so team members should also hold our culture values as true to their own. O'Reilly values are centered on Commitment, Dedication, Teamwork, Safety/Wellness, Enthusiasm, Expense Control, Honesty, Professionalism, Respect, Hard Work, and a Win-Win Attitude. Above all is Excellent Customer Service, which is the core of O'Reilly and the most important responsibility of our team members.\n\nBenefits\n\nAll full time team members are eligible for a benefits package that is designed to offer convenience and security to our team members and their families. Programs, resources and benefit eligibility varies based on employment status, average hours worked, location and length of service. For detailed benefits info, please click here or type http://bit.ly/ORLYBenefits in your browser.", "years experience": [], "years context": [], "skills": [], "listedAt": 1674563857000}, {"jobId": "3450052489", "title": "Senior Specialist Database Administrator", "company": "Waystar", "description": "In this role, the Sr. Specialist DBA will provide SQL Server administration, design, and development support in our diverse, fast-paced, & growing environment. The Sr. Specialist Database Administrator will also analyze system performance, database performance, system health checks, and collaborate with Application Engineering teams to tune new and existing database access interfaces. This role provides plenty of opportunity for personal growth and development, while interacting with a positive, open team that is supportive of continued knowledge sharing and team advancement.\nWhat You'll Be Doing\nPerforms system and application monitoring and alerting related to the SQL Server environment Works with the Application Engineering teams in maintaining stored procedures, indexes, etc. Automates Systems Management tasks Conducts Performance Analysis and tuning, specifically in a .NET/MS SQL environment Operationalizes new technologies introduced into the environment Coaches team members, helping them develop into more senior/experienced resources Reviews the work of team members in SQL interface/database design Works with the Business Product Owners to identify priorities for Application Development and enhancements; acquires resources for projects to fit the current and future needs of the Business Onboards new team members Participates in an on-call response rotation (24x7 environment) Additional duties as assigned \nWhat We're Looking For\nAbility to demonstrate creative thinking, advanced problem-solving, and troubleshooting Experience administering MS SQL Server (versions 2008, 2012, 2014, & 2016) Knowledge of High Availability solutions, such as Mirroring, Replication, Clustering, & Always On (Availability Groups) Understanding of database security users and roles Basic performance monitoring and analysis of SQL queries Strong teamwork, interpersonal skills, integrity, and personal responsibility Eager to learn new technologies & take personal responsibility/ownership for technical projects Ability to review data scripts and communicate feedback to teams Can effectively write performant SQL queries Understanding of data recovery techniques from backup/restore Can effectively monitor real-time transaction processing and identify issues Solves complex technical problems with little oversight Can design solutions with the overall product direction in mind Reviews the work of team members Able to plan and initiate a multi-sprint project Experience with clustered database setup Thorough understanding of database replication techniques, including Always On Can effectively communicate and guide Application Engineering teams in SQL development Deep knowledge of one or more internal SQL Server technologies Highly-specialized knowledge in the given technical or product domain Bachelor’s degree in related field or equivalent work experience \nPreferred Skills\n6+ years’ experience is preferred 4+ years’ experience in query optimization and performance tuning, using SQL Profiler and other troubleshooting tools, such as the SolarWinds Data Performance Analyzer Permissions/User Management experience is highly preferred Experience with Microsoft Azure, SSIS, SSAS, or PowerShell \nWaystar provides cloud-based technology that simplifies and unifies healthcare payments. Together, our technology, data and client support streamline workflows and improve financials for our clients, so that they can focus on their patients. We are deeply committed to living out our organizational values: honesty; kindness; passion; curiosity; fanatical focus; best work, always; making it happen; and joyful, optimistic and fun.\nWaystar products have won Best in KLAS® or Category Leader every year since 2010 and earned multiple #1 rankings from Black Book™ surveys since 2012. The Waystar platform supports more than 500,000 providers, 1,000 health systems and hospitals, and 5,000 payers and health plans. For more information, visit waystar.com or follow @Waystar on Twitter.", "years experience": [], "years context": ["6+ years’ experience is preferred 4+ years’ experience in query optimization and performance tuning, using S", "ategory Leader every year since 2010 and earned multiple #1 rankings from Black Book™ surveys since 2012. The Waystar platfor"], "skills": ["SQL", "SQL", "SQL", "SQL", "SQL", "SQL", "SQL", "SQL", "SQL", "SQL", "ios"], "listedAt": 1674576614000}, {"Date Added": "01/27/2023", "Job ID": "3407411228", "URL": "https://www.linkedin.com/jobs/view/3407411228/", "Job Title": "Senior Software Engineer - REMOTE", "Company": "Allscripts", "Description": "Welcome to Veradigm! Our Mission is to be the most trusted provider of innovative solutions that empower all stakeholders across the healthcare continuum to deliver world-class outcomes. Our Vision is a Connected Community of Health that spans continents and borders. With the largest community of clients in healthcare, Veradigm is able to deliver an integrated platform of clinical, financial, connectivity and information solutions to facilitate enhanced collaboration and exchange of critical patient information.\nJob Summary\nThe purpose of this role is to understand requirements/business cases/user stories and apply computer science, engineering, and mathematical analysis to design, develop and test the application meeting the acceptance criteria. This involves understanding and applying one or more software or scripting languages.\nEssential Functions\nWork closely with analysts and other developers to ensure the solution you implement meets business needsWrite correct, well-factored code that is testable, maintainable, and demonstrates best practices within agreed upon timelinesWrite and execute test cases as needed to validate code changesWork in an agile team environment and actively participate in grooming, standups, and planning sessionsReview and provide constructive feedback on team members’ work per peer-review processSupport and troubleshoot production issues when necessary and aid operations teams to resolve issuesCreate technical specifications, documentation, and design documentation as required\nJob Requirements\nBachelor’s Degree or equivalent (Preferred)2-4 years relevant work experience (Preferred)Solid communication skillsUp to 10% travel may be required\nKnowledge, Skills And Abilities\n2+ years of experience working with the following:C#, .NET CoreSQL Server or Snowflake1+ years of experience cloud development (Azure, AWS, etc.)Azure DevOps experienceAngularExperience in test driven developmentFamiliarity with HEDIS or other healthcare quality analytics concepts preferred\nWe strongly advocate that our associates receive all CDC recommended vaccinations in prevention of COVID-19.\nVisa Sponsorship is not offered for this position.\nAt Veradigm, our greatest strength comes from bringing together talented people with diverse perspectives to support the technology needs of 180,000 physicians, 1,500 hospitals and 10,000 postacute organizations across the globe. Veradigm offers a comprehensive compensation and benefits package, including holidays, vacation, medical, dental, and vision insurance, company paid life insurance and retirement savings.\nVeradigm’ policy is to provide equal employment opportunity and affirmative action in all of its employment practices without regard to race, color, religion, sex, national origin, ancestry, marital status, protected veteran status, age, individuals with disabilities, sexual orientation or gender identity or expression or any other legally protected category. Applicants for North American based positions with Veradigm must be legally authorized to work in the United States. Verification of employment eligibility will be required as a condition of hire. Veradigm is proud to be an equal opportunity workplace dedicated to pursing and hiring a diverse and inclusive workforce.\nFrom a \"VEVRAA Federal Contractor\" We request Priority Referral of Protected Veterans\nThis is an official Veradigm Job posting. To avoid identity theft, please only consider applying to jobs posted on our official corporate site.\nThank you for reviewing this Veradigm opportunity! Does this look like a great match for your skill set? If so, scroll on down and tell us more about yourself!\n", "Years Experience": "2-4 years\n2+ years\n1+ years", "Years Context": "....alent (Preferred)2-4 years relevant work experience (Preferred)Solid communication skillsUp to 10% travel may be required....\n....2+ years of experience working with the following:C#, .NET CoreSQL Server or Snowflake1+ years of experience....", "Skills": "SQL(1)\nAWS(1)\nexpress(1)", "Remote Allowed": true}, {"Date Added": "01/27/2023", "Job ID": "3455733550", "URL": "https://www.linkedin.com/jobs/view/3455733550/", "Job Title": "Retail Sales – Part Time", "Company": "Lowe's Companies, Inc.", "Description": "We are happy you have taken time out of your day to check out this Retail Sales Associate opportunity with Lowe's. Do any of the following statements match your current goals?\n I'm at least 18 years old, and I want to share my whole self in an inclusive work environment I want to work for a company who welcomes and appreciates the military community I'm retired, but I still want to work part-time or full-time I currently have a job and need supplementary income I want to build a career with a company that doesn’t require a four-year degree I'm a stay-at-home parent, ready to return to work I need flexibility in my schedule because I have children or other responsibilities I'm interested in debt-free education, tuition reimbursement, or certificate programs I want to learn a skilled trade and possibly start my own company I am bilingual I love DIY projects\nWhatever your need for employment, we at Lowe's believe we can help you build a better life and career, and we are all-in to help you achieve your goals. We are hiring immediately for this role, so make sure you apply today.\nHere's what you will do in this role:\nAs a Lowe's Retail Sales Associate – Part-Time, you are the key to our customers' positive shopping experiences. You will be the smiling person who greets customers as they enter our doors or shop our aisles. You will engage customers regarding the types of projects they are working on and how you may help. You will guide shoppers to the right products or introduce them to the appropriate sales specialist who can assist. As you learn more about your department and Lowe's, you will understand which products naturally go together. It will be your responsibility to ensure that you share this knowledge with your customers. Here's an example: If a customer is looking for a lamp, do they need a shade? What about light bulbs? See, it's that simple!\nLowe's offers jobs for people who aren't interested in sitting behind a desk for hours. Instead of answering phones, you might be in the store or the garden center, walking, talking to our customers, watering plants, and restocking items. Depending on your department, some lifting (building materials, paint, or maybe mulch) may be required with or without assistance.\nWhat's in It for You?\nBeyond the chance to make a difference for customers and teammates, each day will allow you to learn, grow, and celebrate wins together with your Lowe's team. Our associates enjoy the following benefits:\n A 10% discount on everything at Lowe's Eligible for debt-free education and skilled trade programs Access to comprehensive physical, mental, and financial benefits * Opportunity to earn quarterly bonuses Flexible schedules to fit your lifestyle Career growth—over 50% of our leaders started as hourly associates\nYour Day at Lowe's\n Deliver excellent customer service Help customers find products and provide recommendations Help load customer merchandise Restock merchandise\nRequirements\n Be able to lift up to 25lbs. unassisted, or over 25lbs assisted. Possess 6 months experience operating common retail technology, smartphones, tablets, or computers. For individuals with disabilities who would like to request an accommodation, email HRServiceCenter@lowes.com.\nBilingual applicants are encouraged to apply.\n Benefits offerings change each year and eligibility varies. For the most up-to-date breakdown of what's available to you, visit MyLowesBenefits.com.\nLowe's adheres to CDC cleanliness and social distancing guidelines. Learn more at: lowes.com/l/safe.html\nBilingual, Military, and Veteran applicants are encouraged to apply.\nEEO Statement\nLowe's is an equal opportunity employer and administers all personnel practices without regard to race, color, religious creed, sex, gender, age, ancestry, national origin, mental or physical disability or medical condition, sexual orientation, gender identity or expression, marital status, military or veteran status, genetic information, or any other category protected under federal, state, or local law.", "Years Experience": "18 years", "Years Context": ".... I'm at least 18 years old, and I want to share my whole self in an inclusive work environment I want to work for a compan....\n....fferings change each year and eligibility varies. For the most up-to-date breakdown of what's available to you, visit MyLowes....", "Skills": "html(1)\nexpress(1)", "Remote Allowed": false}, {"Date Added": "01/27/2023", "Job ID": "3453185161", "URL": "https://www.linkedin.com/jobs/view/3453185161/", "Job Title": "Technician C", "Company": "AAA-The Auto Club Group", "Description": "Position Description\nUnder general supervision, the Service Technician C position is responsible for performing the repair and maintenance of automobile and truck vehicles for which they are fully trained. Completes routine scheduled maintenance services on automobiles and trucks as directed by manager or service consultant.\nWhat You’ll Do\nWe are an established automobile club, but we don't take our trusted reputation for granted. We earn our members' loyalty every day, with every service, phone call, and face-to-face interaction. AAA is dedicated to making sure our members have efficient, safe, and positive experiences on the road and with us, wherever they may be.\nAs a Service Technician C You Will In an efficient and productive manner, performs basic automotive repairs, adjustments and maintenance procedures as outlined on repair order for which technician is trained.Oil changes, tire replacement and repairs, general maintenance repairs, fluid exchanges, alignments, brake services are expected to be learned and performed.Drives vehicles into service bay, prepares them for and completes digital vehicle inspection.Test drives vehicles and prepares vehicle for delivery to customer after necessary repairs and maintenance.Maintains cleanliness of shop and work areas, performs other duties as necessary.\nEducation\nWHO YOU ARE\nHigh School diploma, GED or Technical school graduate, certificationMust possess valid driver’s license\nExperience\n2 years minimum experience repairing vehicles at dealership or automotive cen\nKnowledge And Skills\nKnowledge of automotive and/or truck systems, tools and technical resources and training to independently perform a variety of usually basic repairs and maintenance of automobile and truck vehicles.Understand and consistently demonstrate the proper use of equipment and tools used in such repair and maintenance and the need to maintain a clean, safe and organized work area.Ability to consistently provide exceptional customer service and improve customer service scores.\nPreferred Qualifications\nASE Certifications (or their equivalent). A4-Suspension & Steering, A5-BrakesG1-Auto Maintenance & Light Repair preferredState inspection certificate where applicableAC 609 Certification\nWHY AAA?\nWhat Makes Us Different\nYou enjoy helping others and are focused on driving results. You have lots of choices of who to work with. We help others.As a member organization, AAA is passionately committed to providing our members and customers with Value, Safety, and Total Peace of Mind in all things related to Automotive, Travel, Insurance and Member Benefits.We are focused on growth.We are 2 million plus members strong with continued job growth over the past 20 years and counting. Build your skills, experience and thrive in a company that has a demonstrated track record of stability & growth.State of the Art Repair equipmentOnline training available from industry leading strategic vendors at no cost to youASE preparation via online trainingASE Certification Exam reimbursementBonus for each ASE test/recertification passedIn the state of NC, we pay for State Inspectors LicenseWe offer a competitive Total Compensation package.  You know compensation goes way beyond take-home pay. AAA offers best in class benefits. . . excellent medical coverage, dental, vision, etc.Free AAA membershipFree uniformsFree shoesUp to 3 weeks of vacation your first year11 paid holidaysWe offer profit sharing, and 401k with matching contributions.Automatic 4% 401K employer contribution401K match of 50% up to 6% contribution(6% personal contribution @ 50% match = 3% company contribution + 4% automatic company contribution = 7% of your annual income)Hourly pay range starts at $17.32/hour (starting hourly rate based on experience)In addition to base hourly pay, Service Technician A positions are eligible for :Variable pay based on productivity: earned on every hour produced over 40 hours in a given weekAnnual Incentive OpportunityCertification Bonus OpportunityWe are committed to work-life balance.Closed SundayShorter workdays than competitor (we close at 6pm)Monday – Friday, hours are 7:30am-6pmSaturday, hours are 8am to 4pmClosed major holidays\nCOME JOIN OUR TEAM\nWe are members serving members. We are committed. We aspire to create a workplace that helps others, members and team members alike. This is What Makes Us . . . Us. Come join our team.\nAbout Car Care – At AAA Car Care, we are your preferred automotive experts providing customers with friendly, knowledgeable advice and technical expertise. With 34 stores and counting, we are the largest chains of AAA club-owned repair facilities in the USA. In our clean and conveniently located facilities, we offer a full range of automotive repair and maintenance services to AAA members and non-members. Every AAA Car Care facility is staffed with ASE-certified technicians who ensure that every car is treated with the utmost care.\nImportant Note\nACG’s Compensation philosophy is to provide a market-competitive structure of fair, equitable and performance-based pay to attract and retain excellent talent that will enable ACG to meet its short and long-term goals. ACG utilizes a geographic pay differential as part of the base salary compensation program. Pay ranges outlined in this posting are based on the various ranges within the geographic areas which ACG operates. Salary at time of offer is determined based on these and other factors as associated with the job and job level.\nThe above statements describe the principle and essential functions, but not all functions that may be inherent in the job. This job requires the ability to perform duties contained in the job description for this position, including, but not limited to, the above requirements. Reasonable accommodations will be made for otherwise qualified applicants, as needed, to enable them to fulfil these requirements.\nThe Auto Club Group, and all of its affiliated companies, is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender identity, sexual orientation, national origin, disability or protected veteran status.\nPrimary Location\nUnited States-Georgia-Marietta\nWork Locations\nGA-Sandy Plains Car Care Plus\nJob\nAutomotive Service/Repair\nOrganization\nCar Care\nSchedule\nFull-time\nShift\nDay\nEmployee Status\nRegular\nJob Type\nRegular\nJob Level\nIndividual Contributor\nTravel\nNo\nJob Posting\nJan 27, 2023, 8:25:04 AM", "Years Experience": "2 years\n20 years", "Years Context": "....2 years minimum experience repairing vehicles at dealership or automotive cen....\n....wth over the past 20 years and counting. Build your skills, experience and thrive in a company that has a demonstrated track r....\n.... vacation your first year11 paid holidaysWe offer profit sharing, and 401k with matching contributions.Automatic 4% 401K empl....", "Skills": "git(1)", "Remote Allowed": false}, {"Date Added": "01/27/2023", "Job ID": "3453726345", "URL": "https://www.linkedin.com/jobs/view/3453726345/", "Job Title": "Account Executive, LE/GE, GTS", "Company": "Gartner", "Description": "Who are we?\nGartner delivers actionable, objective insight to executives and their teams. Our expert guidance and tools enable faster, smarter decisions and stronger performance on an organization’s most critical priorities. We’ve grown exponentially since our founding in 1979 and we're proud to have nearly 16,000 associates globally that support our 14,000+ clients in more than 100 countries.\nWhat makes Gartner a great place to work?\nOur teams are composed of individuals from different geographies, cultures, religions, ethnicities, races, genders, sexual orientations, abilities and generations. We believe that a variety of experiences makes us stronger—as individuals, as communities and as an organization. That’s why we're recognized worldwide as a great place to work year after year. We've been recognized by Fortune as one of the World’s Most Admired Companies, named a Best Place to Work for LGBTQ Equality by the Human Rights Campaign Corporate Equality Index and a Best Place to Work for Disability Inclusion by the Disability Equality Index. Looking for a place to turn your big ideas into reality? Join #LifeAtGartner\nWhat we offer:\nOur people are our most valuable asset, so we invest in them from Day 1. When you join our team, you’ll have access to a vast array of benefits to help you live your life well. These resources are designed to support your physical, financial and emotional well-being. We encourage continued personal and professional growth through ongoing learning and development opportunities. Our employee resource groups, charity match and volunteer programs keep you connected to your internal Gartner community and causes that matter to you.\nThe policy of Gartner is to provide equal employment opportunities to all applicants and employees without regard to race, color, creed, religion, sex, sexual orientation, gender identity, marital status, citizenship status, age, national origin, ancestry, disability, veteran status, or any other legally protected status and to affirmatively seek to advance the principles of equal employment opportunity.\nGartner is committed to being an Equal Opportunity Employer and offers opportunities to all job seekers, including job seekers with disabilities. If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation if you are unable or limited in your ability to use or access the Company’s career webpage as a result of your disability. You may request reasonable accommodations by calling Human Resources at +1 (203) 964-0096 or by sending an email to ApplicantAccommodations@gartner.com.\nJob Requisition ID:75424\nBy submitting your information and application, you confirm that you have read and agree to the country or regional recruitment notice linked below applicable to your place of residence.\nGartner Applicant Privacy Link: https://jobs.gartner.com/applicant-privacy-policy\nFor efficient navigation through the application, please only use the back button within the application, not the back arrow within your browser.", "Years Experience": "", "Years Context": ".... great place to work year after year. We've been recognized by Fortune as one of the World’s Most Admired Companies, named a ....", "Skills": "", "Remote Allowed": false}, {"Date Added": "01/27/2023", "Job ID": "3453729311", "URL": "https://www.linkedin.com/jobs/view/3453729311/", "Job Title": "PL/SQL Developer", "Company": "InterEx Group", "Description": "QUALIFICATIONSEducation:Bachelor’s Degree in Computer Science or equivalent (Work Experience in lieu of Education)Knowledge/Skills/Abilities:10 years of development experience using PL/SQL8-10 years of experience with Oracle: In-depth knowledge of Oracle database objects Very good knowledge of SQL Sound knowledge of PL/SQL performance tuning, AWR, ASH analysis, and database statistics gatheringMust have good problem-solving, troubleshooting and communication skills\nPREFERRED EXPERIENCE:Good knowledge of UNIX commands, basic understanding of Shell scriptingExperience with Oracle Database 11g and aboveExperience using software development tools including source control (Git, SVN), quality management ( Agile Central), and Continuous Integration tools (Jenkins, XL Release) is a plus.Experience with Java or other object-oriented languages helpfulGood knowledge of Advanced Queuing, DBMS_SCHEDULER and setting up CRON jobs.", "Years Experience": "10 years\n10 years", "Years Context": "..../Skills/Abilities:10 years of development experience using PL/SQL8-10 years of experience with Oracle: In-depth knowledge of O....", "Skills": "SQL(3)\nGit(1)\nJava(1)", "Remote Allowed": false}, {"Date Added": "01/27/2023", "Job ID": "3457129382", "URL": "https://www.linkedin.com/jobs/view/3457129382/", "Job Title": "Prime Named Account Executive - MuleSoft Healthcare & Life Sciences", "Company": "MuleSoft", "Description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts.\nJob Category\nSales\nJob Details\nAbout MuleSoft, a Salesforce Company\nOur mission is to help organizations change and innovate faster by making it easy to connect the world’s applications, data, and devices. Companies like Spotify, McDonald’s, and Unilever rely on MuleSoft to stay agile, deliver faster, and make the most of their IT investment with API-led connectivity. Hiring exceptional people who want to build a great company together is our number one priority, and we’re committed to providing an equal opportunity workplace where everyone is supported and inspired to do their best work. We work tirelessly to build this culture, and we’re proud to have been named the #1 Top Workplace in the Bay Area and a best place to work 6 years in a row.\nAbout Salesforce\nSalesforce, the Customer Success Platform and world's #1 CRM, empowers companies to connect with their customers in a whole new way. The company was founded on three disruptive ideas: a new technology model in cloud computing, a pay-as-you-go business model, and a new integrated corporate philanthropy model. These founding principles have taken our company to great heights, including being named one of Forbes’s “World’s Most Innovative Company” seven years in a row and #1 on the FORTUNE ‘100 Best Companies to Work For®’ List. We are the fastest growing of the top 10 enterprise software companies, and this level of growth equals incredible opportunities to grow a career at Salesforce. Together, with our whole Ohana (Hawaiian for \"family\") made up of our employees, customers, partners and communities, we are working to improve the state of the world.\nOur headcount demand is always changing as we grow; some of the locations listed here may or may not have an immediate opening at the time of your application.\nAccount Executive - MuleSoft\nMuleSoft sells into a diverse set of industries and is broken down into the following segments:\nCommercial\nMid-Market\nEnterprise\nStrategic\nKey\nEvery CIO today is being forced to evaluate their integration strategy in order to move faster and increase innovation to meet the demands of the market. Organizations are spending over $443 billion on integration work every year, yet they still can’t move fast enough to outpace competition. MuleSoft is creating a new category of software to uniquely solve this massive challenge, with our industry-leading integration platform and a maniacal focus on customer success for over 1,200 enterprises across the globe.\nWe are looking for an outcomes-oriented, highly collaborative Account Executive with an entrepreneurial spirit to help us tackle this massive market opportunity and achieve significant revenue targets. MuleSoft is one of the fastest growing enterprise software companies ever, and our Sales team is key to our explosive growth across the globe.\nYour Impact\nThis is not your standard tactical role selling a piece of software. You will be the CEO of your territory, owning and driving the go-to-market strategy, and leading the sales cycle with a cross-functional team. We are paving the way to not only change the way our customers build software, but transform the way they do business. You will sell strategic business outcomes with long-term, high growth engagements: 45 customers have $1M+ ACV, and we have a 117% dollar net retention rate.\nYour Qualifications\nDepending on the segment, the years of experience and skillset needed to be successful will vary from 5-10+ yrs of quota carrying full-cycle sales experience, software or technology experience selling to IT and business leaders preferred. In addition, a bachelor's degree is strongly preferred.\nAcross all sales teams, we are looking for the following attributes:\nConsultative selling experience\nProspecting Skills\nStrong Communication Skills\nHas a competitive Spirit\nCan collaborate and influence in a “win as a team” environment\nResourceful\nCoachable\nHas a drive for results\nIs a trusted advisor to the customers and colleagues\nEngagement\nStrong business acumen\nCan articulate ROI\nSolution Selling Ability\nStrong Discovery Skills\nObjection Handling Skills\nPlanning and Closing Skills\nAccommodations\nIf you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form.\nPosting Statement\nAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits.\nSalesforce, Inc. and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce, Inc. and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce, Inc. and Salesforce.org will not pay any third-party agency or company that does not have a signed agreement with Salesforce, Inc. or Salesforce.org.\nSalesforce welcomes all.\nFor Colorado-based roles, the base salary hiring range for this position is $74,300 to $193,800.\nFor New York-based roles, the base salary hiring range for this position is $81,700 to $213,200.\nFor California-based roles, the base salary hiring range for this position is $81,700 to $213,200.\nCompensation offered will be determined by factors such as location, level, job-related knowledge, skills, and experience.\nCertain roles may be eligible for incentive compensation, equity, and benefits. More details about our company benefits can be found at the following link: https://www.salesforcebenefits.com.", "Years Experience": "6 years", "Years Context": "....best place to work 6 years in a row.....\n....ative Company” seven years in a row and #1 on the FORTUNE ‘100 Best Companies to Work For®’ List. We are the fastest growing o....\n....tegration work every year, yet they still can’t move fast enough to outpace competition. MuleSoft is creating a new category ....\n.... on the segment, the years of experience and skillset needed to be successful will vary from 5-10+ yrs of quota carrying full-....", "Skills": "", "Remote Allowed": true}, {"Date Added": "01/27/2023", "Job ID": "3455990603", "URL": "https://www.linkedin.com/jobs/view/3455990603/", "Job Title": "Sales and Service Rep (Hourly)", "Company": "Safety-Kleen", "Description": "Overview\n\nSafety-Kleen in Morrow, GA is looking for a CDL Route Driver (Sales and Service Representative) to operate a Class B box truck to provide onsite service for parts washer machines and sell products and services in a defined route. This role provides regularly scheduled parts cleaner service, containerized waste collection for proper disposal, and delivery of petroleum-based lubricants and other related products.\n\nSafety-Kleen, a subsidiary of Clean Harbors is the leading provider of environmental, energy and industrial services throughout the United States, Canada, Mexico and Puerto Rico. Everywhere industry meets environment, Clean Harbors is on-site, providing premier environmental, energy and industrial services. We are solving tough problems through innovation and proven methodology – come be part of the solution with us.\n\nWhy work for Clean Harbors?\nHealth and Safety is our #1 priority and we live it 3-6-5!Focus on maintaining sustainability and cleaning the Earth Recruiting Pay rangeComprehensive health benefits coverage after 30 days of full-time employment including 401K with Company matchOpportunities for growth and development for all the stages of your careerCompany paid training and tuition reimbursement\nResponsibilities\nEnsure Health and Safety is the number one priority by complying with all safe work practices, policies, and processes and always acting in a safe mannerMay visit 10-12 customer sites per daySwitch out 15- & 30-gallon drums of solutionsService parts washer machines and clean out sediment from sinksUp-sell at customer locations and generate new leads in the fieldService automotive repair, fleets, and manufacturing type businessesComplete daily scheduled services, deliveries, and pick-ups in a timely mannerComplete all required documentation and labelingFollow all local, state (provincial) and federal compliance regulations and rulesSafely operate vehicles in accordance with U.S. DOT, local, state (provincial) and federal requirementsSafely observe all corporate operating guidelines and proceduresObserve all company environmental health and safety operating guidelinesPerforms other duties as assigned\nQualifications\nClass B CDLObtain Hazmat and Tanker endorsement within 90 days of employmentBasic computer and math skillsGood written and verbal communication skillsStrong customer service skillsPerform physical functions per job requirements Successfully complete a background check, drug test, and physical, by position\nPreferred Qualifications\nHazmat and Tanker endorsementPrevious route driving or commercial driving experienceBusiness to business sales experience\nClean Harbors is an equal opportunity employer. We do not discriminate against applicants due to race, ancestry, color, sexual orientation, gender identity, national origin, religion, age, physical or mental disability, veteran status, or based on any other federal, state/provincial, or local protected class.\n\nClean Harbors is a Military & Veteran friendly company.\nSK", "Years Experience": "", "Years Context": "", "Skills": "", "Remote Allowed": false}, {"Date Added": "01/27/2023", "Job ID": "3455940451", "URL": "https://www.linkedin.com/jobs/view/3455940451/", "Job Title": "Sales Associate", "Company": "Spencer's", "Description": "Job Description\nThe Sales Associate is responsible for maintaining Guest Services as per Company Standard. The Sales Associate will support the Store Management Team by generating sales, conducting housekeeping, merchandising, signing, pricing, POS operations and loss prevention in adherence to all Company policies and procedures. The minimum age requirement for this position is 16. The physical demands of the job require climbing ladders, lifting up to 50 pounds and may require 8 hours of standing/walking.", "Years Experience": "", "Years Context": "", "Skills": "", "Remote Allowed": false}, {"Date Added": "01/27/2023", "Job ID": "3451614743", "URL": "https://www.linkedin.com/jobs/view/3451614743/", "Job Title": "Software Engineer", "Company": "JPMorgan Chase & Co.", "Description": "The Asset and Wealth Management Observability and Reliability Engineering Team is a diverse and inclusive team comprised of Software Engineers, Infrastructure Engineers, and Site Reliability Engineers with a wide range of subject matter expertise. As an SRE on this team, you will get to build thoughtful and strategic tools from the ground up that help to solve large scale technology problems, reduce toil through the SDLC lifecycle, and implement SRE practices within applications. Our current tech stack consists primarily of Python/FastAPI and React.js. During the development lifecycle, we also leverage other tools/platforms/services such as Jenkins, Dynatrace, Splunk, Prometheus, and Terraform. In addition, we aim to stay up-to-date with the latest industry trends and standards, and adopt applicable tools and practices where possible.\nJPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world's most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.\nThe health and safety of our colleagues, candidates, clients and communities has been a top priority in light of the COVID-19 pandemic. JPMorgan Chase was awarded the \"WELL Health-Safety Rating\" for all of our 6,200 locations globally based on our operational policies, maintenance protocols, stakeholder engagement and emergency plans to address a post-COVID-19 environment.\nAs a part of our commitment to health and safety, we have implemented various COVID-related health and safety requirements for our workforce. Employees are expected to follow the Firm's current COVID-19 or other infectious disease health and safety requirements, including local requirements. Requirements include sharing information including your vaccine card in the firm's vaccine record tool, and may include mask wearing. Requirements may change in the future with the evolving public health landscape. JPMorgan Chase will consider accommodation requests as required by applicable law.\nWe offer a competitive total rewards package including base salary determined based on the role, experience, skill set, and location. For those in eligible roles, discretionary incentive compensation which may be awarded in recognition of individual achievements and contributions. We also offer a range of benefits and programs to meet employee needs, based on eligibility. These benefits include comprehensive health care coverage, on-site health and wellness centers, a retirement savings plan, backup childcare, tuition reimbursement, mental health support, financial coaching and more. Additional details about total compensation and benefits will be provided during the hiring process.\nEqual Opportunity Employer/Disability/Veterans", "Years Experience": "00 years", "Years Context": "....story spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial ba....", "Skills": "Python(1)\nReact(1)\nexpress(1)", "Remote Allowed": false}, {"Date Added": "01/27/2023", "Job ID": "3457138261", "URL": "https://www.linkedin.com/jobs/view/3457138261/", "Job Title": "Sales Specialist", "Company": "Cintas", "Description": "Job DescriptionCintas is seeking a Sales Specialist in Training for Cintas Fire Protection. Responsibilities include selling our products and services to new customers, generating new business, cold calling, presenting and demonstrating our products and services, and working with the service department to ensure customer satisfaction.Our Sales Representatives EnjoySolid base salary and commission potentialExtensive car package (lease/gas/insurance, maintenance allowance)Monthly bonuses and incentivesA comprehensive 12-week sales training programMentorship programAnnual recognition eventsRequiredSkills/QualificationsHigh School Diploma/GED; Bachelor's Degree preferredValid driver's licensePreferredBusiness-to-business, industrial and/or outside sales experienceCold calling experience1-3 years' sales experienceOur Employee-partners EnjoyCompetitive Pay401(k)/Profit Sharing/ESOPMedical, Dental and Vision Insurance PackageDisability and Life Insurance PackagePaid Time Off and HolidaysCareer Advancement OpportunitiesHeadquartered in Cincinnati, Cintas is a publicly held company traded over the Nasdaq Global Select Market under the symbol CTAS and is a component of both the Standard & Poor’s 500 Index and Nasdaq-100 Index.Cintas Corporation helps more than 900,000 businesses of all types and sizes get READY™ to open their doors with confidence every day by providing a wide range of products and services that enhance our customers’ image and help keep their facilities and employees clean, safe and looking their best. With products and services including uniforms, mats, mops, restroom supplies, first aid and safety products, fire extinguishers and testing, and safety and compliance training, Cintas helps customers get Ready for the Workday®.To support our growth across North America, we’re seeking driven professionals with ambition to move up within our company. Our professional culture, our dedication to our employee-partners and limitless career opportunities—these are just a few benefits we’re proud to offer. Our employee-partners know every job is critical, and that teamwork drives innovation. Let’s talk about how you’ll fit into our team and how your hard work will be recognized through competitive pay, world-class benefits and ongoing career development. Are you Ready™ for limitless opportunities at Cintas?Cintas Corporation is an EEO/Affirmative Action Employer and will make all employment-related decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.Job Category: SalesOrganization: FireEmployee Status: RegularSchedule: Full TimeShift: 1st Shift", "Years Experience": "1-3 years", "Years Context": "....alling experience1-3 years' sales experienceOur Employee-partners EnjoyCompetitive Pay401(k)/Profit Sharing/ESOPMedical, Denta....", "Skills": "", "Remote Allowed": false}]