[{"jobId": "3380754856", "title": "Volunteer: Website Developer- Global Paint for Charity", "company": "VolunteerMatch", "description": "Our efforts have reached a population of 13000000 and our worldwide volunteers have completed 625800 volunteer hours by painting beautiful murals, family homes including schools, sports centers, orphanages, churches, and homeless shelters. At Global Paint, we believe that everyone, no matter their circumstances, deserves to live in a beautiful and colorful environment. Increasing access to paint in underserved communities could improve the local economic power for millions of vulnerable families and uplift the spirit of the people.\nWhether you’re a partner, donor, funder, or volunteer - we can do even more together.\nWe seek someone who has the educational background and work experience in website design and or website programming as evident with a portfolio of websites you have created individually or participated in the development.\nOur website address is www.globalpaints.org\nThe ideal volunteer candidate will help The Global Paint for Charity initiatives by advising, providing configuration, and implementing our website.\nIn this role, the website developer will have end-to-end responsibilities and collaborate on strategy, design, setup of integrations, etc. With the unique opportunity to impact the growth and process of the practice.\nAdditional Responsibilities For Our Website Developer Include\nWorking with our Executive Director, volunteer board, and volunteer staff to design and deliver websites for complex projects.Ensuring solutions are designed for high availability, scalability, security, and supportability.Acting as a specialist focusing on the Squarespace platform with the ability to use API, CSS, HTML, and any other tools, and skills required to complete the projectWorking as part of and managing cross-functional DevOps teamsTo be considered for this role, you must have the following skills and experience\nMinimum of 2 years of hands-on experience developing for Squarespace's platform.Wordpress, API, HTML, CSS, etc. If you are interested in the above volunteer opportunity, please send your resume and cover letter to info@globalpaints.org with the position in the subject line.\nWe hope to hear from you soon, and we greatly appreciate your interest in our organization!\nThis is a volunteer opportunity provided by VolunteerMatch, in partnership with LinkedIn for Good.", "years experience": ["2 years"], "years context": ["Minimum of 2 years of hands-on experience developing for Squarespace's platform.Wordpress, API, HTML, CSS, etc. If you"], "skills": ["CSS", "HTML", "HTML", "CSS"], "listedAt": 1673523446000}, {"jobId": "3437128202", "title": "Sr. Front End Engineer", "company": "Aha!", "description": "Aha! is a very different type of high-growth SaaS company. We are self-funded, highly profitable, and 100 percent remote. We provide the world's #1 product development software so teams can build products that customers love. More than 600,000 product builders use our suite of tools which includes Aha! Roadmaps , Aha! Ideas , Aha! Create , and Aha! Develop . And they rely on our training programs via Aha! Academy to become product development experts. We are recognized as one of the best fully remote companies to work for, champion the Bootstrap Movement , and have given over $1M to people in need through Aha! Cares . Learn more at www.aha.io .\nOur team\nAha! engineering is a mid-sized, fully remote team that is highly productive. We are centered around North American time zones so we can collaborate during the workday.\nWe help each other grow: We each bring unique skills to the table and want our teammates to feel valued from the start. Our onboarding program exposes new hires to the codebase and lets them contribute right away. We move quickly: We ship code multiple times a day. We believe in getting valuable features in front of customers and iteratively improving as we learn what works and what does not. We value product over process: We want the team to have the time and focus on solving complex challenges. We minimize the overhead by setting clear goals and avoiding heavyweight processes and excessive meetings.We share knowledge freely: We share our learnings with each other and with the developer community. Our engineering blog demonstrates how we tackle interesting challenges at Aha! We enjoy: We like what we do. And we want you to love your team and your job too. Learn more about The Responsive Method , our company values , and the generous benefits we offer.Our technology\nOur web application is a single-instance, multi-tenant Ruby on Rails monolith supported by Postgres (database), Redis (background jobs), and memcached (Rails caching). We also run a Node.js webserver to support collaborative editing and real-time updates. Our application is hosted on Amazon Web Services and architected with ECS for reproducibility and scalability.\nSome Of The Features We Have Built With React Include\nWe use React for rich client-side experiences on the front end.\n Our fully collaborative text editor : Supports multiple cursors and simultaneous editing by any number of users. We pride ourselves in the underlying technology . Our presentation editor : Allows users to create presentations with slide themes, shapes, text, and embedded Aha! reports that update live so the presentation is always current. Our Gantt chart : Supports scaling and scrolling to change the timeline, drag-and-drop, and quick actions to create records or sort the bars.\nWe embrace new technologies that help us deliver a lovable product, but we also remain cognizant of the maintenance overhead that a new library or platform brings. We solve the problems in front of us, rather than prematurely optimizing to address issues that may never materialize.\nWe do most of our planning and collaboration in Aha! Roadmaps and built Aha! Develop so that software engineers and their teams could take advantage of those same rich features. We use Slack and Zoom for video calls. (Email? Rarely.)\nYour Experience\nAll of our engineers work across the full stack. As a Senior Front End Engineer, you will spend the majority of your time working with React or HTML/CSS. You will also write significant back end code in Ruby on Rails to support the front end features you are building.\nYou Also Have The Below Experience And Skills\nWe believe that being a kind person who elevates the rest of the team is just as valuable as writing great code. You have strong problem-solving skills and experience working on important functionality for a cloud-based product. You are humble, eager to learn, and always willing to help others learn as well. You want teammates who enjoy solving problems regardless of the technologies and techniques involved. You have worked at meaningful scale before and want to do so again.\n2+ years of experience working in ReactProducing scalable, data-intensive React pagesExperience building features (ideally at a high-growth SaaS company)Active collaborator with product teamsYour work at Aha!\nAs a Senior Front End Engineer, Your Work Will Include\nWe work on a broad range of features across the full stack.\nImplementing new features for our users, touching each layer of the MVC as neededBuilding deeply interactive reporting interfaces using ReactWorking proactively with product and UX to refine and iterate on specifications as the feature takes shapeOptimizing browser performance on screens and components that render large quantities of data to ensure Aha! is snappy and satisfying to useInterfacing directly with users to quickly squash bugs as part of our regular customer support rotation Documenting components in our style guide to help drive consistency\nIf this role sounds appealing, we would love to hear from you. (A real human reviews every application.)\nGrow with us\nEveryone deserves to reach their fullest potential. We know that when we do work that matters with people we care about in a high-growth environment, we feel engaged and alive. And our goal is to help you do just that. We offer all the benefits you would expect and more, including profit sharing. The specific benefits listed below are reflective of what we offer U.S.-based hires. We also do our best to extend identical benefits to international teammates.\nThe base salary range for this role in the US is between $110,000 and $190,000Cash-based compensation also includes profit sharing and we contribute a percentage of your total pay each month towards your retirementMedical, dental, and vision plans — for many teammates, we cover 100 percent of the premiumsUp to 200 hours of paid time off a year to spend however you want30 to 90 days of paid parental leave and five to 10 days of paid care and bereavement leaveUp to $1,000 annually for third-party education, along with paid time off to immerse yourself in learningVolunteer opportunities throughout the year\nBase salary and total compensation are dependent upon many factors, such as: skills, experience, and relevant past roles", "years experience": ["2+ years"], "years context": ["2+ years of experience working in ReactProducing scalable, data-intensive React pagesExperience building fea", "s of paid time off a year to spend however you want30 to 90 days of paid parental leave and five to 10 days of paid care and ", "ities throughout the year"], "skills": ["Bootstrap", "Postgres", "Node", "Amazon", "React ", "React ", "front end", "full stack", "Front End", "React ", "HTML", "CSS", "front end", "React", "React ", "Front End", "full stack", "React"], "listedAt": 1673580705000}, {"jobId": "3406467699", "title": "Lead / Staff Full Stack Software Engineer (Bangkok based, relocation provided)", "company": "Agoda", "description": "About Agoda\nAgoda is an online travel booking platform for accommodations, flights, and more. We build and deploy cutting-edge technology that connects travelers with more than 2.5 million accommodations globally. Based in Asia and part of Booking Holdings, our 6,000+ employees representing 90+ nationalities foster a work environment rich in diversity, creativity, and collaboration. We innovate through a culture of experimentation and ownership, enhancing the ability for our customers to experience the world.\nGet to Know our Team:\nThe Full Stack Engineering Department builds the Agoda web and app products. We have several teams in front-end focusing on different aspects of our products including accommodations, flights, payments, marketing, post-booking services, and more. Agoda’s marketplace is the world. We build localized and optimized user experiences at scale on every major internet platform. These include our mobile websites, native apps, and desktop sites. We hire people from around the world who have a passion for using technology to create and implement the best user experiences. Our teams work on the full stack and build end-to-end systems including user interfaces, APIs, backend systems, and database systems. Our products are always evolving and under experimentation. We accomplish this by having an amazing degree of automation, CI/CD systems, and use a modularized approach. As we are data driven and measure our results, we continually innovate and improve our work. We are looking for the next great talent who strives to learn and grow and has a standard of excellence, strong sense of ownership, and great technical skills.\nThe Opportunity:\nLead / Staff engineer is the key role in our technology organization working together with individual contributors and senior leadership. Our Lead engineers are heavily involved in the hiring and mentoring process and are the go-to people who design and implement new systems and components. We are looking for people who are passionate to take on more responsibility and driving major architectural changes in Agoda. It’s expected from you in this role as Lead / Staff engineer to push Agoda forward technically by adopting new technologies and setting higher standards.\nIn this Role, you’ll get to:\nMaintain ownership and responsibility of mission critical systemsBe hands on – build high volume platforms using cutting-edge technologies like React and GraphQLMentor and coach other software engineersBe a major contributor to our agile and scrum practicesDesign and lead crucial technical projects and initiatives cross teams and departmentsStay on the leading edge of technical know-how, industry trends and drive technical innovations\nWhat you’ll Need to Succeed:\n7 years of experience developing web applications in client-side frameworks such as React, Angular, VueJS, etc. 6+ years preferredB.S. in Computer Science or quantitative field; M.S. preferredWorking experience with agile, analytics, A/B testing and/or feature flags, Continuous Delivery, Trunk-based DevelopmentExcellent HTML/CSS skills – you understand not only how to build the data, but how to make it look great tooExcellent understanding of object-oriented JavaScript, TypeScriptYou love new technologies and approaches and want to use the best tools available. We want people who can help us continually evolve our stackGreat communication and coordination skillsExcellent analytical thinking and problem-solving skillsYou have a good command of the English language\nIt’s Great if you have:\nKnowledge in physical architecture at scale, building resilient, no single point of failures, highly available solutionsKnowledge in one or more of the following: NoSQL technologies (Cassandra, ScyllaDB, ElasticSearch, Redis, DynamoDB, etc), Queueing system experience (Kafka, RabbitMQ, SQS, Azure Service Bus, etc)Working Experience with Containers and Dockerization, also K8S is a plusKnowledge and hands on experience in CI/CD solutions would be a plusStrong experience in all aspects of client-side performance optimization,Extremely proficient in modern coding and design practices. For example, Clean Code, SOLID principals, and TDDExperience in multiple front-end platforms including iOS, Android, Web, and API servicesHave worked on an app or internet company that is at scale with large numbers of users and transactions per secondHave experience in a data driven company with experience analyzing and working with Big DataLead teams and greenfield projects solving large system problemsWorked on global projects serving world markets with distributed data centers and localization of the front end and data\nThis position is based in Bangkok, Thailand (Relocation Provided)\n#sanfrancisco #sanjose #losangeles #sandiego #oakland #denver #miami #orlando #atlanta #chicago #boston #detroit #newyork #portland #philadelphia #dallas #houston #austin #seattle #sydney #melbourne #perth #toronto #vancouver #montreal #shanghai #beijing #shenzhen #prague #Brno #Ostrava #cairo #alexandria #giza #estonia #paris #berlin #munich #hamburg #stuttgart #cologne #frankfurt #hongkong #budapest #jakarta #bali #dublin #telaviv #milan #rome #tokyo #osaka #kualalumpur #amsterdam #oslo #manila #warsaw #krakow #bucharest #moscow #saintpetersburg #capetown #johannesburg #seoul #barcelona #madrid #stockholm #zurich #taipei #bangkok #Phuket #istanbul #london #manchester #liverpool #edinburgh #kiev #hcmc #hanoi #wroclaw #poznan #katowice #rio #salvador #IT #ENG #4\nEqual Opportunity Employer \nAt Agoda, we pride ourselves on being a company represented by people of all different backgrounds and orientations. We prioritize attracting diverse talent and cultivating an inclusive environment that encourages collaboration and innovation. Employment at Agoda is based solely on a person’s merit and qualifications. We are committed to providing equal employment opportunity regardless of sex, age, race, color, national origin, religion, marital status, pregnancy, sexual orientation, gender identity, disability, citizenship, veteran or military status, and other legally protected characteristics.\nWe will keep your application on file so that we can consider you for future vacancies and you can always ask to have your details removed from the file. For more details please read our privacy policy .\nTo all recruitment agencies: Agoda does not accept third party resumes. Please do not send resumes to our jobs alias, Agoda employees or any other organization location. Agoda is not responsible for any fees related to unsolicited resumes.\n", "years experience": ["7 years", "6+ years"], "years context": ["7 years of experience developing web applications in client-side frameworks such as React, Angular, VueJS, ", "etc. 6+ years preferredB.S. in Computer Science or quantitative field; M.S. preferredWorking experience with agil"], "skills": ["Full Stack", "front-end", "full stack", "React ", "GraphQL", "React", "HTML", "CSS", "JavaScript", "NoSQL", "front-end", "iOS", "Android", "front end"], "listedAt": 1673537175000}, {"jobId": "3428005862", "title": "Building Operations, Painter", "company": "JLL", "description": "Communicating with clients to determine their painting requirements and helping them make the best decisions for their projectsAssembling scaffolding as requiredCovering trim, floors, furniture, finishing and other surfaces with masking tape, drop cloths and other protective coverings to keep them free of paintSetting up ventilators and other safety equipment to protect Painters from unhealthy fumesPreparing surfaces to be painted by washing them, filling holes and cracks with putty and sanding them until they’re smoothApplying primer and other sealers to paint surfaces to ensure that paint sticks to themMixing and matching paint, stain and other finishes to job specificationsApplying paint, stain and other finishes to paint surfaces using paintbrushes, rollers or sprayersMaintaining an inventory of supplies like paint brushes, rollers and tarpsRemoving old finish using scrapers, chemical compounds or blowtorchesEstimating time and material costs on painting projectsCleaning machines, equipment and work areas using water, solvents and other cleaning aidsReviewing and implementing work orders and assignmentsRemoving and reinstalling fixtures (e.g., doorknobs, electric switch covers) as necessaryFollowing safeguards, rules and regulations", "years experience": [], "years context": [], "skills": [], "listedAt": 1673531529000}, {"jobId": "3437120017", "title": "FT-Sales Associate - ProServices-Opening", "company": "Lowe's Companies, Inc.", "description": "What You Will Do \nAll Lowe’s associates deliver quality customer service while maintaining a store that is clean, safe, and stocked with the products customers need. As a Customer Service Associate, this means:\n Being friendly and professional, welcoming customers to Lowe’s and helping with home improvement project needs. Validating loading tickets and processing orders and deliveries accurately so customers receive merchandise as expected and in a timely manner. Engaging in safe work practices and encouraging others to do the same.\nThe Customer Service Associate is responsible for customers’ experience with Lowe’s. This associate plays a critical role in helping our customers select the right products, ensuring quotes are accurate, verifying correct price labels, and confirming that all customer needs are met. In addition, this associate delivers excellent customer service by listening to customers, using expertise to help customers, and loading merchandise for customers. This associate must always remain vigilant and report any safety or security concerns around the entrance of the store.\nThe Customer Service Associate responsibilities vary dependent on the department he/she supports. Customer Service Associates work in one of the following areas: Appliances, Cabinets, Flooring, Live Nursery, Millwork, Fashion Plumbing, Outlet, Tool Rental, Pro, or Windows & Walls. Individuals applying for a role as a Customer Service Associate may be considered for any one of these areas, depending on hiring needs and skillset.\nTravel Requirements: This role does not require regular travel; however, this role may need to travel on occasion to meetings, trainings, or to support neighboring stores.\nWhat We're Looking For\n Hourly Full Time or Part Time: Generally scheduled 39 to 40 or up to 25 hours per week, respectively; more hours may be required based on the needs of the store. Requires morning, afternoon and evening availability any day of the week. Physical ability to perform tasks that may require prolonged standing, sitting, and other activities necessary to perform job duties. CSAs assigned to the Greeter departments (available in select stores) minimally must be able to lift 10 pounds without assistance; may lift over 10 pounds with or without assistance. CSAs assigned to all other departments (excluding Greeter departments) minimally must be able to lift 25 pounds without assistance; may lift over 25 pounds with or without assistance.\nWhat You Need To Succeed\nMinimum Qualifications\n 6 months of experience using a computer, including inputting, accessing, modifying, or outputting information. 6 months experience using common retail technology, such as smart phones and tablets. Ability to obtain sales related licensure or registration as may be required by law.\nPreferred Qualifications\n 6 months of sales experience identifying and selling products based on customer needs, including credit cards, installations, add-on sales, and explaining warranties, product features, and benefits. 6 months of retail experience providing customer service, including identifying and resolving customer issues, assisting customers in locating product, greeting customers, answering phones, building relationships with customers, and thanking customers for their business. Bi-lingual skills, if applicable to the store. Certification in trade related to department (e.g., hardware, kitchen, plumbing, electrical, lawn and garden, and lumber/building materials).\nEEO Statement\nLowe’s is an equal opportunity employer and administers all personnel practices without regard to race, color, religious creed, sex, gender, age, ancestry, national origin, mental or physical disability or medical condition, sexual orientation, gender identity or expression, marital status, military or veteran status, genetic information, or any other category protected under federal, state, or local law.", "years experience": [], "years context": [], "skills": ["express"], "listedAt": 1673577991000}, {"jobId": "3431784187", "title": "Associate Software Developer", "company": "Pearson", "description": "Associate Java Software Developer , you will be responsible for analysis, design, implementation, and automation testing in a high-performing, experienced team. You will use industry best practices while producing high-quality full stack solutions in a collaborative, agile, results driven environment across a diverse set of business areas: client management, channel technologies, results processing, and incident management systems. You will also be responsible for maintaining and supporting mission-critical applications as necessary. In this role you will be expected to continually grow your technical and domain knowledge as a member of a highly collaborative team continually working on a variety of complex and challenging projects. If you are interested in being a part of an amazing team and learning something new every day, this is the role for you.\nThe Software Developer Will\nBuild Software -- Implement designs following Pearson coding standards and industry best practices; maintain and support mission-critical applications as necessary.Analyze & Design -- Ensure business and requirements artifacts are created that effectively model the customer's requirements. Use tooling and best practices to create design models from requirements.Review -- Participate in requirements, design and code reviewsTest & Deployment -- Work closely with other teams (e.g., QA, configuration management, end users) to release high quality software. Create testable requirements and write and execute unit tests and system automation. Perform DevOps activities as a part of the release and performance management processes.Quality/process improvement -- Participate in group improvement activities and initiatives to improve process and product quality in pursuit of excellenceReporting -- Complete project documentation as required, including logging status, risk, progress, and effort on assigned workPerforms other duties as assigned\nQualifications\nRequired Education & Experience:\nBachelor's degree in Computer Science, MIS, or equivalent technology experience2+ years minimum Java development required1+ years programmatic interaction with relational database systemsCurrent technology stack: Java, JPA, Hibernate, Web Services (REST/SOAP), AngularJSExperience in OOAD, design patterns, SQL and UML1+ years Agile experience\nDesired Knowledge, Skills & Abilities\nExperience in creating design documents, performing code reviews and test driven developmentDesire to expand knowledge in many development languages, applications, and toolsProven ability to quickly learn new processes and tools, business domains and technical applicationsAbility to think technically and analyticallyAbility to understand philosophy of architectureMust assimilate information, distill knowledge, apply experience and provide solution alternatives and recommendationsMust have strong time management skills - including ability to work well under pressure, plan, set priorities, adapt to change, and meet established timelinesMust develop effective relationships with internal and external contacts and within your teamMust be a self-starter and detail-orientedMust have a positive and energetic demeanorEffective written and verbal communication skillsCreative problem-solving skills\nExperience with some or all of the following tools (Required):\nJava SE AND EE (1 years)Spring framework (1 years)Web Services (1 years)REST services (1 years)SQL (1 years)JBOSS OR Tomcat (1 years)AngularJS (and other Javascript frameworks)OOAD designAgile development (1 years)Design patterns\nExperience with some or all of the following tools (Desired):\nJPARabbitMQ or JMSHibernateSOASwingGauge and SeleniumSplunkNew Relic\nPearson is an Affirmative Action and Equal Opportunity Employer and a member of E-Verify. We are committed to building a team that represents a variety of backgrounds, perspectives, and skills. The more inclusive we are, the better our work will be. All employment is decided based on qualifications, merit, and business need. All qualified applicants will receive consideration for employment without regard to race, ethnicity, color, religion, sex, sexual orientation, gender identity, gender expression, age, national origin, protected veteran status, disability status, or any other group protected by law.\nCompensation at Pearson is influenced by a wide array of factors including but not limited to skill set, level of experience, and specific location. As required by the Colorado, California, Washington State, and New York City laws, the pay range for this position is as follows:\nMinimum full-time salary range is between $85,000 - $100,000.\nThis position is not bonus eligible, and information on benefits offered is here.\nLearning is the most powerful force for change in the world. More than 20,000 Pearson employees deliver our products and services in nearly 200 countries, all working towards a common purpose – to help everyone achieve their potential through learning. We do that by providing high quality, digital content and learning experiences, as well as assessments and qualifications that help people build their skills and grow with the world around them. We are the world’s leading learning company. Learn more at pearsonplc.com.\nPearson believes that wherever learning flourishes, so do people. We are committed to being an anti-racist company in everything we do. We value the power of an inclusive culture and a strong sense of belonging. We promote a culture where differences are embraced, opportunities are accessible, consideration and respect are the norm, and all individuals are supported in reaching their full potential. Through our talent, we believe that diversity, equity, and inclusion make us a more innovative and vibrant place to work. People are at the center, and we are committed to a sustainable environment and workplace where talent can learn, grow, and thrive.  \nTo learn more about Pearson’s commitment to a diverse and inclusive workforce, please click here:  http://www.pearson.com/careers/diversity-and-inclusion.html \nPearson is an Affirmative Action and Equal Opportunity Employer and a member of E-Verify. We are committed to building a team that represents a variety of backgrounds, perspectives, and skills. The more inclusive we are, the better our work will be. All employment is decided based on qualifications, merit, and business need. All qualified applicants will receive consideration for employment without regard to race, ethnicity, color, religion, sex, sexual orientation, gender identity, gender expression, age, national origin, protected veteran status, disability status, or any other group protected by law.\nJob: TECHNOLOGY\nOrganization: Assessment & Qualifications\nSchedule: FULLTIME\nReq ID: 9775\n#location\n", "years experience": ["2+ years", "1+ years", "1+ years", "1 years", "1 years", "1 years", "1 years", "1 years", "1 years", "1 years"], "years context": ["hnology experience2+ years minimum Java development required1+ years programmatic interaction with relational database systems", "terns, SQL and UML1+ years Agile experience", "Java SE AND EE (1 years)Spring framework (1 years)Web Services (1 years)REST services (1 years)SQL (1 years)JBOSS OR Tomcat", " (1 years)AngularJS (and other Javascript frameworks)OOAD designAgile development (1 years)Design patterns"], "skills": ["Java", "full stack", "Java", "Java", "SQL", "Java", "SQL", "Javascript", "express", "aws", "git", "html", "express"], "listedAt": 1673564865000}, {"jobId": "3437122004", "title": "Systems Engineer - Morrow, GA", "company": "Dice", "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Vector Consulting, Inc, is seeking the following. Apply via Dice today!\nOur government client is looking for an experienced Systems Engineeron a 3+ months’ renewable contractopportunityin Morrow, GA.\nPosition: Systems Engineer\nJob Summary:\nDesign, configure, upgrade, and support existing enterprise systems and infrastructure services to ensure operational reliability.\nConfigure and administer the university’s email service in conjunction with its third-party cloud service provider.\nProactively monitor system and network performance. Promptly investigate and resolve problems upon identification to ensure service reliability. Open and manage third-party vendor incidents as required. When service issues arise, drive the associated root cause analysis, debugging, support, and post-mortem analysis for said service interruptions.\nCollaborate with application and project teams to understand needs and equip them with required infrastructure services to enable successful outcomes.\nStrong commitment to knowledge management and configuration documentation as it relates to infrastructure services.\nProactively research articles, tutorials, and videos to learn about new technologies and best practices being promoted by vendors and fellow higher education institutions. Ensure alignment and compliance with requirements encumbered within the agency Information Technology Handbook.\nMentor fellow division-wide team members and stakeholders (as necessary) on associated technology solutions and services.\nTechnology Experience:\nMicrosoft Server 2012-2019 (Primary)\nRedHat Linux (Secondary)\nVMware\nStorage: HP Nimble / Exagrid / Dell MD3800i\nVEEAM Backup\nE-Mail: Exchange 2019 on Premise / Microsoft 365, Exchange Online\nActive Directory / Azure ADFS\nRequired Skills:\nPowerShell Scripting\nExcellent oral and written communication skills with experience communicating proactively with customers, team members, and vendors.\nInnate customer-centric mindset with a focus on improving service delivery experiences.\nRequired/Desired Skills:\n4 Years of Microsoft Server 2012-2019 (Primary) Required4 Years of RedHat Linux (Secondary) Highly desired4 Years of VMware Required4 Years of Storage: HP Nimble / Exagrid / Dell MD3800i Required4 Years of VEEAM Backup Required4 Years of E-Mail: Exchange 2019 on Premise / Microsoft 365, Exchange Online Required4 Years of Active Directory / Azure ADFS Required\nAbout Vector:\nVector Consulting, Inc., (Headquartered in Atlanta) is an IT Talent Acquisition Solutions firm committed to delivering results. Since our founding in 1990, we have been partnering with our customers, understanding their business, and developing solutions with a commitment to quality, reliability and value. Our continuing growth has been and continues to be built around successful relationships that are based on our organization's operating philosophy and commitment to ** People, Partnerships, Purpose and Performance - THE VECTOR WAY\nwww.vectorconsulting.com “Celebrating 30 years of service”\n provided by Dice", "years experience": ["0 years"], "years context": [".com “Celebrating 30 years of service”"], "skills": [], "listedAt": 1673578830000}, {"jobId": "3348494432", "title": "AVP, Principal JEE Software Engineer", "company": "Synchrony", "description": "Job Description\n\nRole Summary/Purpose:\n\nA Software Engineer Should Be Proficient In\n\nSoftware Engineers have extensive knowledge of programming languages, the environments in which software are developed and operated and are well versed in software development lifecycle. A software engineer can be front-end, back-end or full-stack engineers.\nProgramming and codingFundamentals of computer scienceDesign and architectureAlgorithms and data structuresInformation analysisDebugging softwareTesting softwareProficiency in integration patternsOutstanding all-round communication skills and ability to work collaboratively.\nWe’re proud to offer you choice and flexibility. You have the option to be remote, and work from home, or come into one of our offices. You may be occasionally requested to commute to our nearest office for in person engagement activities such as team meetings, training and culture events.\n\nEssential Responsibilities\nDesign, develop and install software solutions to meet business and technical requirements.Work in a constantly evolving environment, due to technological advances and the strategic direction of the organization.Create, maintain, and audit software systems - built on high standards of availability, stability, security, and performance - in alignment with architects and analysts. Incorporate resiliency into software design and development.Investigate problem areas. Improve system quality by identifying issues and common patterns and developing standard operating procedures.Test software systems to diagnose and resolve system faults; Improve existing codebases and peer review code changes.Partner with technology leaders in adherence to technology strategy and roadmap.Follow software development lifecycle.Ensure that the software that is written is easy to integrate to, for internal and external consumption.Design and implement monitoring, alerting and appropriate metrics to track and report performance and operational efficiency of software.Research and recommend on evolving technologies, including mobile, Cloud and social media.Drive technical innovation and efficiency in software operations via simplification and automation.Create technical specifications and standards.Shared responsibility of supporting applications in productionPerform other duties and/or special projects as assigned\nQualifications/Requirements\nBachelor’s degree and a minimum 5 years of experience with application development OR, in lieu of degree, High School Diploma/GED 7 years of application development experienceMinimum of 5 years of full stack development using Spring, other JEE technologies, Spring REST API and UI technologies and frameworksMinimum 3 years of experience in application design\nDesired Characteristics\nStrong working knowledge of fintech Industry as it relates to consumer financing Deep experience building and consuming web services via SOAP and REST Deep Agile expertise Critical thinking, problem solving and creativity Experience with dependency management tools like Maven or Gradle Experience with continuous integration environments like Jenkins Experience building and deploying application on Pivotal Cloud Foundry Experience with writing unit, integration, and UI test cases Experience in generating OpenAPI / Swagger specificationsWorking knowledge of API gateways Working knowledge of the mobile industry including HTML5, Native languages, and mobile web\nGrade/Level: 10\n\nThe salary range for this position is 65,000.00 - 130,000.00 USD Annual\n\nSalaries are adjusted according to market in CA and Metro NY and some positions are bonus eligible.\n\nEligibility Requirements\nYou must be 18 years or olderYou must have a high school diploma or equivalentYou must be willing to take a drug test, submit to a background investigation and submit fingerprints as part of the onboarding processYou must be able to satisfy the requirements of Section 19 of the Federal Deposit Insurance Act.New hires (Level 4-7) must have 9 months of continuous service with the company before they are eligible to post on other roles. Once this new hire time in position requirement is met, the associate will have a minimum 6 months’ time in position before they can post for future non-exempt roles. Employees, level 8 or greater, must have at least 24 months’ time in position before they can post. All internal employees must consistently meet performance expectations and have approval from your manager to post (or the approval of your manager and HR if you don’t meet the time in position or performance expectations).\nLegal authorization to work in the U.S. is required. We will not sponsor individuals for employment visas, now or in the future, for this job opening. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.\n\nOur Commitment\n\nWhen you join us, you’ll be part of a diverse, inclusive culture where your skills, experience, and voice are not only heard—but valued. We celebrate the differences in all of us and believe that our individual, unique perspectives is what makes Synchrony truly a great place to work. Together, we’re building a future where we can all belong, connect and turn ideals into action. Through the power of our 8 Diversity Networks+, with more than 60% of our workforce engaged, you’ll find community to connect with an opportunity to go beyond your passions.\n\nThis starts when you choose to apply for a role at Synchrony. We ensure all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.\n\nReasonable Accommodation Notice\nFederal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. Please tell us if you require a reasonable accommodation to apply for a job or to perform your job. Examples of reasonable accommodation include making a change to the application process or work procedures, providing documents in an alternate format, using a sign language interpreter, or using specialized equipment.If you need special accommodations, please call our Career Support Line so that we can discuss your specific situation. We can be reached at 1-866-301-5627. Representatives are available from 8am – 5pm Monday to Friday, Central Standard Time\nJob Family Group\n\nInformation Technology", "years experience": ["5 years", "7 years", "5 years", "3 years", "8 years"], "years context": ["gree and a minimum 5 years of experience with application development OR, in lieu of degree, High School Diploma/GED 7 years o", "perienceMinimum of 5 years of full stack development using Spring, other JEE technologies, Spring REST API and UI technologies", " frameworksMinimum 3 years of experience in application design", "You must be 18 years or olderYou must have a high school diploma or equivalentYou must be willing to take a drug test, s"], "skills": ["front-end", "full-stack", "full stack", "HTML5"], "listedAt": 1673519696000}, {"jobId": "3435892802", "title": "Medical Service Technician Driver", "company": "National HME", "description": "Description:\nNational HME is the one of the nation's largest direct service durable medical equipment providers offering services from more than 50 full service branch locations and additional network providers. Do you have a heart for helping people? Are you looking for a rewarding work opportunity? If so, please consider applying to join our team at National HME! We are looking for compassionate individuals who want to make a difference in our patients' lives. National HME, Inc. is now accepting applications for positions working at our location in Marietta, GA .\n \nWe have an immediate need for a full time Medical Service Technician Driver . We offer a competitive hourly rate, full benefits, 401k with match, PTO, and training in career path. MST's deliver and instruct hospice patients or family members on medical equipment and supplies in their place of residence or assisted care facility while providing highly responsible patient care services in addition to the following responsibilities.\n Safely drive and maintain company vehicle (16-foot box truck or van).Receives a daily route and required supply list and prepares the truck for delivery by pulling stock, loading equipment on the truck, and securing and staging the vehicle.Delivers, unloads, and sets the equipment to full functionality.Reviews basic equipment operation and instructs patients and/or caregivers on the proper use and care.Follows the daily route to pick up and/or exchange equipment. Breaks down, loads and returns equipment.Effectively communicates with customer service to relay order changes and issues, route delays, stock availability and delivery and pick up of equipment.Champions our Mission Statement and Family Standard and filter decisions through them.\nRequirements:High school diploma or general education degree (GED) requiredDelivery experience preferredA current state issued driver's license is requiredAbility to pass a motor vehicle records check (MVR) having it show no major violations (including DUI) in the past 5 consecutive years.Must be at least 21 years of age.Experience working in healthcare, home health or the medical field, preferredMust demonstrate practical knowledge of cleaning techniques and processes applicable to the industry.Applicant must have a clean state criminal background and federal sex offender check, clean drug test, valid driver's license and pass a driving skill test.Available for on-call assignments as needed.Applicant must demonstrate good organization, time management, and communication skills.Must demonstrate proficient ability to foster professional working relationships utilizing strong interpersonal and communication skills organization-wide.Requires the ability to safely operate a company vehicleRequires stamina to maintain attention to detail despite interruptionsRequires strength to lift and carry machinery and/or equipment weighing up to 100 poundsRequires sitting, walking, standing, talking or listeningRequires close vision to small print on computer and or paperwork and our electronic tablet\n\n \nNational HME is an equal opportunity employer that is committed to diversity and inclusion in the workplace. We prohibit discrimination and harassment of any kind based on race, color, sex, religion, sexual orientation, national origin, disability, genetic information, pregnancy, or any other protected characteristic as outlined by federal, state, or local laws.\n \nThis policy applies to all employment practices within our organization, including hiring, recruiting, promotion, termination, layoff, recall, leave of absence, compensation, benefits, and training. National HME makes hiring decisions based solely on qualifications, merit, and business needs at the time.\n \nEvery day, our team members make an impact on the lives of others within their communities. They are compassionate, caring, and friendly and provide comfort to those in hospice care. You will go home every day knowing that you made someone's life better. If you are looking for work with a purpose, come join our growing team and make a difference!", "years experience": ["1 years"], "years context": ["e past 5 consecutive years.Must be at least 21 years of age.Experience working in healthcare, home health or the medical field"], "skills": ["aws"], "listedAt": 1673514432000}]